package pro.sky.JD2AnimalShelterBot.сonstants;


/**
 * Класс, содержащий константы для приюта кошек
 */
public class CatConstants {

    /**
     * Константа - правила знакомства с кошкой
     */
    public static final String CAT_DATING_RULES = """
            Приняв решение взять кошку из приюта, вы можете облегчить процесс знакомства
            и адаптации для себя и своего нового питомца, выполнив несколько простых рекомендаций.
            - Задавайте вопросы.
            Спросите, знают ли сотрудники приюта возраст кошки и детали
            ее прошлой жизни. Спросите, комфортно ли кошке, если ее оставляют одну, беспокоит
            ли ее что-либо, как она обычно себя ведет. Спросите, как она реагирует на детей
            и других животных, а также на ту или иную обстановку, бывает ли она на улице.
            - Проведите время с кошкой.
            Постарайтесь увидеть кошку несколько раз, прежде чем забрать ее, уделите время,
            чтобы она могла познакомиться с вами.
            """;

    /**
     * Константа - контактные данные охраны приюта для кошек для оформления пропуска на машину
     */
    public static final String CAT_CAR_PASS = """
            Для проезда на личном авто на территорию приюта,
            Вам необходимо позвонить на пост охраны по номеру
            8-800-555-66-77 не менее, чем за сутки до прибытия в приют,
            и сообщить номер авто и ФИО водителя.
            """;


    /**
     * Константа - список необходимых документов, чтобы взять кошку
     */
    public static final String CAT_DOCUMENTS = """
            Забирая кошку из приюта, вам надо будет подписать договор о передаче животного,
            а для самой кошки — завести ветпаспорт, куда вписываются проведённые прививки
            и другая важная информация.
            """;


    /**
     * Константа - рекомендации по транспортировке кошки
     */
    public static final String CAT_SHIPPING = """
            Минимум раз в год каждую кошку нужно возить к ветеринару на осмотр и для очередной
            прививки, поэтому вам необходимо обзавестись переноской. Она защищает животное от
            возможных травм, лишнего стресса и контактов с потенциально опасными факторами.
            Без переноски нельзя обойтись не только в общественном транспорте или при пешем
            передвижении, но также в такси и в собственном автомобиле. Даже самый спокойный
            питомец может испугаться громкого шума или резкого торможения, совершить
            непредсказуемые действия, запрыгнув на водителя или под педаль тормоза. Любой переезд
            и даже просто поездка из пункта А в пункт В – это испытание для кошачьих нервов и
            сильный стресс. Поэтому мы рекомендуем по возможности пользоваться собственным
            автомобилем или такси при транспортировке питомцев.
            """;


    /**
     * Константа - рекомендации по обустройству дома для котенка
     */
    public static final String RECOMM_FOR_CAT = """
            Очень важно подготовить дом к появлению нового члена семьи и все тщательно продумать.
                        
            Аллергия – серьезная проблема современного человека; среди людей, выросших в больших
            городах, аллергики встречаются чаще всего. Что же делать, если вы или другой обитатель
            вашего дома в прошлом страдал от аллергии?.. Конечно, в этом случае не стоит слишком
            торопиться с заведением кошки. Для начала необходимо выяснить, есть ли у вас аллергия
            на кошек (точнее говоря, на выделяемый кошками белок). Для этого необходимо
            проконсультироваться с аллергологом и сдать аллергопробы.
                        
            На окнах (тех, которые вы открываете для проветривания) должны стоять сетки-“антикошки”
            (ни в коем случае не москитные – они недостаточно крепки).
                        
            Когтеточка – незаменимый предмет в доме, где есть кошки, если хозяева хотят защитить
            диваны и кресла от когтей своих любимцев. Обычно кошки легко приучаются к когтеточке,
            но лучше, если в доме будет несколько мест для точки когтей – это поможет максимально
            избежать повреждений мебели в первые дни кошки на новом месте.
                        
            Лоток должен находиться в укромном месте, удобном для кошки – например, в ванной комнате.
            Основное правило лотка понятно и очевидно: его необходимо вовремя убирать и поддерживать
            в чистоте, а также поставить два и более лотка, если в доме несколько кошек. Если у вашей
            кошки возникают трудности при пользовании лотком, нужно оставаться терпеливым и попытаться
            понять, чем конкретно вызваны трудности.
                        
            Лоток, переноска и мисочки – абсолютный минимум для кошки, но ведь вы наверняка хотите,
            чтобы ваш питомец не скучал и чувствовал себя комфортно? Для этого подумайте, где он сможет
            спать или просто лежать: конечно, все это можно делать на кровати, диване, стульях и т.д.,
            но, возможно, вы захотите обустроить для кошки собственную лежанку или даже собственный
            многоэтажный домик… выбор за вами!
                        
            И главное – подумайте об игрушках. Это необходимо, если вы берете в дом крошечного котенка
            или молодого котика, но поверьте, многие серьезные коты-патриархи тоже не против побегать
            за ленточкой или поиграть в мяч. Конечно, совсем не обязательно закупать игрушки в
            зоомагазинах: ваш котик будет рад обычной ленточке, клубку, мячику и т.д. А уж если у вас
            дома случайно оказалась картонная коробка – не забудьте предложить ее вашему коту.
            Он обязательно оценит!
            """;

    public static final String RECOMM_FOR_CAT_COMMAND_LABEL = "\uD83D\uDC31  Дом для кошки";

    /**
     * Константа - рекомендации по обустройству дома для кошки с ограниченными возможностями
     */
    public static final String RECOMM_FOR_CAT_INVALID = """
            К большому сожалению мы не знаем, как обустроить дом для кошек с ограниченными
            возможностями. Надеемся, что этот блок когда-то дополнится рекомендациями
            опытных фелинологов и других причастных к содержанию животных лиц.
            """;


}
