package pro.sky.JD2AnimalShelterBot.сonstants;


/**
 * Класс, содержащий константы для приюта собак
 */
public class DogConstants {

    /**
     * Константа - правила знакомства с собакой
     */
    public static final String DOG_DATING_RULES = """
            Процесс знакомства и общения с будущим подопечным
            необходимо начинать заранее. После того, как вы
            сделали выбор, начните навещать животное в приюте,
            строить с ним доверительные отношения: приносить
            собаке лакомства, начать выводить её на прогулки,
            аккуратно гладить. Это должно происходить спокойно
            и ненавязчиво, без какого-либо давления с вашей
            стороны. Когда животное начнёт вас узнавать, вилять
            хвостом при встрече и позволит с ним играть, можно
            устроить пару гостевых посещений, приведя собаку
            в дом. Это поможет собаке в дальнейшем более легкому
            знакомству с незнакомой обстановкой и привыканию
            к новому дому
            """;

    /**
     * Константа - контактные данные охраны приюта для собак для оформления пропуска на машину
     */
    public static final String DOG_CAR_PASS = """
            Для проезда на личном авто на территорию приюта,
            Вам необходимо позвонить на пост охраны по номеру
            8-999-111-22-33 не менее, чем за 3 часа до прибытия в приют,
            и сообщить номер авто и ФИО водителя.
            """;

    /**
     * Константа - список необходимых документов, чтобы взять собаку
     */
    public static final String DOG_DOCUMENTS = """
            Чтобы взять животное из приюта, необходимы следующие
            документы:
                        
            - Договор о резервировании щенка.
            Его можно заключить сразу, не дожидаясь оформления
            щенячьей карточки. В договоре должны быть указаны:
            класс щенка, стандарт, когда и как будет
            осуществляться передача.
                        
            - Договор передачи животного.
            Договор передачи животного составляется, если вы
            берете животного из приюта: он позволит кураторам
            или тому, кто нашел животного, быть уверенным в том,
            что вы будете хорошо о нем заботиться и не скроетесь
            в неизвестном направлении. В таком договоре должны
            значиться ваши паспортные данные, и к нему должна
            быть приложена копия паспорта.
                        
            - Щенячья карта (если применимо).
            "Щенячья карта — самый первый документ юного пса,
            его вы получите вместе с собакой. В ней указывается:
            порода, полная кличка щенка, пол, окрас, полная дата
            рождения, код и номер клейма, фамилия и адрес
            заводчика и владельца щенка, сведения о происхождении
            (отец, мать, номера их родословных, окрасы). Когда
            щенку исполняется полтора года, он получает взамен
            карты родословную, но часть «щенячки» (она делится на
            две части) остается у вас.
                        
            - Родословная собаки (если применимо).
            Когда щенку исполняется полтора года, на основании
            щенячьей карточки хозяин может получить свидетельство
            о происхождении, то есть родословную. Родословная может
            быть только единого образца РКФ. В ней должны быть
            указаны: полная кличка собаки, пол, дата рождения,
            название клуба и номер записи в племенной книге,
            сведения о предках собаки до четвертого колена, сведения
            об успехах предков на выставках, эмблемы FCI и РКФ.
            Родословная — гарантия чистопородности собаки и выдается
            на одном из языков на выбор: русском или английском.
                        
            - Ветеринарный паспорт.
            Ветеринарный паспорт нужен каждому животному, чтобы
            участвовать в выставках, получать справки для поездок за
            рубеж и, конечно, чтобы внимательно следить за здоровьем
            питомца. В паспорте должны стоять отметки о дегельминтизации,
            обработке от эктопаразитов, прививках (дата, подпись врача,
            печать, информация о вакцине или препарате) и наклейки от
            этих вакцин. В некоторые паспорта можно вклеить фотографию
            животного.
            """;

    /**
     * Константа - рекомендации по транспортировке собаки
     */
    public static final String DOG_SHIPPING = """
            Позвольте животному познакомиться с контейнером для перевозки
            и автомобилем, в котором пройдёт дорога домой. Заранее
            приучите собаку к наморднику - для этого, посещая приют,
            вкладывайте лакомства в этот аксессуар, используйте его как
            миску. Через некоторое время можно начать надевать намордник
            на собаку перед началом прогулки, и снимать через некоторое
            время. После переезда в новый дом начинается самый главный и
            ответственный этап адаптации собаки в семье. Этот период в
            среднем занимает месяц, в идеале - два или три месяца. Именно
            поэтому очень важно рассчитать оптимальное время для взятия
            животного из приюта: в ближайшие несколько недель не должны быть
            запланированы переезды, семейные путешествия или появление детей.
            Вам будет необходимо достаточно много времени находиться рядом с
            питомцем, контролировать процесс социализации и привыкания, а
            также помогать собаке как можно быстрее адаптироваться в новом доме.
            """;

    /**
     * Константа - рекомендации по обустройству дома для щенка
     */
    public static final String RECOMM_FOR_PUPPY = """
            После того как все административные вопросы решены, самое время
            составить список вещей, необходимых для вашего нового друга, и
            отправиться за покупками.
            В первую очередь вам необходимо купить следующие вещи:
                        
            - Две миски: одну для еды, вторую для воды. Лучше всего купить
            керамическую или из нержавеющей стали — их проще очищать.
                        
            - Нейлоновый или кожаный поводок и ошейник. Для того, чтобы научить
            вашу собаку спокойно гулять на поводке и не тянуть его изо всей
            силы, вполне возможно, потребуется приобрести мягкий намордник.
            Это облегчит процесс дрессировки и приучения к поводку и не
            позволит собаке сбить вас с ног.
                        
            - Принадлежности для ухода за шерстью (груминга).
                        
            - Забавные и абсолютно безопасные для собаки игрушки, в том числе
            стимулирующие на двигательную активность.
                        
            - Лежанку. В магазинах представлен огромный выбор кроваток для
            собак, поэтому у вас есть возможность подобрать ту, которая идеально
            подходит по размеру вашему любимцу, а также соответствует его
            темпераменту (например, некоторые лежанки легче порвать, чем другие).
            Какой бы тип кроватки вы ни выбрали, установите ее в тихом и спокойном
            месте вашего дома, подальше от шума и сквозняков.
                        
            - Домашний вольер из сетки или коробку. Помните: щенкам очень нравятся
            всевозможные корзины и ящики, которые они могут превратить в свой
            собственный неприступный замок. Если вы накроете коробку одеялом и
            положите в нее лежанку, то это сооружение станет самым настоящим
            логовом для вашего питомца, в котором он сможет спрятаться и отдохнуть,
            если ему захочется тишины и покоя. Кроме того, обустройство подобных
            ящиков и коробок непременно поможет вам ускорить процесс обучения вашего
            четвероногого друга, так как щенки не любят, чтобы их потаенное логово
            было грязным, а значит, они быстрее научатся соблюдать чистоту не только
            в своем укрытии, но и во всем доме.
                        
            - Корм. Узнайте у заводчика или в собачьем приюте, чем ваш щенок питался
            ранее, и постарайтесь поддерживать данный рацион как минимум на протяжении
            недели. Со временем вы можете перевести его на новый рацион, если на то
            есть веские основания.
            """;

    /**
     * Константа - рекомендации по обустройству дома для взрослой собаки (разбита на 2 части,
     * т.к. сообщение слишком длинное - выдает ошибку
     */
    public static final String RECOMM_FOR_DOG_1 = """
            Собака становится членом семьи, поэтому вам стоит серьезно позаботиться о
            ее собственном уголке. Вашему четвероногому другу обязательно нужно свое
            место, где он сможет отдохнуть, подремать или просто побыть в одиночестве.
            Выбирая такое место, неплохо бы согласовать его с собакой. Потому что иначе
            пес найдет себе местечко по душе, не спросив вашего мнения.
            Любая собака должна иметь в доме свои места, два из которых обязательны:
            место кормления и место для отдыха.
            Третье — туалет, создается либо по желанию хозяев, либо в экстренных случаях
            (болезнь, появление щенков).
            «Спальня» для вашего питомца".
            Не все собаки любят спать прямо на полу, а некоторым породам
            (например, шарпеям) это и вовсе противопоказано. Поэтому лучше остановите
            свой выбор на матрасике, корзинке с подстилкой или домике. Если позволяют
            средства, то закажите специальную мебель. Диваны и лежаки из зоомагазинов
            полностью продуманы и удобны как для собаки, так и для хозяина.
            Существует несколько правил о которых стоит помнить при создании спального
            места. Приподнимите место над полом на 5 — 8 см (или чуть больше) в
            зависимости от размера собаки. Это делается для того, чтобы уберечь вашего
            питомца от сквозняков, гуляющих по полу. Климат собачьего места должен быть
            максимально постоянным и естественным. Старайтесь сделать так, чтобы
            питомец мог видеть все (ну или почти все), что происходит в доме. Он же
            член семьи. Собаки — стайные животные, им важно видеть и слышать, что
            происходит в их стае, то есть вашей семье.
            """;

    /**
     * Константа - рекомендации по обустройству дома для взрослой собаки (разбита на 2 части,
     * т.к. сообщение слишком длинное - выдает ошибку
     */
    public static final String RECOMM_FOR_DOG_2 = """
            Очень плохая идея — устроить место в коридоре. Проходящие по коридору
            будут все время беспокоить пса, подталкивать его, задевать. А звуки за
            входной дверью — откровенно раздражать, ведь в любой собаке (даже в
            той-терьере) есть инстинкт охранника. Из-за постоянной «угрозы нападения»
            на ваш дом, питомец не сможет полноценно отдохнуть, выспаться, что в итоге
            плохо скажется на его нервной системе. Сама лежанка должна подходить по
            размерам собаке, поэтому не стоит для щенка крупной породы (доберман, овчарка)
            покупать сразу большой матрас или корзинку, ему там будет неуютно. Лучше взять
            размером поменьше, а потом заменить на большую.
            Маленький секрет: измерьте вашего питомца от носа до кончика хвоста и в холке
            (от лопаток и до стопы) и прибавьте к этому еще 10 — 15 см. Это и будут размеры
            лежанки, которая ему идеально подойдет.
            Кстати, место, на котором спит собака, нужно как можно чаще чистить пылесосом
            или щеткой, стирать хотя бы несколько раз в год или отдавать в химчистку. Этим
            вы убережете вашего питомца от блох и клещей, которых можно принести с улицы.
            А заодно избавите себя и весь дом от вредной микрофлоры, которая разводится
            в грязных лежанках просто на раз.
            Место для кормления.
            Конечно же, у вашего любимца должно быть обеденное место, которое нужно
            обустроить подальше от собачьей спальни. По традиции большинство наших
            любителей собак кормят своих питомцев на кухне. Это разумно, ведь вода и
            мусорное ведро всегда под рукой. Не ставьте миску около батареи, плиты или
            мусорного ведра. Найдите уголочек, где пес не будет мешать вам, а вы ему.
            Последнее утверждение очень актуально, ведь собаку нельзя беспокоить во
            время еды — можно легко спровоцировать агрессию с ее стороны.
            Кстати, лучше всего приобрести миску на штативе (например такую) или купить
            специальную подставочку. Когда пес ест в позе жирафа (широко расставив передние
            лапы и опустив голову к миске), он привыкает горбиться и ходить с опущенной головой.
            Привычка ходить в таком положении собак некоторых пород (например тех же шарпеев)
            может привести к проблемам с дыханием. Но самое основное — такая привычка
            портит экстерьер, который очень важен для выставочных собак.
            И последнее место — туалет.
            Чаще всего туалет создают для маленьких собачек (той-терьер, чихуахуа, левретка),
            которые редко ходят на улицу по нужде, либо для щенков, пока они не привыкнут
            делать свои дела вне дома. Еще один случай когда нужно создание туалета в
            доме — больная собака, которая не может идти на выгул. Или кормящая мать,
            которая даже при сильной нужде не покинет своих щенков. Остальные случаи —
            опционально на ваш выбор.
            Общение с жизнерадостным, обожающим хозяина четвероногим питомцем принесет много
            удовольствия. Чтобы ему было хорошо в вашем доме обеспечьте комфортные условия для еды,
            отдыха, сна, порадуйте игрушкой, найдите время для совместных игр и прогулок, и ваш
            питомец обязательно ответит вам радостным настроением и бесконечной преданностью.
            """;

    /**
     * Константа - рекомендации по обустройству дома для взрослой собаки (склейка из 2х частей одного описания)
     */
    public static final String RECOMM_FOR_DOG = RECOMM_FOR_DOG_1 + RECOMM_FOR_DOG_2;


    /**
     * Константа - рекомендации по обустройству дома для собаки с ограниченными возможностями
     */
    public static final String RECOMM_FOR_DOG_INVALID = """
            К большому сожалению мы не знаем, как обустроить дом для собак с ограниченными
            возможностями. Надеемся, что этот блок когда-то дополнится рекомендациями
            опытных кинологов и других причастных к содержанию животных лиц.
            """;

    /**
     * Константа - советы кинолога по первичному общению с собакой
     */
    public static final String CYNOLOGIST_INITIAL_ADVICE = """
            Забирать нового друга лучше в утреннее время, чтобы у малыша было больше времени
            освоиться и пообщаться с новыми владельцами. Хорошо, если период адаптации
            придется на ваш отпуск или хотя бы на выходные.
            Несмотря на то, что всех членов семьи переполняют эмоции не стоит сразу же начинать
            играть со щенком, тискать его. Объясните детям, что малышу нужно привыкнуть к новой
            обстановке.
            Если в вашем доме есть другие животные, то стоит начать знакомство осторожно и
            исключительно под присмотром, первое время не оставляйте питомцев наедине.
            Опустите щенка на пол, дайте ему обойти, обнюхать и осмотреть новое жилище.
            Если собака боится, сидит на одном месте, не стоит настаивать на изучении территории,
            придет время и малыш сам решит все исследовать. Погладьте щенка, поговорите с ним,
            предложите игрушку.
            Когда малыш немного освоится, то покажите ему ключевые места. Покормите щенка из мисок,
            дайте воды. После кормления отнесите на пеленку, высока вероятность, что собака захочет
            в туалет. Затем можно познакомить питомца с лежанкой и игрушками.
            Постарайтесь заранее решить будете ли вы разрешать собаке забираться на кровать,
            диваны и кресла. Если да, то с первого дня познакомьте питомца с мягкой мебелью, но не
            оставляйте его одного, малыш может упасть и ушибиться. Если ваш щенок миниатюрной породы,
            чтобы в дальнейшем ему легче было забираться на кровать, можно установить специальные
            ступеньки или лесенки.
            Обратите внимание на важные моменты, которые уберегут вас от лишнего беспокойства:
            ●     Первые месяцы жизни щенки очень много спят — это нормально. Не стоит будить собаку
            и беспокоить лишний раз, это может негативно сказаться на психике. Если малыш много спит,
            но в период бодрствования активен, играет, хорошо кушает и ходит в туалет, то поводов
            для беспокойства нет.
            ●     Переезд в новый дом, расставание с матерью, братьями и сестрами - стресс для щенка.
            Чем младше собака, тем ей тяжелее. Наберитесь терпения, будьте тактичны. Не настаивайте на
            играх и общении, резко не хватайте щенка, не носите на руках. Малышу нужно время для
            адаптации, он сам покажет вам, когда захочет внимания.
            ●     Не ругайте щенка и не наказывайте его. Собака не понимает криков, физическое насилие
            недопустимо. Объясняйте все короткими командами: “Нет”, “Нельзя”, “Фу”. Если щенок грызет
            обувь, то убирайте ее и переключайте внимание на игрушки, если заметили лужицу в
            неположенном месте, то промокните ее пеленкой и дайте понюхать питомцу. Со временем собака
            научится понимать вас с полуслова, но до этого нужно сохранять терпение и работать как над
            собой, так и над питомцем.
            ●     Следите за общим состоянием. При рвоте, жидком стуле, вялости, сниженном аппетите
            следует проконсультироваться с ветеринарным врачом.
            """;

    /**
     * Константа - рекомендации по проверенным кинологам
     */
    public static final String RECOMMENDED_CYNOLOGIST = """
            Если Вам понадобится опытный кинолог, мы рекомендуем обратиться к следующим
            специалистам:
                        
            - Светлана Чернобаева
                        
            О себе
            Я работаю кинологом 6 лет, очень люблю собак. Особенность моей работы в том что,
            я подхожу к каждому клиенту индивидуально. Я всегда стремлюсь получить результат
            от своей работы, всегда готова к любым ситуациям и никогда не останавливаюсь на
            достигнутом.
                        
            Образование
            Центр служебного собаководства «ДОСААФ», инструктор-дрессировщик служебных собак
                        
            Опыт
            Центр служебного собаководства «ДОСААФ», инструктор-дрессировщик
                        
            Ссылка на портфолио: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&tabName=PROFILES&profileId=ChernobayevaSS&profileTabName=reviews
             
            ___________
                     
            - Эльвира Альмухамедова
                        
            О себе
            Профессиональна Дрессировка собак
            Оборудованный кинологический центр для собак любой породы и возраста
            Сдача экзаменов, показ на выставках
                        
            Образование
            Союз Кинологов Казахстана
                        
            Опыт
            Кинологический центр «Алтын ит»
                        
            Ссылка на портфолио: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&tabName=PROFILES&profileId=AlmukhamedovaEA&profileTabName=reviews
                        
            ___________
                     
            - Коровникова Анастасия
                      
            О себе
            Имею огромный опыт с животными, в особенности с собаками. Всегда учитываю
            пожелания клиента и выполняю поставленную задачу по максимуму. Также
            занимаюсь передержкой собак
                        
            Опыт
            Кинологический центр «Алтын ит»
                        
            Ссылка на портфолио: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&tabName=PROFILES&profileId=AnastasiyaKY3&profileTabName=reviews
                        
            """;


    /**
     * Константа - причины отказа в усыновлении животного
     */
    public static final String REASONS_FOR_REFUSAL = """
            Существует пять причин, по которым чаще всего отказывают желающим
            «усыновить» домашнего любимца:
                        
            1. Большое количество животных дома
            В конце 2018 года в Российской Федерации был принят закон «Об
            ответственном обращении с животными». В нем установлено ограничение
            на количество питомцев, содержащихся в одном домовладении. При этом
            точное число не названо — в каждом случае вопрос решается индивидуально,
            исходя из материальных возможностей и жилищных условий человека.
            Важно, чтобы хозяин обеспечивал правильное кормление и своевременное
            медицинское обслуживание всем своим животным. Также, согласно
            санитарно-эпидемиологическим правилам, запрещено скопление большого числа
            птиц и млекопитающих на небольшой территории — это повышает риск
            возникновения инфекционных болезней.
                        
            2. Нестабильные отношения в семье
            Любые перемены — это стресс для животного. Кошки и собаки привыкают к людям,
            скучают после вынужденной разлуки с хозяевами и даже отказываются от еды.
            Если семейная пара планирует развод, не стоит брать питомца, чтобы потом
            не обрекать его на страдания.
                        
            3. Наличие маленьких детей
            Семьям, где есть дети до 5 лет, сложно взять животное из приюта сразу по двум
            причинам. Во-первых, есть риск, что собака или кошка будет проявлять агрессию
            по отношению к маленькому человеку. Во-вторых, дети сами часто провоцируют
            конфликт, дергая зверька за хвост и уши или бросая в него тяжелые предметы.
            Происходит это по недосмотру и с молчаливого попустительства взрослых людей,
            но в итоге виноватым оказывается животное. Если ребенок получит царапины или
            укусы, родители, вместо того, чтобы искать контакт с питомцем и воспитывать
            своего отпрыска, предпочтут избавиться от хвостатого «источника опасности».
                        
            4. Съемное жилье
            Не все домовладельцы разрешают арендаторам заводить животных. Отчасти это
            связано с опасениями, что кот или собака испортят мебель, обои и деревянные
            части интерьера. Кроме того, в комнатах остается неприятный запах меток и
            шерсти, устранение которого потребует дополнительных трат. Если хозяин жилья
            обнаружит обман со стороны квартиранта, то, скорее всего, заявит о желании
            немедленно расторгнуть договор. После этого и люди, и их питомец окажутся на
            улице. А поскольку найти съемную жилплощадь, где будут рады присутствию
            мурлыкающего или лающего создания, не так уж просто, судьба животного будет
            незавидной: оно снова станет ничейным и бездомным.
                        
            5. Животное в подарок или для работы
            Присутствие животного в доме накладывает на его владельцев ряд обязательств
            (в том числе и финансовых), связанных с кормлением, лечением, правильным
            содержанием. По этой причине приобретение питомца не должно быть спонтанным;
            прежде чем решиться на такой шаг, человек должен все обдумать и рассчитать.
            Получая котенка или щенка в подарок, новый владелец лишен такой возможности.
            Даже если поначалу он рад появлению мягкого пушистого комочка, то по прошествии
            нескольких дней, столкнувшись с тем, что животное требует много внимания и не
            всегда послушно, может изменить свое мнение и попросту избавиться от такой
            «обузы». Хорошо, если зверька вернут обратно в приют или отдадут в добрые руки,
            но, как показывает практика, ненужных питомцев попросту выставляют за дверь.
            То же самое происходит, если животное не оправдало возлагаемых на него надежд:
            кот отказался ловить мышей, а собака не поняла, что ее задача — охрана двора.
            Единственная выгода, которую получает человек, заводя питомца, — это радость
            общения, но некоторые хозяева считают иначе и не хотят содержать «дармоедов».
            Такие животные снова пополняют ряды бездомных. Все причины для отказа сводятся
            к желанию сделать так, чтобы животное, которое уже успело вкусить прелести
            уличной жизни, не оказалась выброшенным снова. Поэтому вряд ли стоит обижаться
            на работников приюта, если они не позволили вам забрать домой понравившегося
            питомца.

            """;

    public static final String DATING_RULES_COMMAND_LABEL = "\uD83D\uDC36 \uD83D\uDC31  Правила знакомства с питомцем";

    public static final String DOCUMENTS_COMMAND_LABEL = "\uD83D\uDCDC  Список необходимых документов";

    public static final String SHIPPING_COMMAND_LABEL = "\uD83D\uDEFB  Транспортировка питомца";

    public static final String RECOMM_FOR_PUPPY_COMMAND_LABEL = "\uD83C\uDFE1  Дом для щенка";

    public static final String RECOMM_FOR_DOG_COMMAND_LABEL = "\uD83C\uDFE1  Дом для взрослой собаки";

    public static final String RECOMM_FOR_PET_INVALID_COMMAND_LABEL = "\uD83C\uDFE1  Дом для питомца-инвалида";

    public static final String CYNOLOGIST_INITIAL_ADVICE_COMMAND_LABEL = "\uD83D\uDCC3  Советы кинолога";

    public static final String RECOMMENDED_CYNOLOGIST_COMMAND_LABEL = "\uD83C\uDFC5  Лучшие кинологи";

    public static final String REASONS_FOR_REFUSAL_COMMAND_LABEL = "\uD83D\uDEC7  Почему Вам могут отказать?";
}
