<!DOCTYPE HTML>
<html lang="ru">
<head>
<!-- Generated by javadoc (19) on Wed Dec 28 19:24:25 MSK 2022 -->
<title>Constant Field Values</title>
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<meta name="dc.created" content="2022-12-28">
<meta name="description" content="summary of constants">
<meta name="generator" content="javadoc/ConstantsSummaryWriterImpl">
<link rel="stylesheet" type="text/css" href="stylesheet.css" title="Style">
<link rel="stylesheet" type="text/css" href="script-dir/jquery-ui.min.css" title="Style">
<link rel="stylesheet" type="text/css" href="jquery-ui.overrides.css" title="Style">
<script type="text/javascript" src="script.js"></script>
<script type="text/javascript" src="script-dir/jquery-3.6.0.min.js"></script>
<script type="text/javascript" src="script-dir/jquery-ui.min.js"></script>
</head>
<body class="constants-summary-page">
<script type="text/javascript">var pathtoroot = "./";
loadScripts(document, 'script');</script>
<noscript>
<div>JavaScript is disabled on your browser.</div>
</noscript>
<div class="flex-box">
<header role="banner" class="flex-header">
<nav role="navigation">
<!-- ========= START OF TOP NAVBAR ======= -->
<div class="top-nav" id="navbar-top"><button id="navbar-toggle-button" aria-controls="navbar-top" aria-expanded="false" aria-label="Toggle navigation links"><span class="nav-bar-toggle-icon">&nbsp;</span><span class="nav-bar-toggle-icon">&nbsp;</span><span class="nav-bar-toggle-icon">&nbsp;</span></button>
<div class="skip-nav"><a href="#skip-navbar-top" title="Skip navigation links">Skip navigation links</a></div>
<ul id="navbar-top-firstrow" class="nav-list" title="Navigation">
<li><a href="index.html">Overview</a></li>
<li>Package</li>
<li>Class</li>
<li><a href="overview-tree.html">Tree</a></li>
<li><a href="index-files/index-1.html">Index</a></li>
<li><a href="help-doc.html#constant-values">Help</a></li>
</ul>
</div>
<div class="sub-nav">
<div id="navbar-sub-list"></div>
<div class="nav-list-search"><a href="search.html">SEARCH</a>
<input type="text" id="search-input" disabled placeholder="Search">
<input type="reset" id="reset-button" disabled value="reset">
</div>
</div>
<!-- ========= END OF TOP NAVBAR ========= -->
<span class="skip-nav" id="skip-navbar-top"></span></nav>
</header>
<div class="flex-content">
<main role="main">
<div class="header">
<h1 title="Constant Field Values" class="title">Constant Field Values</h1>
<section class="packages">
<h2 title="Contents">Contents</h2>
<ul>
<li><a href="#pro.sky">pro.sky.*</a></li>
</ul>
</section>
</div>
<section class="constants-summary" id="pro.sky">
<h2 title="pro.sky.*">pro.sky.*</h2>
<ul class="block-list">
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.constants.<a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html" title="class in pro.sky.JD2AnimalShelterBot.constants">CatConstants</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.CAT_CAR_PASS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#CAT_CAR_PASS">CAT_CAR_PASS</a></code></div>
<div class="col-last even-row-color"><code>"\u0414\u043b\u044f \u043f\u0440\u043e\u0435\u0437\u0434\u0430 \u043d\u0430 \u043b\u0438\u0447\u043d\u043e\u043c \u0430\u0432\u0442\u043e \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u044e \u043f\u0440\u0438\u044e\u0442\u0430,\n\u0412\u0430\u043c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043f\u043e\u0437\u0432\u043e\u043d\u0438\u0442\u044c \u043d\u0430 \u043f\u043e\u0441\u0442 \u043e\u0445\u0440\u0430\u043d\u044b \u043f\u043e \u043d\u043e\u043c\u0435\u0440\u0443\n8-800-555-66-77 \u043d\u0435 \u043c\u0435\u043d\u0435\u0435, \u0447\u0435\u043c \u0437\u0430 \u0441\u0443\u0442\u043a\u0438 \u0434\u043e \u043f\u0440\u0438\u0431\u044b\u0442\u0438\u044f \u0432 \u043f\u0440\u0438\u044e\u0442,\n\u0438 \u0441\u043e\u043e\u0431\u0449\u0438\u0442\u044c \u043d\u043e\u043c\u0435\u0440 \u0430\u0432\u0442\u043e \u0438 \u0424\u0418\u041e \u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044f.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.CAT_DATING_RULES">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#CAT_DATING_RULES">CAT_DATING_RULES</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u0440\u0438\u043d\u044f\u0432 \u0440\u0435\u0448\u0435\u043d\u0438\u0435 \u0432\u0437\u044f\u0442\u044c \u043a\u043e\u0448\u043a\u0443 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430, \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043e\u0431\u043b\u0435\u0433\u0447\u0438\u0442\u044c \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u0437\u043d\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430\n\u0438 \u0430\u0434\u0430\u043f\u0442\u0430\u0446\u0438\u0438 \u0434\u043b\u044f \u0441\u0435\u0431\u044f \u0438 \u0441\u0432\u043e\u0435\u0433\u043e \u043d\u043e\u0432\u043e\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430, \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0432 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043f\u0440\u043e\u0441\u0442\u044b\u0445 \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0430\u0446\u0438\u0439.\n- \u0417\u0430\u0434\u0430\u0432\u0430\u0439\u0442\u0435 \u0432\u043e\u043f\u0440\u043e\u0441\u044b.\n\u0421\u043f\u0440\u043e\u0441\u0438\u0442\u0435, \u0437\u043d\u0430\u044e\u0442 \u043b\u0438 \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u0438 \u043f\u0440\u0438\u044e\u0442\u0430 \u0432\u043e\u0437\u0440\u0430\u0441\u0442 \u043a\u043e\u0448\u043a\u0438 \u0438 \u0434\u0435\u0442\u0430\u043b\u0438\n\u0435\u0435 \u043f\u0440\u043e\u0448\u043b\u043e\u0439 \u0436\u0438\u0437\u043d\u0438. \u0421\u043f\u0440\u043e\u0441\u0438\u0442\u0435, \u043a\u043e\u043c\u0444\u043e\u0440\u0442\u043d\u043e \u043b\u0438 \u043a\u043e\u0448\u043a\u0435, \u0435\u0441\u043b\u0438 \u0435\u0435 \u043e\u0441\u0442\u0430\u0432\u043b\u044f\u044e\u0442 \u043e\u0434\u043d\u0443, \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\n\u043b\u0438 \u0435\u0435 \u0447\u0442\u043e-\u043b\u0438\u0431\u043e, \u043a\u0430\u043a \u043e\u043d\u0430 \u043e\u0431\u044b\u0447\u043d\u043e \u0441\u0435\u0431\u044f \u0432\u0435\u0434\u0435\u0442. \u0421\u043f\u0440\u043e\u0441\u0438\u0442\u0435, \u043a\u0430\u043a \u043e\u043d\u0430 \u0440\u0435\u0430\u0433\u0438\u0440\u0443\u0435\u0442 \u043d\u0430 \u0434\u0435\u0442\u0435\u0439\n\u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u0430 \u0442\u0430\u043a\u0436\u0435 \u043d\u0430 \u0442\u0443 \u0438\u043b\u0438 \u0438\u043d\u0443\u044e \u043e\u0431\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0443, \u0431\u044b\u0432\u0430\u0435\u0442 \u043b\u0438 \u043e\u043d\u0430 \u043d\u0430 \u0443\u043b\u0438\u0446\u0435.\n- \u041f\u0440\u043e\u0432\u0435\u0434\u0438\u0442\u0435 \u0432\u0440\u0435\u043c\u044f \u0441 \u043a\u043e\u0448\u043a\u043e\u0439.\n\u041f\u043e\u0441\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044c \u0443\u0432\u0438\u0434\u0435\u0442\u044c \u043a\u043e\u0448\u043a\u0443 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0440\u0430\u0437, \u043f\u0440\u0435\u0436\u0434\u0435 \u0447\u0435\u043c \u0437\u0430\u0431\u0440\u0430\u0442\u044c \u0435\u0435, \u0443\u0434\u0435\u043b\u0438\u0442\u0435 \u0432\u0440\u0435\u043c\u044f,\n\u0447\u0442\u043e\u0431\u044b \u043e\u043d\u0430 \u043c\u043e\u0433\u043b\u0430 \u043f\u043e\u0437\u043d\u0430\u043a\u043e\u043c\u0438\u0442\u044c\u0441\u044f \u0441 \u0432\u0430\u043c\u0438.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.CAT_DOCUMENTS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#CAT_DOCUMENTS">CAT_DOCUMENTS</a></code></div>
<div class="col-last even-row-color"><code>"\u0417\u0430\u0431\u0438\u0440\u0430\u044f \u043a\u043e\u0448\u043a\u0443 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430, \u0432\u0430\u043c \u043d\u0430\u0434\u043e \u0431\u0443\u0434\u0435\u0442 \u043f\u043e\u0434\u043f\u0438\u0441\u0430\u0442\u044c \u0434\u043e\u0433\u043e\u0432\u043e\u0440 \u043e \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e,\n\u0430 \u0434\u043b\u044f \u0441\u0430\u043c\u043e\u0439 \u043a\u043e\u0448\u043a\u0438 \u2014 \u0437\u0430\u0432\u0435\u0441\u0442\u0438 \u0432\u0435\u0442\u043f\u0430\u0441\u043f\u043e\u0440\u0442, \u043a\u0443\u0434\u0430 \u0432\u043f\u0438\u0441\u044b\u0432\u0430\u044e\u0442\u0441\u044f \u043f\u0440\u043e\u0432\u0435\u0434\u0451\u043d\u043d\u044b\u0435 \u043f\u0440\u0438\u0432\u0438\u0432\u043a\u0438\n\u0438 \u0434\u0440\u0443\u0433\u0430\u044f \u0432\u0430\u0436\u043d\u0430\u044f \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.CAT_SHIPPING">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#CAT_SHIPPING">CAT_SHIPPING</a></code></div>
<div class="col-last odd-row-color"><code>"\u041c\u0438\u043d\u0438\u043c\u0443\u043c \u0440\u0430\u0437 \u0432 \u0433\u043e\u0434 \u043a\u0430\u0436\u0434\u0443\u044e \u043a\u043e\u0448\u043a\u0443 \u043d\u0443\u0436\u043d\u043e \u0432\u043e\u0437\u0438\u0442\u044c \u043a \u0432\u0435\u0442\u0435\u0440\u0438\u043d\u0430\u0440\u0443 \u043d\u0430 \u043e\u0441\u043c\u043e\u0442\u0440 \u0438 \u0434\u043b\u044f \u043e\u0447\u0435\u0440\u0435\u0434\u043d\u043e\u0439\n\u043f\u0440\u0438\u0432\u0438\u0432\u043a\u0438, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043e\u0431\u0437\u0430\u0432\u0435\u0441\u0442\u0438\u0441\u044c \u043f\u0435\u0440\u0435\u043d\u043e\u0441\u043a\u043e\u0439. \u041e\u043d\u0430 \u0437\u0430\u0449\u0438\u0449\u0430\u0435\u0442 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043e\u0442\n\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u044b\u0445 \u0442\u0440\u0430\u0432\u043c, \u043b\u0438\u0448\u043d\u0435\u0433\u043e \u0441\u0442\u0440\u0435\u0441\u0441\u0430 \u0438 \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u043e\u0432 \u0441 \u043f\u043e\u0442\u0435\u043d\u0446\u0438\u0430\u043b\u044c\u043d\u043e \u043e\u043f\u0430\u0441\u043d\u044b\u043c\u0438 \u0444\u0430\u043a\u0442\u043e\u0440\u0430\u043c\u0438.\n\u0411\u0435\u0437 \u043f\u0435\u0440\u0435\u043d\u043e\u0441\u043a\u0438 \u043d\u0435\u043b\u044c\u0437\u044f \u043e\u0431\u043e\u0439\u0442\u0438\u0441\u044c \u043d\u0435 \u0442\u043e\u043b\u044c\u043a\u043e \u0432 \u043e\u0431\u0449\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u0442\u0440\u0430\u043d\u0441\u043f\u043e\u0440\u0442\u0435 \u0438\u043b\u0438 \u043f\u0440\u0438 \u043f\u0435\u0448\u0435\u043c\n\u043f\u0435\u0440\u0435\u0434\u0432\u0438\u0436\u0435\u043d\u0438\u0438, \u043d\u043e \u0442\u0430\u043a\u0436\u0435 \u0432 \u0442\u0430\u043a\u0441\u0438 \u0438 \u0432 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u0430\u0432\u0442\u043e\u043c\u043e\u0431\u0438\u043b\u0435. \u0414\u0430\u0436\u0435 \u0441\u0430\u043c\u044b\u0439 \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u044b\u0439\n\u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043c\u043e\u0436\u0435\u0442 \u0438\u0441\u043f\u0443\u0433\u0430\u0442\u044c\u0441\u044f \u0433\u0440\u043e\u043c\u043a\u043e\u0433\u043e \u0448\u0443\u043c\u0430 \u0438\u043b\u0438 \u0440\u0435\u0437\u043a\u043e\u0433\u043e \u0442\u043e\u0440\u043c\u043e\u0436\u0435\u043d\u0438\u044f, \u0441\u043e\u0432\u0435\u0440\u0448\u0438\u0442\u044c\n\u043d\u0435\u043f\u0440\u0435\u0434\u0441\u043a\u0430\u0437\u0443\u0435\u043c\u044b\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f, \u0437\u0430\u043f\u0440\u044b\u0433\u043d\u0443\u0432 \u043d\u0430 \u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044f \u0438\u043b\u0438 \u043f\u043e\u0434 \u043f\u0435\u0434\u0430\u043b\u044c \u0442\u043e\u0440\u043c\u043e\u0437\u0430. \u041b\u044e\u0431\u043e\u0439 \u043f\u0435\u0440\u0435\u0435\u0437\u0434\n\u0438 \u0434\u0430\u0436\u0435 \u043f\u0440\u043e\u0441\u0442\u043e \u043f\u043e\u0435\u0437\u0434\u043a\u0430 \u0438\u0437 \u043f\u0443\u043d\u043a\u0442\u0430 \u0410 \u0432 \u043f\u0443\u043d\u043a\u0442 \u0412 \u2013 \u044d\u0442\u043e \u0438\u0441\u043f\u044b\u0442\u0430\u043d\u0438\u0435 \u0434\u043b\u044f \u043a\u043e\u0448\u0430\u0447\u044c\u0438\u0445 \u043d\u0435\u0440\u0432\u043e\u0432 \u0438\n\u0441\u0438\u043b\u044c\u043d\u044b\u0439 \u0441\u0442\u0440\u0435\u0441\u0441. \u041f\u043e\u044d\u0442\u043e\u043c\u0443 \u043c\u044b \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u0435\u043c \u043f\u043e \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u0438 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u043c\n\u0430\u0432\u0442\u043e\u043c\u043e\u0431\u0438\u043b\u0435\u043c \u0438\u043b\u0438 \u0442\u0430\u043a\u0441\u0438 \u043f\u0440\u0438 \u0442\u0440\u0430\u043d\u0441\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u043a\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.RECOMM_FOR_CAT">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#RECOMM_FOR_CAT">RECOMM_FOR_CAT</a></code></div>
<div class="col-last even-row-color"><code>"\u041e\u0447\u0435\u043d\u044c \u0432\u0430\u0436\u043d\u043e \u043f\u043e\u0434\u0433\u043e\u0442\u043e\u0432\u0438\u0442\u044c \u0434\u043e\u043c \u043a \u043f\u043e\u044f\u0432\u043b\u0435\u043d\u0438\u044e \u043d\u043e\u0432\u043e\u0433\u043e \u0447\u043b\u0435\u043d\u0430 \u0441\u0435\u043c\u044c\u0438 \u0438 \u0432\u0441\u0435 \u0442\u0449\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043f\u0440\u043e\u0434\u0443\u043c\u0430\u0442\u044c.\n\n\u0410\u043b\u043b\u0435\u0440\u0433\u0438\u044f \u2013 \u0441\u0435\u0440\u044c\u0435\u0437\u043d\u0430\u044f \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430 \u0441\u043e\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0433\u043e \u0447\u0435\u043b\u043e\u0432\u0435\u043a\u0430; \u0441\u0440\u0435\u0434\u0438 \u043b\u044e\u0434\u0435\u0439, \u0432\u044b\u0440\u043e\u0441\u0448\u0438\u0445 \u0432 \u0431\u043e\u043b\u044c\u0448\u0438\u0445\n\u0433\u043e\u0440\u043e\u0434\u0430\u0445, \u0430\u043b\u043b\u0435\u0440\u0433\u0438\u043a\u0438 \u0432\u0441\u0442\u0440\u0435\u0447\u0430\u044e\u0442\u0441\u044f \u0447\u0430\u0449\u0435 \u0432\u0441\u0435\u0433\u043e. \u0427\u0442\u043e \u0436\u0435 \u0434\u0435\u043b\u0430\u0442\u044c, \u0435\u0441\u043b\u0438 \u0432\u044b \u0438\u043b\u0438 \u0434\u0440\u0443\u0433\u043e\u0439 \u043e\u0431\u0438\u0442\u0430\u0442\u0435\u043b\u044c\n\u0432\u0430\u0448\u0435\u0433\u043e \u0434\u043e\u043c\u0430 \u0432 \u043f\u0440\u043e\u0448\u043b\u043e\u043c \u0441\u0442\u0440\u0430\u0434\u0430\u043b \u043e\u0442 \u0430\u043b\u043b\u0435\u0440\u0433\u0438\u0438?.. \u041a\u043e\u043d\u0435\u0447\u043d\u043e, \u0432 \u044d\u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0441\u043b\u0438\u0448\u043a\u043e\u043c\n\u0442\u043e\u0440\u043e\u043f\u0438\u0442\u044c\u0441\u044f \u0441 \u0437\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0435\u043c \u043a\u043e\u0448\u043a\u0438. \u0414\u043b\u044f \u043d\u0430\u0447\u0430\u043b\u0430 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0432\u044b\u044f\u0441\u043d\u0438\u0442\u044c, \u0435\u0441\u0442\u044c \u043b\u0438 \u0443 \u0432\u0430\u0441 \u0430\u043b\u043b\u0435\u0440\u0433\u0438\u044f\n\u043d\u0430 \u043a\u043e\u0448\u0435\u043a (\u0442\u043e\u0447\u043d\u0435\u0435 \u0433\u043e\u0432\u043e\u0440\u044f, \u043d\u0430 \u0432\u044b\u0434\u0435\u043b\u044f\u0435\u043c\u044b\u0439 \u043a\u043e\u0448\u043a\u0430\u043c\u0438 \u0431\u0435\u043b\u043e\u043a). \u0414\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e\n\u043f\u0440\u043e\u043a\u043e\u043d\u0441\u0443\u043b\u044c\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0441 \u0430\u043b\u043b\u0435\u0440\u0433\u043e\u043b\u043e\u0433\u043e\u043c \u0438 \u0441\u0434\u0430\u0442\u044c \u0430\u043b\u043b\u0435\u0440\u0433\u043e\u043f\u0440\u043e\u0431\u044b.\n\n\u041d\u0430 \u043e\u043a\u043d\u0430\u0445 (\u0442\u0435\u0445, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0432\u044b \u043e\u0442\u043a\u0440\u044b\u0432\u0430\u0435\u0442\u0435 \u0434\u043b\u044f \u043f\u0440\u043e\u0432\u0435\u0442\u0440\u0438\u0432\u0430\u043d\u0438\u044f) \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u0442\u043e\u044f\u0442\u044c \u0441\u0435\u0442\u043a\u0438-\u201c\u0430\u043d\u0442\u0438\u043a\u043e\u0448\u043a\u0438\u201d\n(\u043d\u0438 \u0432 \u043a\u043e\u0435\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u043d\u0435 \u043c\u043e\u0441\u043a\u0438\u0442\u043d\u044b\u0435 \u2013 \u043e\u043d\u0438 \u043d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u043a\u0440\u0435\u043f\u043a\u0438).\n\n\u041a\u043e\u0433\u0442\u0435\u0442\u043e\u0447\u043a\u0430 \u2013 \u043d\u0435\u0437\u0430\u043c\u0435\u043d\u0438\u043c\u044b\u0439 \u043f\u0440\u0435\u0434\u043c\u0435\u0442 \u0432 \u0434\u043e\u043c\u0435, \u0433\u0434\u0435 \u0435\u0441\u0442\u044c \u043a\u043e\u0448\u043a\u0438, \u0435\u0441\u043b\u0438 \u0445\u043e\u0437\u044f\u0435\u0432\u0430 \u0445\u043e\u0442\u044f\u0442 \u0437\u0430\u0449\u0438\u0442\u0438\u0442\u044c\n\u0434\u0438\u0432\u0430\u043d\u044b \u0438 \u043a\u0440\u0435\u0441\u043b\u0430 \u043e\u0442 \u043a\u043e\u0433\u0442\u0435\u0439 \u0441\u0432\u043e\u0438\u0445 \u043b\u044e\u0431\u0438\u043c\u0446\u0435\u0432. \u041e\u0431\u044b\u0447\u043d\u043e \u043a\u043e\u0448\u043a\u0438 \u043b\u0435\u0433\u043a\u043e \u043f\u0440\u0438\u0443\u0447\u0430\u044e\u0442\u0441\u044f \u043a \u043a\u043e\u0433\u0442\u0435\u0442\u043e\u0447\u043a\u0435,\n\u043d\u043e \u043b\u0443\u0447\u0448\u0435, \u0435\u0441\u043b\u0438 \u0432 \u0434\u043e\u043c\u0435 \u0431\u0443\u0434\u0435\u0442 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043c\u0435\u0441\u0442 \u0434\u043b\u044f \u0442\u043e\u0447\u043a\u0438 \u043a\u043e\u0433\u0442\u0435\u0439 \u2013 \u044d\u0442\u043e \u043f\u043e\u043c\u043e\u0436\u0435\u0442 \u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u043e\n\u0438\u0437\u0431\u0435\u0436\u0430\u0442\u044c \u043f\u043e\u0432\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u0439 \u043c\u0435\u0431\u0435\u043b\u0438 \u0432 \u043f\u0435\u0440\u0432\u044b\u0435 \u0434\u043d\u0438 \u043a\u043e\u0448\u043a\u0438 \u043d\u0430 \u043d\u043e\u0432\u043e\u043c \u043c\u0435\u0441\u0442\u0435.\n\n\u041b\u043e\u0442\u043e\u043a \u0434\u043e\u043b\u0436\u0435\u043d \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u044c\u0441\u044f \u0432 \u0443\u043a\u0440\u043e\u043c\u043d\u043e\u043c \u043c\u0435\u0441\u0442\u0435, \u0443\u0434\u043e\u0431\u043d\u043e\u043c \u0434\u043b\u044f \u043a\u043e\u0448\u043a\u0438 \u2013 \u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0432 \u0432\u0430\u043d\u043d\u043e\u0439 \u043a\u043e\u043c\u043d\u0430\u0442\u0435.\n\u041e\u0441\u043d\u043e\u0432\u043d\u043e\u0435 \u043f\u0440\u0430\u0432\u0438\u043b\u043e \u043b\u043e\u0442\u043a\u0430 \u043f\u043e\u043d\u044f\u0442\u043d\u043e \u0438 \u043e\u0447\u0435\u0432\u0438\u0434\u043d\u043e: \u0435\u0433\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0432\u043e\u0432\u0440\u0435\u043c\u044f \u0443\u0431\u0438\u0440\u0430\u0442\u044c \u0438 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0442\u044c\n\u0432 \u0447\u0438\u0441\u0442\u043e\u0442\u0435, \u0430 \u0442\u0430\u043a\u0436\u0435 \u043f\u043e\u0441\u0442\u0430\u0432\u0438\u0442\u044c \u0434\u0432\u0430 \u0438 \u0431\u043e\u043b\u0435\u0435 \u043b\u043e\u0442\u043a\u0430, \u0435\u0441\u043b\u0438 \u0432 \u0434\u043e\u043c\u0435 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043a\u043e\u0448\u0435\u043a. \u0415\u0441\u043b\u0438 \u0443 \u0432\u0430\u0448\u0435\u0439\n\u043a\u043e\u0448\u043a\u0438 \u0432\u043e\u0437\u043d\u0438\u043a\u0430\u044e\u0442 \u0442\u0440\u0443\u0434\u043d\u043e\u0441\u0442\u0438 \u043f\u0440\u0438 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0438 \u043b\u043e\u0442\u043a\u043e\u043c, \u043d\u0443\u0436\u043d\u043e \u043e\u0441\u0442\u0430\u0432\u0430\u0442\u044c\u0441\u044f \u0442\u0435\u0440\u043f\u0435\u043b\u0438\u0432\u044b\u043c \u0438 \u043f\u043e\u043f\u044b\u0442\u0430\u0442\u044c\u0441\u044f\n\u043f\u043e\u043d\u044f\u0442\u044c, \u0447\u0435\u043c \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e \u0432\u044b\u0437\u0432\u0430\u043d\u044b \u0442\u0440\u0443\u0434\u043d\u043e\u0441\u0442\u0438.\n\n\u041b\u043e\u0442\u043e\u043a, \u043f\u0435\u0440\u0435\u043d\u043e\u0441\u043a\u0430 \u0438 \u043c\u0438\u0441\u043e\u0447\u043a\u0438 \u2013 \u0430\u0431\u0441\u043e\u043b\u044e\u0442\u043d\u044b\u0439 \u043c\u0438\u043d\u0438\u043c\u0443\u043c \u0434\u043b\u044f \u043a\u043e\u0448\u043a\u0438, \u043d\u043e \u0432\u0435\u0434\u044c \u0432\u044b \u043d\u0430\u0432\u0435\u0440\u043d\u044f\u043a\u0430 \u0445\u043e\u0442\u0438\u0442\u0435,\n\u0447\u0442\u043e\u0431\u044b \u0432\u0430\u0448 \u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043d\u0435 \u0441\u043a\u0443\u0447\u0430\u043b \u0438 \u0447\u0443\u0432\u0441\u0442\u0432\u043e\u0432\u0430\u043b \u0441\u0435\u0431\u044f \u043a\u043e\u043c\u0444\u043e\u0440\u0442\u043d\u043e? \u0414\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043f\u043e\u0434\u0443\u043c\u0430\u0439\u0442\u0435, \u0433\u0434\u0435 \u043e\u043d \u0441\u043c\u043e\u0436\u0435\u0442\n\u0441\u043f\u0430\u0442\u044c \u0438\u043b\u0438 \u043f\u0440\u043e\u0441\u0442\u043e \u043b\u0435\u0436\u0430\u0442\u044c: \u043a\u043e\u043d\u0435\u0447\u043d\u043e, \u0432\u0441\u0435 \u044d\u0442\u043e \u043c\u043e\u0436\u043d\u043e \u0434\u0435\u043b\u0430\u0442\u044c \u043d\u0430 \u043a\u0440\u043e\u0432\u0430\u0442\u0438, \u0434\u0438\u0432\u0430\u043d\u0435, \u0441\u0442\u0443\u043b\u044c\u044f\u0445 \u0438 \u0442.\u0434.,\n\u043d\u043e, \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u0432\u044b \u0437\u0430\u0445\u043e\u0442\u0438\u0442\u0435 \u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u0434\u043b\u044f \u043a\u043e\u0448\u043a\u0438 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u0443\u044e \u043b\u0435\u0436\u0430\u043d\u043a\u0443 \u0438\u043b\u0438 \u0434\u0430\u0436\u0435 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439\n\u043c\u043d\u043e\u0433\u043e\u044d\u0442\u0430\u0436\u043d\u044b\u0439 \u0434\u043e\u043c\u0438\u043a\u2026 \u0432\u044b\u0431\u043e\u0440 \u0437\u0430 \u0432\u0430\u043c\u0438!\n\n\u0418 \u0433\u043b\u0430\u0432\u043d\u043e\u0435 \u2013 \u043f\u043e\u0434\u0443\u043c\u0430\u0439\u0442\u0435 \u043e\u0431 \u0438\u0433\u0440\u0443\u0448\u043a\u0430\u0445. \u042d\u0442\u043e \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e, \u0435\u0441\u043b\u0438 \u0432\u044b \u0431\u0435\u0440\u0435\u0442\u0435 \u0432 \u0434\u043e\u043c \u043a\u0440\u043e\u0448\u0435\u0447\u043d\u043e\u0433\u043e \u043a\u043e\u0442\u0435\u043d\u043a\u0430\n\u0438\u043b\u0438 \u043c\u043e\u043b\u043e\u0434\u043e\u0433\u043e \u043a\u043e\u0442\u0438\u043a\u0430, \u043d\u043e \u043f\u043e\u0432\u0435\u0440\u044c\u0442\u0435, \u043c\u043d\u043e\u0433\u0438\u0435 \u0441\u0435\u0440\u044c\u0435\u0437\u043d\u044b\u0435 \u043a\u043e\u0442\u044b-\u043f\u0430\u0442\u0440\u0438\u0430\u0440\u0445\u0438 \u0442\u043e\u0436\u0435 \u043d\u0435 \u043f\u0440\u043e\u0442\u0438\u0432 \u043f\u043e\u0431\u0435\u0433\u0430\u0442\u044c\n\u0437\u0430 \u043b\u0435\u043d\u0442\u043e\u0447\u043a\u043e\u0439 \u0438\u043b\u0438 \u043f\u043e\u0438\u0433\u0440\u0430\u0442\u044c \u0432 \u043c\u044f\u0447. \u041a\u043e\u043d\u0435\u0447\u043d\u043e, \u0441\u043e\u0432\u0441\u0435\u043c \u043d\u0435 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u0437\u0430\u043a\u0443\u043f\u0430\u0442\u044c \u0438\u0433\u0440\u0443\u0448\u043a\u0438 \u0432\n\u0437\u043e\u043e\u043c\u0430\u0433\u0430\u0437\u0438\u043d\u0430\u0445: \u0432\u0430\u0448 \u043a\u043e\u0442\u0438\u043a \u0431\u0443\u0434\u0435\u0442 \u0440\u0430\u0434 \u043e\u0431\u044b\u0447\u043d\u043e\u0439 \u043b\u0435\u043d\u0442\u043e\u0447\u043a\u0435, \u043a\u043b\u0443\u0431\u043a\u0443, \u043c\u044f\u0447\u0438\u043a\u0443 \u0438 \u0442.\u0434. \u0410 \u0443\u0436 \u0435\u0441\u043b\u0438 \u0443 \u0432\u0430\u0441\n\u0434\u043e\u043c\u0430 \u0441\u043b\u0443\u0447\u0430\u0439\u043d\u043e \u043e\u043a\u0430\u0437\u0430\u043b\u0430\u0441\u044c \u043a\u0430\u0440\u0442\u043e\u043d\u043d\u0430\u044f \u043a\u043e\u0440\u043e\u0431\u043a\u0430 \u2013 \u043d\u0435 \u0437\u0430\u0431\u0443\u0434\u044c\u0442\u0435 \u043f\u0440\u0435\u0434\u043b\u043e\u0436\u0438\u0442\u044c \u0435\u0435 \u0432\u0430\u0448\u0435\u043c\u0443 \u043a\u043e\u0442\u0443.\n\u041e\u043d \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043e\u0446\u0435\u043d\u0438\u0442!\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.RECOMM_FOR_CAT_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#RECOMM_FOR_CAT_COMMAND_LABEL">RECOMM_FOR_CAT_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udc31  \u0414\u043e\u043c \u0434\u043b\u044f \u043a\u043e\u0448\u043a\u0438"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.CatConstants.RECOMM_FOR_CAT_INVALID">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/CatConstants.html#RECOMM_FOR_CAT_INVALID">RECOMM_FOR_CAT_INVALID</a></code></div>
<div class="col-last even-row-color"><code>"\u041a \u0431\u043e\u043b\u044c\u0448\u043e\u043c\u0443 \u0441\u043e\u0436\u0430\u043b\u0435\u043d\u0438\u044e \u043c\u044b \u043d\u0435 \u0437\u043d\u0430\u0435\u043c, \u043a\u0430\u043a \u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u0434\u043e\u043c \u0434\u043b\u044f \u043a\u043e\u0448\u0435\u043a \u0441 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u043d\u044b\u043c\u0438\n\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u044f\u043c\u0438. \u041d\u0430\u0434\u0435\u0435\u043c\u0441\u044f, \u0447\u0442\u043e \u044d\u0442\u043e\u0442 \u0431\u043b\u043e\u043a \u043a\u043e\u0433\u0434\u0430-\u0442\u043e \u0434\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0441\u044f \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0430\u0446\u0438\u044f\u043c\u0438\n\u043e\u043f\u044b\u0442\u043d\u044b\u0445 \u0444\u0435\u043b\u0438\u043d\u043e\u043b\u043e\u0433\u043e\u0432 \u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u043f\u0440\u0438\u0447\u0430\u0441\u0442\u043d\u044b\u0445 \u043a \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u043d\u0438\u044e \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043b\u0438\u0446.\n"</code></div>
</div>
</li>
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.constants.<a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html" title="class in pro.sky.JD2AnimalShelterBot.constants">DogConstants</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.CYNOLOGIST_INITIAL_ADVICE">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#CYNOLOGIST_INITIAL_ADVICE">CYNOLOGIST_INITIAL_ADVICE</a></code></div>
<div class="col-last even-row-color"><code>"\u0417\u0430\u0431\u0438\u0440\u0430\u0442\u044c \u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0440\u0443\u0433\u0430 \u043b\u0443\u0447\u0448\u0435 \u0432 \u0443\u0442\u0440\u0435\u043d\u043d\u0435\u0435 \u0432\u0440\u0435\u043c\u044f, \u0447\u0442\u043e\u0431\u044b \u0443 \u043c\u0430\u043b\u044b\u0448\u0430 \u0431\u044b\u043b\u043e \u0431\u043e\u043b\u044c\u0448\u0435 \u0432\u0440\u0435\u043c\u0435\u043d\u0438\n\u043e\u0441\u0432\u043e\u0438\u0442\u044c\u0441\u044f \u0438 \u043f\u043e\u043e\u0431\u0449\u0430\u0442\u044c\u0441\u044f \u0441 \u043d\u043e\u0432\u044b\u043c\u0438 \u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u0430\u043c\u0438. \u0425\u043e\u0440\u043e\u0448\u043e, \u0435\u0441\u043b\u0438 \u043f\u0435\u0440\u0438\u043e\u0434 \u0430\u0434\u0430\u043f\u0442\u0430\u0446\u0438\u0438\n\u043f\u0440\u0438\u0434\u0435\u0442\u0441\u044f \u043d\u0430 \u0432\u0430\u0448 \u043e\u0442\u043f\u0443\u0441\u043a \u0438\u043b\u0438 \u0445\u043e\u0442\u044f \u0431\u044b \u043d\u0430 \u0432\u044b\u0445\u043e\u0434\u043d\u044b\u0435.\n\u041d\u0435\u0441\u043c\u043e\u0442\u0440\u044f \u043d\u0430 \u0442\u043e, \u0447\u0442\u043e \u0432\u0441\u0435\u0445 \u0447\u043b\u0435\u043d\u043e\u0432 \u0441\u0435\u043c\u044c\u0438 \u043f\u0435\u0440\u0435\u043f\u043e\u043b\u043d\u044f\u044e\u0442 \u044d\u043c\u043e\u0446\u0438\u0438 \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0441\u0440\u0430\u0437\u0443 \u0436\u0435 \u043d\u0430\u0447\u0438\u043d\u0430\u0442\u044c\n\u0438\u0433\u0440\u0430\u0442\u044c \u0441\u043e \u0449\u0435\u043d\u043a\u043e\u043c, \u0442\u0438\u0441\u043a\u0430\u0442\u044c \u0435\u0433\u043e. \u041e\u0431\u044a\u044f\u0441\u043d\u0438\u0442\u0435 \u0434\u0435\u0442\u044f\u043c, \u0447\u0442\u043e \u043c\u0430\u043b\u044b\u0448\u0443 \u043d\u0443\u0436\u043d\u043e \u043f\u0440\u0438\u0432\u044b\u043a\u043d\u0443\u0442\u044c \u043a \u043d\u043e\u0432\u043e\u0439\n\u043e\u0431\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0435.\n\u0415\u0441\u043b\u0438 \u0432 \u0432\u0430\u0448\u0435\u043c \u0434\u043e\u043c\u0435 \u0435\u0441\u0442\u044c \u0434\u0440\u0443\u0433\u0438\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435, \u0442\u043e \u0441\u0442\u043e\u0438\u0442 \u043d\u0430\u0447\u0430\u0442\u044c \u0437\u043d\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u043e \u043e\u0441\u0442\u043e\u0440\u043e\u0436\u043d\u043e \u0438\n\u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u043e \u043f\u043e\u0434 \u043f\u0440\u0438\u0441\u043c\u043e\u0442\u0440\u043e\u043c, \u043f\u0435\u0440\u0432\u043e\u0435 \u0432\u0440\u0435\u043c\u044f \u043d\u0435 \u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0439\u0442\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432 \u043d\u0430\u0435\u0434\u0438\u043d\u0435.\n\u041e\u043f\u0443\u0441\u0442\u0438\u0442\u0435 \u0449\u0435\u043d\u043a\u0430 \u043d\u0430 \u043f\u043e\u043b, \u0434\u0430\u0439\u0442\u0435 \u0435\u043c\u0443 \u043e\u0431\u043e\u0439\u0442\u0438, \u043e\u0431\u043d\u044e\u0445\u0430\u0442\u044c \u0438 \u043e\u0441\u043c\u043e\u0442\u0440\u0435\u0442\u044c \u043d\u043e\u0432\u043e\u0435 \u0436\u0438\u043b\u0438\u0449\u0435.\n\u0415\u0441\u043b\u0438 \u0441\u043e\u0431\u0430\u043a\u0430 \u0431\u043e\u0438\u0442\u0441\u044f, \u0441\u0438\u0434\u0438\u0442 \u043d\u0430 \u043e\u0434\u043d\u043e\u043c \u043c\u0435\u0441\u0442\u0435, \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u043d\u0430\u0441\u0442\u0430\u0438\u0432\u0430\u0442\u044c \u043d\u0430 \u0438\u0437\u0443\u0447\u0435\u043d\u0438\u0438 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438,\n\u043f\u0440\u0438\u0434\u0435\u0442 \u0432\u0440\u0435\u043c\u044f \u0438 \u043c\u0430\u043b\u044b\u0448 \u0441\u0430\u043c \u0440\u0435\u0448\u0438\u0442 \u0432\u0441\u0435 \u0438\u0441\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u044c. \u041f\u043e\u0433\u043b\u0430\u0434\u044c\u0442\u0435 \u0449\u0435\u043d\u043a\u0430, \u043f\u043e\u0433\u043e\u0432\u043e\u0440\u0438\u0442\u0435 \u0441 \u043d\u0438\u043c,\n\u043f\u0440\u0435\u0434\u043b\u043e\u0436\u0438\u0442\u0435 \u0438\u0433\u0440\u0443\u0448\u043a\u0443.\n\u041a\u043e\u0433\u0434\u0430 \u043c\u0430\u043b\u044b\u0448 \u043d\u0435\u043c\u043d\u043e\u0433\u043e \u043e\u0441\u0432\u043e\u0438\u0442\u0441\u044f, \u0442\u043e \u043f\u043e\u043a\u0430\u0436\u0438\u0442\u0435 \u0435\u043c\u0443 \u043a\u043b\u044e\u0447\u0435\u0432\u044b\u0435 \u043c\u0435\u0441\u0442\u0430. \u041f\u043e\u043a\u043e\u0440\u043c\u0438\u0442\u0435 \u0449\u0435\u043d\u043a\u0430 \u0438\u0437 \u043c\u0438\u0441\u043e\u043a,\n\u0434\u0430\u0439\u0442\u0435 \u0432\u043e\u0434\u044b. \u041f\u043e\u0441\u043b\u0435 \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f \u043e\u0442\u043d\u0435\u0441\u0438\u0442\u0435 \u043d\u0430 \u043f\u0435\u043b\u0435\u043d\u043a\u0443, \u0432\u044b\u0441\u043e\u043a\u0430 \u0432\u0435\u0440\u043e\u044f\u0442\u043d\u043e\u0441\u0442\u044c, \u0447\u0442\u043e \u0441\u043e\u0431\u0430\u043a\u0430 \u0437\u0430\u0445\u043e\u0447\u0435\u0442\n\u0432 \u0442\u0443\u0430\u043b\u0435\u0442. \u0417\u0430\u0442\u0435\u043c \u043c\u043e\u0436\u043d\u043e \u043f\u043e\u0437\u043d\u0430\u043a\u043e\u043c\u0438\u0442\u044c \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0441 \u043b\u0435\u0436\u0430\u043d\u043a\u043e\u0439 \u0438 \u0438\u0433\u0440\u0443\u0448\u043a\u0430\u043c\u0438.\n\u041f\u043e\u0441\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044c \u0437\u0430\u0440\u0430\u043d\u0435\u0435 \u0440\u0435\u0448\u0438\u0442\u044c \u0431\u0443\u0434\u0435\u0442\u0435 \u043b\u0438 \u0432\u044b \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u0442\u044c \u0441\u043e\u0431\u0430\u043a\u0435 \u0437\u0430\u0431\u0438\u0440\u0430\u0442\u044c\u0441\u044f \u043d\u0430 \u043a\u0440\u043e\u0432\u0430\u0442\u044c,\n\u0434\u0438\u0432\u0430\u043d\u044b \u0438 \u043a\u0440\u0435\u0441\u043b\u0430. \u0415\u0441\u043b\u0438 \u0434\u0430, \u0442\u043e \u0441 \u043f\u0435\u0440\u0432\u043e\u0433\u043e \u0434\u043d\u044f \u043f\u043e\u0437\u043d\u0430\u043a\u043e\u043c\u044c\u0442\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0441 \u043c\u044f\u0433\u043a\u043e\u0439 \u043c\u0435\u0431\u0435\u043b\u044c\u044e, \u043d\u043e \u043d\u0435\n\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0439\u0442\u0435 \u0435\u0433\u043e \u043e\u0434\u043d\u043e\u0433\u043e, \u043c\u0430\u043b\u044b\u0448 \u043c\u043e\u0436\u0435\u0442 \u0443\u043f\u0430\u0441\u0442\u044c \u0438 \u0443\u0448\u0438\u0431\u0438\u0442\u044c\u0441\u044f. \u0415\u0441\u043b\u0438 \u0432\u0430\u0448 \u0449\u0435\u043d\u043e\u043a \u043c\u0438\u043d\u0438\u0430\u0442\u044e\u0440\u043d\u043e\u0439 \u043f\u043e\u0440\u043e\u0434\u044b,\n\u0447\u0442\u043e\u0431\u044b \u0432 \u0434\u0430\u043b\u044c\u043d\u0435\u0439\u0448\u0435\u043c \u0435\u043c\u0443 \u043b\u0435\u0433\u0447\u0435 \u0431\u044b\u043b\u043e \u0437\u0430\u0431\u0438\u0440\u0430\u0442\u044c\u0441\u044f \u043d\u0430 \u043a\u0440\u043e\u0432\u0430\u0442\u044c, \u043c\u043e\u0436\u043d\u043e \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0435\n\u0441\u0442\u0443\u043f\u0435\u043d\u044c\u043a\u0438 \u0438\u043b\u0438 \u043b\u0435\u0441\u0435\u043d\u043a\u0438.\n\u041e\u0431\u0440\u0430\u0442\u0438\u0442\u0435 \u0432\u043d\u0438\u043c\u0430\u043d\u0438\u0435 \u043d\u0430 \u0432\u0430\u0436\u043d\u044b\u0435 \u043c\u043e\u043c\u0435\u043d\u0442\u044b, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0443\u0431\u0435\u0440\u0435\u0433\u0443\u0442 \u0432\u0430\u0441 \u043e\u0442 \u043b\u0438\u0448\u043d\u0435\u0433\u043e \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0439\u0441\u0442\u0432\u0430:\n\u25cf     \u041f\u0435\u0440\u0432\u044b\u0435 \u043c\u0435\u0441\u044f\u0446\u044b \u0436\u0438\u0437\u043d\u0438 \u0449\u0435\u043d\u043a\u0438 \u043e\u0447\u0435\u043d\u044c \u043c\u043d\u043e\u0433\u043e \u0441\u043f\u044f\u0442 \u2014 \u044d\u0442\u043e \u043d\u043e\u0440\u043c\u0430\u043b\u044c\u043d\u043e. \u041d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0431\u0443\u0434\u0438\u0442\u044c \u0441\u043e\u0431\u0430\u043a\u0443\n\u0438 \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\u044c \u043b\u0438\u0448\u043d\u0438\u0439 \u0440\u0430\u0437, \u044d\u0442\u043e \u043c\u043e\u0436\u0435\u0442 \u043d\u0435\u0433\u0430\u0442\u0438\u0432\u043d\u043e \u0441\u043a\u0430\u0437\u0430\u0442\u044c\u0441\u044f \u043d\u0430 \u043f\u0441\u0438\u0445\u0438\u043a\u0435. \u0415\u0441\u043b\u0438 \u043c\u0430\u043b\u044b\u0448 \u043c\u043d\u043e\u0433\u043e \u0441\u043f\u0438\u0442,\n\u043d\u043e \u0432 \u043f\u0435\u0440\u0438\u043e\u0434 \u0431\u043e\u0434\u0440\u0441\u0442\u0432\u043e\u0432\u0430\u043d\u0438\u044f \u0430\u043a\u0442\u0438\u0432\u0435\u043d, \u0438\u0433\u0440\u0430\u0435\u0442, \u0445\u043e\u0440\u043e\u0448\u043e \u043a\u0443\u0448\u0430\u0435\u0442 \u0438 \u0445\u043e\u0434\u0438\u0442 \u0432 \u0442\u0443\u0430\u043b\u0435\u0442, \u0442\u043e \u043f\u043e\u0432\u043e\u0434\u043e\u0432\n\u0434\u043b\u044f \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0439\u0441\u0442\u0432\u0430 \u043d\u0435\u0442.\n\u25cf     \u041f\u0435\u0440\u0435\u0435\u0437\u0434 \u0432 \u043d\u043e\u0432\u044b\u0439 \u0434\u043e\u043c, \u0440\u0430\u0441\u0441\u0442\u0430\u0432\u0430\u043d\u0438\u0435 \u0441 \u043c\u0430\u0442\u0435\u0440\u044c\u044e, \u0431\u0440\u0430\u0442\u044c\u044f\u043c\u0438 \u0438 \u0441\u0435\u0441\u0442\u0440\u0430\u043c\u0438 - \u0441\u0442\u0440\u0435\u0441\u0441 \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u0430.\n\u0427\u0435\u043c \u043c\u043b\u0430\u0434\u0448\u0435 \u0441\u043e\u0431\u0430\u043a\u0430, \u0442\u0435\u043c \u0435\u0439 \u0442\u044f\u0436\u0435\u043b\u0435\u0435. \u041d\u0430\u0431\u0435\u0440\u0438\u0442\u0435\u0441\u044c \u0442\u0435\u0440\u043f\u0435\u043d\u0438\u044f, \u0431\u0443\u0434\u044c\u0442\u0435 \u0442\u0430\u043a\u0442\u0438\u0447\u043d\u044b. \u041d\u0435 \u043d\u0430\u0441\u0442\u0430\u0438\u0432\u0430\u0439\u0442\u0435 \u043d\u0430\n\u0438\u0433\u0440\u0430\u0445 \u0438 \u043e\u0431\u0449\u0435\u043d\u0438\u0438, \u0440\u0435\u0437\u043a\u043e \u043d\u0435 \u0445\u0432\u0430\u0442\u0430\u0439\u0442\u0435 \u0449\u0435\u043d\u043a\u0430, \u043d\u0435 \u043d\u043e\u0441\u0438\u0442\u0435 \u043d\u0430 \u0440\u0443\u043a\u0430\u0445. \u041c\u0430\u043b\u044b\u0448\u0443 \u043d\u0443\u0436\u043d\u043e \u0432\u0440\u0435\u043c\u044f \u0434\u043b\u044f\n\u0430\u0434\u0430\u043f\u0442\u0430\u0446\u0438\u0438, \u043e\u043d \u0441\u0430\u043c \u043f\u043e\u043a\u0430\u0436\u0435\u0442 \u0432\u0430\u043c, \u043a\u043e\u0433\u0434\u0430 \u0437\u0430\u0445\u043e\u0447\u0435\u0442 \u0432\u043d\u0438\u043c\u0430\u043d\u0438\u044f.\n\u25cf     \u041d\u0435 \u0440\u0443\u0433\u0430\u0439\u0442\u0435 \u0449\u0435\u043d\u043a\u0430 \u0438 \u043d\u0435 \u043d\u0430\u043a\u0430\u0437\u044b\u0432\u0430\u0439\u0442\u0435 \u0435\u0433\u043e. \u0421\u043e\u0431\u0430\u043a\u0430 \u043d\u0435 \u043f\u043e\u043d\u0438\u043c\u0430\u0435\u0442 \u043a\u0440\u0438\u043a\u043e\u0432, \u0444\u0438\u0437\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u043d\u0430\u0441\u0438\u043b\u0438\u0435\n\u043d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u043e. \u041e\u0431\u044a\u044f\u0441\u043d\u044f\u0439\u0442\u0435 \u0432\u0441\u0435 \u043a\u043e\u0440\u043e\u0442\u043a\u0438\u043c\u0438 \u043a\u043e\u043c\u0430\u043d\u0434\u0430\u043c\u0438: \u201c\u041d\u0435\u0442\u201d, \u201c\u041d\u0435\u043b\u044c\u0437\u044f\u201d, \u201c\u0424\u0443\u201d. \u0415\u0441\u043b\u0438 \u0449\u0435\u043d\u043e\u043a \u0433\u0440\u044b\u0437\u0435\u0442\n\u043e\u0431\u0443\u0432\u044c, \u0442\u043e \u0443\u0431\u0438\u0440\u0430\u0439\u0442\u0435 \u0435\u0435 \u0438 \u043f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0430\u0439\u0442\u0435 \u0432\u043d\u0438\u043c\u0430\u043d\u0438\u0435 \u043d\u0430 \u0438\u0433\u0440\u0443\u0448\u043a\u0438, \u0435\u0441\u043b\u0438 \u0437\u0430\u043c\u0435\u0442\u0438\u043b\u0438 \u043b\u0443\u0436\u0438\u0446\u0443 \u0432\n\u043d\u0435\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u043d\u043e\u043c \u043c\u0435\u0441\u0442\u0435, \u0442\u043e \u043f\u0440\u043e\u043c\u043e\u043a\u043d\u0438\u0442\u0435 \u0435\u0435 \u043f\u0435\u043b\u0435\u043d\u043a\u043e\u0439 \u0438 \u0434\u0430\u0439\u0442\u0435 \u043f\u043e\u043d\u044e\u0445\u0430\u0442\u044c \u043f\u0438\u0442\u043e\u043c\u0446\u0443. \u0421\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0435\u043c \u0441\u043e\u0431\u0430\u043a\u0430\n\u043d\u0430\u0443\u0447\u0438\u0442\u0441\u044f \u043f\u043e\u043d\u0438\u043c\u0430\u0442\u044c \u0432\u0430\u0441 \u0441 \u043f\u043e\u043b\u0443\u0441\u043b\u043e\u0432\u0430, \u043d\u043e \u0434\u043e \u044d\u0442\u043e\u0433\u043e \u043d\u0443\u0436\u043d\u043e \u0441\u043e\u0445\u0440\u0430\u043d\u044f\u0442\u044c \u0442\u0435\u0440\u043f\u0435\u043d\u0438\u0435 \u0438 \u0440\u0430\u0431\u043e\u0442\u0430\u0442\u044c \u043a\u0430\u043a \u043d\u0430\u0434\n\u0441\u043e\u0431\u043e\u0439, \u0442\u0430\u043a \u0438 \u043d\u0430\u0434 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c.\n\u25cf     \u0421\u043b\u0435\u0434\u0438\u0442\u0435 \u0437\u0430 \u043e\u0431\u0449\u0438\u043c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435\u043c. \u041f\u0440\u0438 \u0440\u0432\u043e\u0442\u0435, \u0436\u0438\u0434\u043a\u043e\u043c \u0441\u0442\u0443\u043b\u0435, \u0432\u044f\u043b\u043e\u0441\u0442\u0438, \u0441\u043d\u0438\u0436\u0435\u043d\u043d\u043e\u043c \u0430\u043f\u043f\u0435\u0442\u0438\u0442\u0435\n\u0441\u043b\u0435\u0434\u0443\u0435\u0442 \u043f\u0440\u043e\u043a\u043e\u043d\u0441\u0443\u043b\u044c\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0441 \u0432\u0435\u0442\u0435\u0440\u0438\u043d\u0430\u0440\u043d\u044b\u043c \u0432\u0440\u0430\u0447\u043e\u043c.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.CYNOLOGIST_INITIAL_ADVICE_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#CYNOLOGIST_INITIAL_ADVICE_COMMAND_LABEL">CYNOLOGIST_INITIAL_ADVICE_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udcc3  \u0421\u043e\u0432\u0435\u0442\u044b \u043a\u0438\u043d\u043e\u043b\u043e\u0433\u0430"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DATING_RULES_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DATING_RULES_COMMAND_LABEL">DATING_RULES_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udc36 \ud83d\udc31  \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u0437\u043d\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430 \u0441 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DOCUMENTS_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DOCUMENTS_COMMAND_LABEL">DOCUMENTS_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udcdc  \u0421\u043f\u0438\u0441\u043e\u043a \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0445 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u043e\u0432"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DOG_CAR_PASS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DOG_CAR_PASS">DOG_CAR_PASS</a></code></div>
<div class="col-last even-row-color"><code>"\u0414\u043b\u044f \u043f\u0440\u043e\u0435\u0437\u0434\u0430 \u043d\u0430 \u043b\u0438\u0447\u043d\u043e\u043c \u0430\u0432\u0442\u043e \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u044e \u043f\u0440\u0438\u044e\u0442\u0430,\n\u0412\u0430\u043c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043f\u043e\u0437\u0432\u043e\u043d\u0438\u0442\u044c \u043d\u0430 \u043f\u043e\u0441\u0442 \u043e\u0445\u0440\u0430\u043d\u044b \u043f\u043e \u043d\u043e\u043c\u0435\u0440\u0443\n8-999-111-22-33 \u043d\u0435 \u043c\u0435\u043d\u0435\u0435, \u0447\u0435\u043c \u0437\u0430 3 \u0447\u0430\u0441\u0430 \u0434\u043e \u043f\u0440\u0438\u0431\u044b\u0442\u0438\u044f \u0432 \u043f\u0440\u0438\u044e\u0442,\n\u0438 \u0441\u043e\u043e\u0431\u0449\u0438\u0442\u044c \u043d\u043e\u043c\u0435\u0440 \u0430\u0432\u0442\u043e \u0438 \u0424\u0418\u041e \u0432\u043e\u0434\u0438\u0442\u0435\u043b\u044f.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DOG_DATING_RULES">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DOG_DATING_RULES">DOG_DATING_RULES</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u0440\u043e\u0446\u0435\u0441\u0441 \u0437\u043d\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430 \u0438 \u043e\u0431\u0449\u0435\u043d\u0438\u044f \u0441 \u0431\u0443\u0434\u0443\u0449\u0438\u043c \u043f\u043e\u0434\u043e\u043f\u0435\u0447\u043d\u044b\u043c\n\u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043d\u0430\u0447\u0438\u043d\u0430\u0442\u044c \u0437\u0430\u0440\u0430\u043d\u0435\u0435. \u041f\u043e\u0441\u043b\u0435 \u0442\u043e\u0433\u043e, \u043a\u0430\u043a \u0432\u044b\n\u0441\u0434\u0435\u043b\u0430\u043b\u0438 \u0432\u044b\u0431\u043e\u0440, \u043d\u0430\u0447\u043d\u0438\u0442\u0435 \u043d\u0430\u0432\u0435\u0449\u0430\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0432 \u043f\u0440\u0438\u044e\u0442\u0435,\n\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u0441 \u043d\u0438\u043c \u0434\u043e\u0432\u0435\u0440\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0435 \u043e\u0442\u043d\u043e\u0448\u0435\u043d\u0438\u044f: \u043f\u0440\u0438\u043d\u043e\u0441\u0438\u0442\u044c\n\u0441\u043e\u0431\u0430\u043a\u0435 \u043b\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430, \u043d\u0430\u0447\u0430\u0442\u044c \u0432\u044b\u0432\u043e\u0434\u0438\u0442\u044c \u0435\u0451 \u043d\u0430 \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u0438,\n\u0430\u043a\u043a\u0443\u0440\u0430\u0442\u043d\u043e \u0433\u043b\u0430\u0434\u0438\u0442\u044c. \u042d\u0442\u043e \u0434\u043e\u043b\u0436\u043d\u043e \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442\u044c \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u043e\n\u0438 \u043d\u0435\u043d\u0430\u0432\u044f\u0437\u0447\u0438\u0432\u043e, \u0431\u0435\u0437 \u043a\u0430\u043a\u043e\u0433\u043e-\u043b\u0438\u0431\u043e \u0434\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0441 \u0432\u0430\u0448\u0435\u0439\n\u0441\u0442\u043e\u0440\u043e\u043d\u044b. \u041a\u043e\u0433\u0434\u0430 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043d\u0430\u0447\u043d\u0451\u0442 \u0432\u0430\u0441 \u0443\u0437\u043d\u0430\u0432\u0430\u0442\u044c, \u0432\u0438\u043b\u044f\u0442\u044c\n\u0445\u0432\u043e\u0441\u0442\u043e\u043c \u043f\u0440\u0438 \u0432\u0441\u0442\u0440\u0435\u0447\u0435 \u0438 \u043f\u043e\u0437\u0432\u043e\u043b\u0438\u0442 \u0441 \u043d\u0438\u043c \u0438\u0433\u0440\u0430\u0442\u044c, \u043c\u043e\u0436\u043d\u043e\n\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u043f\u0430\u0440\u0443 \u0433\u043e\u0441\u0442\u0435\u0432\u044b\u0445 \u043f\u043e\u0441\u0435\u0449\u0435\u043d\u0438\u0439, \u043f\u0440\u0438\u0432\u0435\u0434\u044f \u0441\u043e\u0431\u0430\u043a\u0443\n\u0432 \u0434\u043e\u043c. \u042d\u0442\u043e \u043f\u043e\u043c\u043e\u0436\u0435\u0442 \u0441\u043e\u0431\u0430\u043a\u0435 \u0432 \u0434\u0430\u043b\u044c\u043d\u0435\u0439\u0448\u0435\u043c \u0431\u043e\u043b\u0435\u0435 \u043b\u0435\u0433\u043a\u043e\u043c\u0443\n\u0437\u043d\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0443 \u0441 \u043d\u0435\u0437\u043d\u0430\u043a\u043e\u043c\u043e\u0439 \u043e\u0431\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u043e\u0439 \u0438 \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u043d\u0438\u044e\n\u043a \u043d\u043e\u0432\u043e\u043c\u0443 \u0434\u043e\u043c\u0443\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DOG_DOCUMENTS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DOG_DOCUMENTS">DOG_DOCUMENTS</a></code></div>
<div class="col-last even-row-color"><code>"\u0427\u0442\u043e\u0431\u044b \u0432\u0437\u044f\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430, \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435\n\u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u044b:\n\n- \u0414\u043e\u0433\u043e\u0432\u043e\u0440 \u043e \u0440\u0435\u0437\u0435\u0440\u0432\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0438 \u0449\u0435\u043d\u043a\u0430.\n\u0415\u0433\u043e \u043c\u043e\u0436\u043d\u043e \u0437\u0430\u043a\u043b\u044e\u0447\u0438\u0442\u044c \u0441\u0440\u0430\u0437\u0443, \u043d\u0435 \u0434\u043e\u0436\u0438\u0434\u0430\u044f\u0441\u044c \u043e\u0444\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f\n\u0449\u0435\u043d\u044f\u0447\u044c\u0435\u0439 \u043a\u0430\u0440\u0442\u043e\u0447\u043a\u0438. \u0412 \u0434\u043e\u0433\u043e\u0432\u043e\u0440\u0435 \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c \u0443\u043a\u0430\u0437\u0430\u043d\u044b:\n\u043a\u043b\u0430\u0441\u0441 \u0449\u0435\u043d\u043a\u0430, \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442, \u043a\u043e\u0433\u0434\u0430 \u0438 \u043a\u0430\u043a \u0431\u0443\u0434\u0435\u0442\n\u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0442\u044c\u0441\u044f \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0430.\n\n- \u0414\u043e\u0433\u043e\u0432\u043e\u0440 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e.\n\u0414\u043e\u0433\u043e\u0432\u043e\u0440 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0441\u043e\u0441\u0442\u0430\u0432\u043b\u044f\u0435\u0442\u0441\u044f, \u0435\u0441\u043b\u0438 \u0432\u044b\n\u0431\u0435\u0440\u0435\u0442\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430: \u043e\u043d \u043f\u043e\u0437\u0432\u043e\u043b\u0438\u0442 \u043a\u0443\u0440\u0430\u0442\u043e\u0440\u0430\u043c\n\u0438\u043b\u0438 \u0442\u043e\u043c\u0443, \u043a\u0442\u043e \u043d\u0430\u0448\u0435\u043b \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e, \u0431\u044b\u0442\u044c \u0443\u0432\u0435\u0440\u0435\u043d\u043d\u044b\u043c \u0432 \u0442\u043e\u043c,\n\u0447\u0442\u043e \u0432\u044b \u0431\u0443\u0434\u0435\u0442\u0435 \u0445\u043e\u0440\u043e\u0448\u043e \u043e \u043d\u0435\u043c \u0437\u0430\u0431\u043e\u0442\u0438\u0442\u044c\u0441\u044f \u0438 \u043d\u0435 \u0441\u043a\u0440\u043e\u0435\u0442\u0435\u0441\u044c\n\u0432 \u043d\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043d\u043e\u043c \u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u0438. \u0412 \u0442\u0430\u043a\u043e\u043c \u0434\u043e\u0433\u043e\u0432\u043e\u0440\u0435 \u0434\u043e\u043b\u0436\u043d\u044b\n\u0437\u043d\u0430\u0447\u0438\u0442\u044c\u0441\u044f \u0432\u0430\u0448\u0438 \u043f\u0430\u0441\u043f\u043e\u0440\u0442\u043d\u044b\u0435 \u0434\u0430\u043d\u043d\u044b\u0435, \u0438 \u043a \u043d\u0435\u043c\u0443 \u0434\u043e\u043b\u0436\u043d\u0430\n\u0431\u044b\u0442\u044c \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0430 \u043a\u043e\u043f\u0438\u044f \u043f\u0430\u0441\u043f\u043e\u0440\u0442\u0430.\n\n- \u0429\u0435\u043d\u044f\u0447\u044c\u044f \u043a\u0430\u0440\u0442\u0430 (\u0435\u0441\u043b\u0438 \u043f\u0440\u0438\u043c\u0435\u043d\u0438\u043c\u043e).\n\"\u0429\u0435\u043d\u044f\u0447\u044c\u044f \u043a\u0430\u0440\u0442\u0430 \u2014 \u0441\u0430\u043c\u044b\u0439 \u043f\u0435\u0440\u0432\u044b\u0439 \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u044e\u043d\u043e\u0433\u043e \u043f\u0441\u0430,\n\u0435\u0433\u043e \u0432\u044b \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u0435 \u0432\u043c\u0435\u0441\u0442\u0435 \u0441 \u0441\u043e\u0431\u0430\u043a\u043e\u0439. \u0412 \u043d\u0435\u0439 \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u0435\u0442\u0441\u044f:\n\u043f\u043e\u0440\u043e\u0434\u0430, \u043f\u043e\u043b\u043d\u0430\u044f \u043a\u043b\u0438\u0447\u043a\u0430 \u0449\u0435\u043d\u043a\u0430, \u043f\u043e\u043b, \u043e\u043a\u0440\u0430\u0441, \u043f\u043e\u043b\u043d\u0430\u044f \u0434\u0430\u0442\u0430\n\u0440\u043e\u0436\u0434\u0435\u043d\u0438\u044f, \u043a\u043e\u0434 \u0438 \u043d\u043e\u043c\u0435\u0440 \u043a\u043b\u0435\u0439\u043c\u0430, \u0444\u0430\u043c\u0438\u043b\u0438\u044f \u0438 \u0430\u0434\u0440\u0435\u0441\n\u0437\u0430\u0432\u043e\u0434\u0447\u0438\u043a\u0430 \u0438 \u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u0430 \u0449\u0435\u043d\u043a\u0430, \u0441\u0432\u0435\u0434\u0435\u043d\u0438\u044f \u043e \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0436\u0434\u0435\u043d\u0438\u0438\n(\u043e\u0442\u0435\u0446, \u043c\u0430\u0442\u044c, \u043d\u043e\u043c\u0435\u0440\u0430 \u0438\u0445 \u0440\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u044b\u0445, \u043e\u043a\u0440\u0430\u0441\u044b). \u041a\u043e\u0433\u0434\u0430\n\u0449\u0435\u043d\u043a\u0443 \u0438\u0441\u043f\u043e\u043b\u043d\u044f\u0435\u0442\u0441\u044f \u043f\u043e\u043b\u0442\u043e\u0440\u0430 \u0433\u043e\u0434\u0430, \u043e\u043d \u043f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0432\u0437\u0430\u043c\u0435\u043d\n\u043a\u0430\u0440\u0442\u044b \u0440\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u0443\u044e, \u043d\u043e \u0447\u0430\u0441\u0442\u044c \u00ab\u0449\u0435\u043d\u044f\u0447\u043a\u0438\u00bb (\u043e\u043d\u0430 \u0434\u0435\u043b\u0438\u0442\u0441\u044f \u043d\u0430\n\u0434\u0432\u0435 \u0447\u0430\u0441\u0442\u0438) \u043e\u0441\u0442\u0430\u0435\u0442\u0441\u044f \u0443 \u0432\u0430\u0441.\n\n- \u0420\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u0430\u044f \u0441\u043e\u0431\u0430\u043a\u0438 (\u0435\u0441\u043b\u0438 \u043f\u0440\u0438\u043c\u0435\u043d\u0438\u043c\u043e).\n\u041a\u043e\u0433\u0434\u0430 \u0449\u0435\u043d\u043a\u0443 \u0438\u0441\u043f\u043e\u043b\u043d\u044f\u0435\u0442\u0441\u044f \u043f\u043e\u043b\u0442\u043e\u0440\u0430 \u0433\u043e\u0434\u0430, \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u0438\u0438\n\u0449\u0435\u043d\u044f\u0447\u044c\u0435\u0439 \u043a\u0430\u0440\u0442\u043e\u0447\u043a\u0438 \u0445\u043e\u0437\u044f\u0438\u043d \u043c\u043e\u0436\u0435\u0442 \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0441\u0432\u0438\u0434\u0435\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u043e\n\u043e \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0436\u0434\u0435\u043d\u0438\u0438, \u0442\u043e \u0435\u0441\u0442\u044c \u0440\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u0443\u044e. \u0420\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u0430\u044f \u043c\u043e\u0436\u0435\u0442\n\u0431\u044b\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0434\u0438\u043d\u043e\u0433\u043e \u043e\u0431\u0440\u0430\u0437\u0446\u0430 \u0420\u041a\u0424. \u0412 \u043d\u0435\u0439 \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c\n\u0443\u043a\u0430\u0437\u0430\u043d\u044b: \u043f\u043e\u043b\u043d\u0430\u044f \u043a\u043b\u0438\u0447\u043a\u0430 \u0441\u043e\u0431\u0430\u043a\u0438, \u043f\u043e\u043b, \u0434\u0430\u0442\u0430 \u0440\u043e\u0436\u0434\u0435\u043d\u0438\u044f,\n\u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043a\u043b\u0443\u0431\u0430 \u0438 \u043d\u043e\u043c\u0435\u0440 \u0437\u0430\u043f\u0438\u0441\u0438 \u0432 \u043f\u043b\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \u043a\u043d\u0438\u0433\u0435,\n\u0441\u0432\u0435\u0434\u0435\u043d\u0438\u044f \u043e \u043f\u0440\u0435\u0434\u043a\u0430\u0445 \u0441\u043e\u0431\u0430\u043a\u0438 \u0434\u043e \u0447\u0435\u0442\u0432\u0435\u0440\u0442\u043e\u0433\u043e \u043a\u043e\u043b\u0435\u043d\u0430, \u0441\u0432\u0435\u0434\u0435\u043d\u0438\u044f\n\u043e\u0431 \u0443\u0441\u043f\u0435\u0445\u0430\u0445 \u043f\u0440\u0435\u0434\u043a\u043e\u0432 \u043d\u0430 \u0432\u044b\u0441\u0442\u0430\u0432\u043a\u0430\u0445, \u044d\u043c\u0431\u043b\u0435\u043c\u044b FCI \u0438 \u0420\u041a\u0424.\n\u0420\u043e\u0434\u043e\u0441\u043b\u043e\u0432\u043d\u0430\u044f \u2014 \u0433\u0430\u0440\u0430\u043d\u0442\u0438\u044f \u0447\u0438\u0441\u0442\u043e\u043f\u043e\u0440\u043e\u0434\u043d\u043e\u0441\u0442\u0438 \u0441\u043e\u0431\u0430\u043a\u0438 \u0438 \u0432\u044b\u0434\u0430\u0435\u0442\u0441\u044f\n\u043d\u0430 \u043e\u0434\u043d\u043e\u043c \u0438\u0437 \u044f\u0437\u044b\u043a\u043e\u0432 \u043d\u0430 \u0432\u044b\u0431\u043e\u0440: \u0440\u0443\u0441\u0441\u043a\u043e\u043c \u0438\u043b\u0438 \u0430\u043d\u0433\u043b\u0438\u0439\u0441\u043a\u043e\u043c.\n\n- \u0412\u0435\u0442\u0435\u0440\u0438\u043d\u0430\u0440\u043d\u044b\u0439 \u043f\u0430\u0441\u043f\u043e\u0440\u0442.\n\u0412\u0435\u0442\u0435\u0440\u0438\u043d\u0430\u0440\u043d\u044b\u0439 \u043f\u0430\u0441\u043f\u043e\u0440\u0442 \u043d\u0443\u0436\u0435\u043d \u043a\u0430\u0436\u0434\u043e\u043c\u0443 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u043c\u0443, \u0447\u0442\u043e\u0431\u044b\n\u0443\u0447\u0430\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0432 \u0432\u044b\u0441\u0442\u0430\u0432\u043a\u0430\u0445, \u043f\u043e\u043b\u0443\u0447\u0430\u0442\u044c \u0441\u043f\u0440\u0430\u0432\u043a\u0438 \u0434\u043b\u044f \u043f\u043e\u0435\u0437\u0434\u043e\u043a \u0437\u0430\n\u0440\u0443\u0431\u0435\u0436 \u0438, \u043a\u043e\u043d\u0435\u0447\u043d\u043e, \u0447\u0442\u043e\u0431\u044b \u0432\u043d\u0438\u043c\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u0441\u043b\u0435\u0434\u0438\u0442\u044c \u0437\u0430 \u0437\u0434\u043e\u0440\u043e\u0432\u044c\u0435\u043c\n\u043f\u0438\u0442\u043e\u043c\u0446\u0430. \u0412 \u043f\u0430\u0441\u043f\u043e\u0440\u0442\u0435 \u0434\u043e\u043b\u0436\u043d\u044b \u0441\u0442\u043e\u044f\u0442\u044c \u043e\u0442\u043c\u0435\u0442\u043a\u0438 \u043e \u0434\u0435\u0433\u0435\u043b\u044c\u043c\u0438\u043d\u0442\u0438\u0437\u0430\u0446\u0438\u0438,\n\u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0435 \u043e\u0442 \u044d\u043a\u0442\u043e\u043f\u0430\u0440\u0430\u0437\u0438\u0442\u043e\u0432, \u043f\u0440\u0438\u0432\u0438\u0432\u043a\u0430\u0445 (\u0434\u0430\u0442\u0430, \u043f\u043e\u0434\u043f\u0438\u0441\u044c \u0432\u0440\u0430\u0447\u0430,\n\u043f\u0435\u0447\u0430\u0442\u044c, \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e \u0432\u0430\u043a\u0446\u0438\u043d\u0435 \u0438\u043b\u0438 \u043f\u0440\u0435\u043f\u0430\u0440\u0430\u0442\u0435) \u0438 \u043d\u0430\u043a\u043b\u0435\u0439\u043a\u0438 \u043e\u0442\n\u044d\u0442\u0438\u0445 \u0432\u0430\u043a\u0446\u0438\u043d. \u0412 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043f\u0430\u0441\u043f\u043e\u0440\u0442\u0430 \u043c\u043e\u0436\u043d\u043e \u0432\u043a\u043b\u0435\u0438\u0442\u044c \u0444\u043e\u0442\u043e\u0433\u0440\u0430\u0444\u0438\u044e\n\u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.DOG_SHIPPING">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#DOG_SHIPPING">DOG_SHIPPING</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u043e\u0437\u0432\u043e\u043b\u044c\u0442\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u043c\u0443 \u043f\u043e\u0437\u043d\u0430\u043a\u043e\u043c\u0438\u0442\u044c\u0441\u044f \u0441 \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440\u043e\u043c \u0434\u043b\u044f \u043f\u0435\u0440\u0435\u0432\u043e\u0437\u043a\u0438\n\u0438 \u0430\u0432\u0442\u043e\u043c\u043e\u0431\u0438\u043b\u0435\u043c, \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u043f\u0440\u043e\u0439\u0434\u0451\u0442 \u0434\u043e\u0440\u043e\u0433\u0430 \u0434\u043e\u043c\u043e\u0439. \u0417\u0430\u0440\u0430\u043d\u0435\u0435\n\u043f\u0440\u0438\u0443\u0447\u0438\u0442\u0435 \u0441\u043e\u0431\u0430\u043a\u0443 \u043a \u043d\u0430\u043c\u043e\u0440\u0434\u043d\u0438\u043a\u0443 - \u0434\u043b\u044f \u044d\u0442\u043e\u0433\u043e, \u043f\u043e\u0441\u0435\u0449\u0430\u044f \u043f\u0440\u0438\u044e\u0442,\n\u0432\u043a\u043b\u0430\u0434\u044b\u0432\u0430\u0439\u0442\u0435 \u043b\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430 \u0432 \u044d\u0442\u043e\u0442 \u0430\u043a\u0441\u0435\u0441\u0441\u0443\u0430\u0440, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0439\u0442\u0435 \u0435\u0433\u043e \u043a\u0430\u043a\n\u043c\u0438\u0441\u043a\u0443. \u0427\u0435\u0440\u0435\u0437 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0432\u0440\u0435\u043c\u044f \u043c\u043e\u0436\u043d\u043e \u043d\u0430\u0447\u0430\u0442\u044c \u043d\u0430\u0434\u0435\u0432\u0430\u0442\u044c \u043d\u0430\u043c\u043e\u0440\u0434\u043d\u0438\u043a\n\u043d\u0430 \u0441\u043e\u0431\u0430\u043a\u0443 \u043f\u0435\u0440\u0435\u0434 \u043d\u0430\u0447\u0430\u043b\u043e\u043c \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u0438, \u0438 \u0441\u043d\u0438\u043c\u0430\u0442\u044c \u0447\u0435\u0440\u0435\u0437 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u0435\n\u0432\u0440\u0435\u043c\u044f. \u041f\u043e\u0441\u043b\u0435 \u043f\u0435\u0440\u0435\u0435\u0437\u0434\u0430 \u0432 \u043d\u043e\u0432\u044b\u0439 \u0434\u043e\u043c \u043d\u0430\u0447\u0438\u043d\u0430\u0435\u0442\u0441\u044f \u0441\u0430\u043c\u044b\u0439 \u0433\u043b\u0430\u0432\u043d\u044b\u0439 \u0438\n\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u044d\u0442\u0430\u043f \u0430\u0434\u0430\u043f\u0442\u0430\u0446\u0438\u0438 \u0441\u043e\u0431\u0430\u043a\u0438 \u0432 \u0441\u0435\u043c\u044c\u0435. \u042d\u0442\u043e\u0442 \u043f\u0435\u0440\u0438\u043e\u0434 \u0432\n\u0441\u0440\u0435\u0434\u043d\u0435\u043c \u0437\u0430\u043d\u0438\u043c\u0430\u0435\u0442 \u043c\u0435\u0441\u044f\u0446, \u0432 \u0438\u0434\u0435\u0430\u043b\u0435 - \u0434\u0432\u0430 \u0438\u043b\u0438 \u0442\u0440\u0438 \u043c\u0435\u0441\u044f\u0446\u0430. \u0418\u043c\u0435\u043d\u043d\u043e\n\u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u043e\u0447\u0435\u043d\u044c \u0432\u0430\u0436\u043d\u043e \u0440\u0430\u0441\u0441\u0447\u0438\u0442\u0430\u0442\u044c \u043e\u043f\u0442\u0438\u043c\u0430\u043b\u044c\u043d\u043e\u0435 \u0432\u0440\u0435\u043c\u044f \u0434\u043b\u044f \u0432\u0437\u044f\u0442\u0438\u044f\n\u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430: \u0432 \u0431\u043b\u0438\u0436\u0430\u0439\u0448\u0438\u0435 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043d\u0435\u0434\u0435\u043b\u044c \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u044b \u0431\u044b\u0442\u044c\n\u0437\u0430\u043f\u043b\u0430\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u044b \u043f\u0435\u0440\u0435\u0435\u0437\u0434\u044b, \u0441\u0435\u043c\u0435\u0439\u043d\u044b\u0435 \u043f\u0443\u0442\u0435\u0448\u0435\u0441\u0442\u0432\u0438\u044f \u0438\u043b\u0438 \u043f\u043e\u044f\u0432\u043b\u0435\u043d\u0438\u0435 \u0434\u0435\u0442\u0435\u0439.\n\u0412\u0430\u043c \u0431\u0443\u0434\u0435\u0442 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u043c\u043d\u043e\u0433\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0438 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u044c\u0441\u044f \u0440\u044f\u0434\u043e\u043c \u0441\n\u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c, \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u0441\u043e\u0446\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0438 \u0438 \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u043d\u0438\u044f, \u0430\n\u0442\u0430\u043a\u0436\u0435 \u043f\u043e\u043c\u043e\u0433\u0430\u0442\u044c \u0441\u043e\u0431\u0430\u043a\u0435 \u043a\u0430\u043a \u043c\u043e\u0436\u043d\u043e \u0431\u044b\u0441\u0442\u0440\u0435\u0435 \u0430\u0434\u0430\u043f\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0432 \u043d\u043e\u0432\u043e\u043c \u0434\u043e\u043c\u0435.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.REASONS_FOR_REFUSAL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#REASONS_FOR_REFUSAL">REASONS_FOR_REFUSAL</a></code></div>
<div class="col-last even-row-color"><code>"\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043f\u044f\u0442\u044c \u043f\u0440\u0438\u0447\u0438\u043d, \u043f\u043e \u043a\u043e\u0442\u043e\u0440\u044b\u043c \u0447\u0430\u0449\u0435 \u0432\u0441\u0435\u0433\u043e \u043e\u0442\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0442 \u0436\u0435\u043b\u0430\u044e\u0449\u0438\u043c\n\u00ab\u0443\u0441\u044b\u043d\u043e\u0432\u0438\u0442\u044c\u00bb \u0434\u043e\u043c\u0430\u0448\u043d\u0435\u0433\u043e \u043b\u044e\u0431\u0438\u043c\u0446\u0430:\n\n1. \u0411\u043e\u043b\u044c\u0448\u043e\u0435 \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0434\u043e\u043c\u0430\n\u0412 \u043a\u043e\u043d\u0446\u0435 2018 \u0433\u043e\u0434\u0430 \u0432 \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438 \u0431\u044b\u043b \u043f\u0440\u0438\u043d\u044f\u0442 \u0437\u0430\u043a\u043e\u043d \u00ab\u041e\u0431\n\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u043e\u0431\u0440\u0430\u0449\u0435\u043d\u0438\u0438 \u0441 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c\u0438\u00bb. \u0412 \u043d\u0435\u043c \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u0438\u0435\n\u043d\u0430 \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432, \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0449\u0438\u0445\u0441\u044f \u0432 \u043e\u0434\u043d\u043e\u043c \u0434\u043e\u043c\u043e\u0432\u043b\u0430\u0434\u0435\u043d\u0438\u0438. \u041f\u0440\u0438 \u044d\u0442\u043e\u043c\n\u0442\u043e\u0447\u043d\u043e\u0435 \u0447\u0438\u0441\u043b\u043e \u043d\u0435 \u043d\u0430\u0437\u0432\u0430\u043d\u043e \u2014 \u0432 \u043a\u0430\u0436\u0434\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0432\u043e\u043f\u0440\u043e\u0441 \u0440\u0435\u0448\u0430\u0435\u0442\u0441\u044f \u0438\u043d\u0434\u0438\u0432\u0438\u0434\u0443\u0430\u043b\u044c\u043d\u043e,\n\u0438\u0441\u0445\u043e\u0434\u044f \u0438\u0437 \u043c\u0430\u0442\u0435\u0440\u0438\u0430\u043b\u044c\u043d\u044b\u0445 \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u0435\u0439 \u0438 \u0436\u0438\u043b\u0438\u0449\u043d\u044b\u0445 \u0443\u0441\u043b\u043e\u0432\u0438\u0439 \u0447\u0435\u043b\u043e\u0432\u0435\u043a\u0430.\n\u0412\u0430\u0436\u043d\u043e, \u0447\u0442\u043e\u0431\u044b \u0445\u043e\u0437\u044f\u0438\u043d \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0438\u0432\u0430\u043b \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u043e\u0435 \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u0435 \u0438 \u0441\u0432\u043e\u0435\u0432\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0435\n\u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0441\u043a\u043e\u0435 \u043e\u0431\u0441\u043b\u0443\u0436\u0438\u0432\u0430\u043d\u0438\u0435 \u0432\u0441\u0435\u043c \u0441\u0432\u043e\u0438\u043c \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c. \u0422\u0430\u043a\u0436\u0435, \u0441\u043e\u0433\u043b\u0430\u0441\u043d\u043e\n\u0441\u0430\u043d\u0438\u0442\u0430\u0440\u043d\u043e-\u044d\u043f\u0438\u0434\u0435\u043c\u0438\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u043c \u043f\u0440\u0430\u0432\u0438\u043b\u0430\u043c, \u0437\u0430\u043f\u0440\u0435\u0449\u0435\u043d\u043e \u0441\u043a\u043e\u043f\u043b\u0435\u043d\u0438\u0435 \u0431\u043e\u043b\u044c\u0448\u043e\u0433\u043e \u0447\u0438\u0441\u043b\u0430\n\u043f\u0442\u0438\u0446 \u0438 \u043c\u043b\u0435\u043a\u043e\u043f\u0438\u0442\u0430\u044e\u0449\u0438\u0445 \u043d\u0430 \u043d\u0435\u0431\u043e\u043b\u044c\u0448\u043e\u0439 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u2014 \u044d\u0442\u043e \u043f\u043e\u0432\u044b\u0448\u0430\u0435\u0442 \u0440\u0438\u0441\u043a\n\u0432\u043e\u0437\u043d\u0438\u043a\u043d\u043e\u0432\u0435\u043d\u0438\u044f \u0438\u043d\u0444\u0435\u043a\u0446\u0438\u043e\u043d\u043d\u044b\u0445 \u0431\u043e\u043b\u0435\u0437\u043d\u0435\u0439.\n\n2. \u041d\u0435\u0441\u0442\u0430\u0431\u0438\u043b\u044c\u043d\u044b\u0435 \u043e\u0442\u043d\u043e\u0448\u0435\u043d\u0438\u044f \u0432 \u0441\u0435\u043c\u044c\u0435\n\u041b\u044e\u0431\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u044b \u2014 \u044d\u0442\u043e \u0441\u0442\u0440\u0435\u0441\u0441 \u0434\u043b\u044f \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e. \u041a\u043e\u0448\u043a\u0438 \u0438 \u0441\u043e\u0431\u0430\u043a\u0438 \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u044e\u0442 \u043a \u043b\u044e\u0434\u044f\u043c,\n\u0441\u043a\u0443\u0447\u0430\u044e\u0442 \u043f\u043e\u0441\u043b\u0435 \u0432\u044b\u043d\u0443\u0436\u0434\u0435\u043d\u043d\u043e\u0439 \u0440\u0430\u0437\u043b\u0443\u043a\u0438 \u0441 \u0445\u043e\u0437\u044f\u0435\u0432\u0430\u043c\u0438 \u0438 \u0434\u0430\u0436\u0435 \u043e\u0442\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0442\u0441\u044f \u043e\u0442 \u0435\u0434\u044b.\n\u0415\u0441\u043b\u0438 \u0441\u0435\u043c\u0435\u0439\u043d\u0430\u044f \u043f\u0430\u0440\u0430 \u043f\u043b\u0430\u043d\u0438\u0440\u0443\u0435\u0442 \u0440\u0430\u0437\u0432\u043e\u0434, \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0431\u0440\u0430\u0442\u044c \u043f\u0438\u0442\u043e\u043c\u0446\u0430, \u0447\u0442\u043e\u0431\u044b \u043f\u043e\u0442\u043e\u043c\n\u043d\u0435 \u043e\u0431\u0440\u0435\u043a\u0430\u0442\u044c \u0435\u0433\u043e \u043d\u0430 \u0441\u0442\u0440\u0430\u0434\u0430\u043d\u0438\u044f.\n\n3. \u041d\u0430\u043b\u0438\u0447\u0438\u0435 \u043c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0445 \u0434\u0435\u0442\u0435\u0439\n\u0421\u0435\u043c\u044c\u044f\u043c, \u0433\u0434\u0435 \u0435\u0441\u0442\u044c \u0434\u0435\u0442\u0438 \u0434\u043e 5 \u043b\u0435\u0442, \u0441\u043b\u043e\u0436\u043d\u043e \u0432\u0437\u044f\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430 \u0441\u0440\u0430\u0437\u0443 \u043f\u043e \u0434\u0432\u0443\u043c\n\u043f\u0440\u0438\u0447\u0438\u043d\u0430\u043c. \u0412\u043e-\u043f\u0435\u0440\u0432\u044b\u0445, \u0435\u0441\u0442\u044c \u0440\u0438\u0441\u043a, \u0447\u0442\u043e \u0441\u043e\u0431\u0430\u043a\u0430 \u0438\u043b\u0438 \u043a\u043e\u0448\u043a\u0430 \u0431\u0443\u0434\u0435\u0442 \u043f\u0440\u043e\u044f\u0432\u043b\u044f\u0442\u044c \u0430\u0433\u0440\u0435\u0441\u0441\u0438\u044e\n\u043f\u043e \u043e\u0442\u043d\u043e\u0448\u0435\u043d\u0438\u044e \u043a \u043c\u0430\u043b\u0435\u043d\u044c\u043a\u043e\u043c\u0443 \u0447\u0435\u043b\u043e\u0432\u0435\u043a\u0443. \u0412\u043e-\u0432\u0442\u043e\u0440\u044b\u0445, \u0434\u0435\u0442\u0438 \u0441\u0430\u043c\u0438 \u0447\u0430\u0441\u0442\u043e \u043f\u0440\u043e\u0432\u043e\u0446\u0438\u0440\u0443\u044e\u0442\n\u043a\u043e\u043d\u0444\u043b\u0438\u043a\u0442, \u0434\u0435\u0440\u0433\u0430\u044f \u0437\u0432\u0435\u0440\u044c\u043a\u0430 \u0437\u0430 \u0445\u0432\u043e\u0441\u0442 \u0438 \u0443\u0448\u0438 \u0438\u043b\u0438 \u0431\u0440\u043e\u0441\u0430\u044f \u0432 \u043d\u0435\u0433\u043e \u0442\u044f\u0436\u0435\u043b\u044b\u0435 \u043f\u0440\u0435\u0434\u043c\u0435\u0442\u044b.\n\u041f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u044d\u0442\u043e \u043f\u043e \u043d\u0435\u0434\u043e\u0441\u043c\u043e\u0442\u0440\u0443 \u0438 \u0441 \u043c\u043e\u043b\u0447\u0430\u043b\u0438\u0432\u043e\u0433\u043e \u043f\u043e\u043f\u0443\u0441\u0442\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u0430 \u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445 \u043b\u044e\u0434\u0435\u0439,\n\u043d\u043e \u0432 \u0438\u0442\u043e\u0433\u0435 \u0432\u0438\u043d\u043e\u0432\u0430\u0442\u044b\u043c \u043e\u043a\u0430\u0437\u044b\u0432\u0430\u0435\u0442\u0441\u044f \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435. \u0415\u0441\u043b\u0438 \u0440\u0435\u0431\u0435\u043d\u043e\u043a \u043f\u043e\u043b\u0443\u0447\u0438\u0442 \u0446\u0430\u0440\u0430\u043f\u0438\u043d\u044b \u0438\u043b\u0438\n\u0443\u043a\u0443\u0441\u044b, \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0438, \u0432\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u0438\u0441\u043a\u0430\u0442\u044c \u043a\u043e\u043d\u0442\u0430\u043a\u0442 \u0441 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c \u0438 \u0432\u043e\u0441\u043f\u0438\u0442\u044b\u0432\u0430\u0442\u044c\n\u0441\u0432\u043e\u0435\u0433\u043e \u043e\u0442\u043f\u0440\u044b\u0441\u043a\u0430, \u043f\u0440\u0435\u0434\u043f\u043e\u0447\u0442\u0443\u0442 \u0438\u0437\u0431\u0430\u0432\u0438\u0442\u044c\u0441\u044f \u043e\u0442 \u0445\u0432\u043e\u0441\u0442\u0430\u0442\u043e\u0433\u043e \u00ab\u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430 \u043e\u043f\u0430\u0441\u043d\u043e\u0441\u0442\u0438\u00bb.\n\n4. \u0421\u044a\u0435\u043c\u043d\u043e\u0435 \u0436\u0438\u043b\u044c\u0435\n\u041d\u0435 \u0432\u0441\u0435 \u0434\u043e\u043c\u043e\u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u044b \u0440\u0430\u0437\u0440\u0435\u0448\u0430\u044e\u0442 \u0430\u0440\u0435\u043d\u0434\u0430\u0442\u043e\u0440\u0430\u043c \u0437\u0430\u0432\u043e\u0434\u0438\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445. \u041e\u0442\u0447\u0430\u0441\u0442\u0438 \u044d\u0442\u043e\n\u0441\u0432\u044f\u0437\u0430\u043d\u043e \u0441 \u043e\u043f\u0430\u0441\u0435\u043d\u0438\u044f\u043c\u0438, \u0447\u0442\u043e \u043a\u043e\u0442 \u0438\u043b\u0438 \u0441\u043e\u0431\u0430\u043a\u0430 \u0438\u0441\u043f\u043e\u0440\u0442\u044f\u0442 \u043c\u0435\u0431\u0435\u043b\u044c, \u043e\u0431\u043e\u0438 \u0438 \u0434\u0435\u0440\u0435\u0432\u044f\u043d\u043d\u044b\u0435\n\u0447\u0430\u0441\u0442\u0438 \u0438\u043d\u0442\u0435\u0440\u044c\u0435\u0440\u0430. \u041a\u0440\u043e\u043c\u0435 \u0442\u043e\u0433\u043e, \u0432 \u043a\u043e\u043c\u043d\u0430\u0442\u0430\u0445 \u043e\u0441\u0442\u0430\u0435\u0442\u0441\u044f \u043d\u0435\u043f\u0440\u0438\u044f\u0442\u043d\u044b\u0439 \u0437\u0430\u043f\u0430\u0445 \u043c\u0435\u0442\u043e\u043a \u0438\n\u0448\u0435\u0440\u0441\u0442\u0438, \u0443\u0441\u0442\u0440\u0430\u043d\u0435\u043d\u0438\u0435 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043f\u043e\u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u0434\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0445 \u0442\u0440\u0430\u0442. \u0415\u0441\u043b\u0438 \u0445\u043e\u0437\u044f\u0438\u043d \u0436\u0438\u043b\u044c\u044f\n\u043e\u0431\u043d\u0430\u0440\u0443\u0436\u0438\u0442 \u043e\u0431\u043c\u0430\u043d \u0441\u043e \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u043a\u0432\u0430\u0440\u0442\u0438\u0440\u0430\u043d\u0442\u0430, \u0442\u043e, \u0441\u043a\u043e\u0440\u0435\u0435 \u0432\u0441\u0435\u0433\u043e, \u0437\u0430\u044f\u0432\u0438\u0442 \u043e \u0436\u0435\u043b\u0430\u043d\u0438\u0438\n\u043d\u0435\u043c\u0435\u0434\u043b\u0435\u043d\u043d\u043e \u0440\u0430\u0441\u0442\u043e\u0440\u0433\u043d\u0443\u0442\u044c \u0434\u043e\u0433\u043e\u0432\u043e\u0440. \u041f\u043e\u0441\u043b\u0435 \u044d\u0442\u043e\u0433\u043e \u0438 \u043b\u044e\u0434\u0438, \u0438 \u0438\u0445 \u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043e\u043a\u0430\u0436\u0443\u0442\u0441\u044f \u043d\u0430\n\u0443\u043b\u0438\u0446\u0435. \u0410 \u043f\u043e\u0441\u043a\u043e\u043b\u044c\u043a\u0443 \u043d\u0430\u0439\u0442\u0438 \u0441\u044a\u0435\u043c\u043d\u0443\u044e \u0436\u0438\u043b\u043f\u043b\u043e\u0449\u0430\u0434\u044c, \u0433\u0434\u0435 \u0431\u0443\u0434\u0443\u0442 \u0440\u0430\u0434\u044b \u043f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0438\u044e\n\u043c\u0443\u0440\u043b\u044b\u043a\u0430\u044e\u0449\u0435\u0433\u043e \u0438\u043b\u0438 \u043b\u0430\u044e\u0449\u0435\u0433\u043e \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f, \u043d\u0435 \u0442\u0430\u043a \u0443\u0436 \u043f\u0440\u043e\u0441\u0442\u043e, \u0441\u0443\u0434\u044c\u0431\u0430 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0431\u0443\u0434\u0435\u0442\n\u043d\u0435\u0437\u0430\u0432\u0438\u0434\u043d\u043e\u0439: \u043e\u043d\u043e \u0441\u043d\u043e\u0432\u0430 \u0441\u0442\u0430\u043d\u0435\u0442 \u043d\u0438\u0447\u0435\u0439\u043d\u044b\u043c \u0438 \u0431\u0435\u0437\u0434\u043e\u043c\u043d\u044b\u043c.\n\n5. \u0416\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0432 \u043f\u043e\u0434\u0430\u0440\u043e\u043a \u0438\u043b\u0438 \u0434\u043b\u044f \u0440\u0430\u0431\u043e\u0442\u044b\n\u041f\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0438\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0432 \u0434\u043e\u043c\u0435 \u043d\u0430\u043a\u043b\u0430\u0434\u044b\u0432\u0430\u0435\u0442 \u043d\u0430 \u0435\u0433\u043e \u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u0435\u0432 \u0440\u044f\u0434 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u0441\u0442\u0432\n(\u0432 \u0442\u043e\u043c \u0447\u0438\u0441\u043b\u0435 \u0438 \u0444\u0438\u043d\u0430\u043d\u0441\u043e\u0432\u044b\u0445), \u0441\u0432\u044f\u0437\u0430\u043d\u043d\u044b\u0445 \u0441 \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u0435\u043c, \u043b\u0435\u0447\u0435\u043d\u0438\u0435\u043c, \u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u043c\n\u0441\u043e\u0434\u0435\u0440\u0436\u0430\u043d\u0438\u0435\u043c. \u041f\u043e \u044d\u0442\u043e\u0439 \u043f\u0440\u0438\u0447\u0438\u043d\u0435 \u043f\u0440\u0438\u043e\u0431\u0440\u0435\u0442\u0435\u043d\u0438\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u0441\u043f\u043e\u043d\u0442\u0430\u043d\u043d\u044b\u043c;\n\u043f\u0440\u0435\u0436\u0434\u0435 \u0447\u0435\u043c \u0440\u0435\u0448\u0438\u0442\u044c\u0441\u044f \u043d\u0430 \u0442\u0430\u043a\u043e\u0439 \u0448\u0430\u0433, \u0447\u0435\u043b\u043e\u0432\u0435\u043a \u0434\u043e\u043b\u0436\u0435\u043d \u0432\u0441\u0435 \u043e\u0431\u0434\u0443\u043c\u0430\u0442\u044c \u0438 \u0440\u0430\u0441\u0441\u0447\u0438\u0442\u0430\u0442\u044c.\n\u041f\u043e\u043b\u0443\u0447\u0430\u044f \u043a\u043e\u0442\u0435\u043d\u043a\u0430 \u0438\u043b\u0438 \u0449\u0435\u043d\u043a\u0430 \u0432 \u043f\u043e\u0434\u0430\u0440\u043e\u043a, \u043d\u043e\u0432\u044b\u0439 \u0432\u043b\u0430\u0434\u0435\u043b\u0435\u0446 \u043b\u0438\u0448\u0435\u043d \u0442\u0430\u043a\u043e\u0439 \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u0438.\n\u0414\u0430\u0436\u0435 \u0435\u0441\u043b\u0438 \u043f\u043e\u043d\u0430\u0447\u0430\u043b\u0443 \u043e\u043d \u0440\u0430\u0434 \u043f\u043e\u044f\u0432\u043b\u0435\u043d\u0438\u044e \u043c\u044f\u0433\u043a\u043e\u0433\u043e \u043f\u0443\u0448\u0438\u0441\u0442\u043e\u0433\u043e \u043a\u043e\u043c\u043e\u0447\u043a\u0430, \u0442\u043e \u043f\u043e \u043f\u0440\u043e\u0448\u0435\u0441\u0442\u0432\u0438\u0438\n\u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u0438\u0445 \u0434\u043d\u0435\u0439, \u0441\u0442\u043e\u043b\u043a\u043d\u0443\u0432\u0448\u0438\u0441\u044c \u0441 \u0442\u0435\u043c, \u0447\u0442\u043e \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043c\u043d\u043e\u0433\u043e \u0432\u043d\u0438\u043c\u0430\u043d\u0438\u044f \u0438 \u043d\u0435\n\u0432\u0441\u0435\u0433\u0434\u0430 \u043f\u043e\u0441\u043b\u0443\u0448\u043d\u043e, \u043c\u043e\u0436\u0435\u0442 \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0441\u0432\u043e\u0435 \u043c\u043d\u0435\u043d\u0438\u0435 \u0438 \u043f\u043e\u043f\u0440\u043e\u0441\u0442\u0443 \u0438\u0437\u0431\u0430\u0432\u0438\u0442\u044c\u0441\u044f \u043e\u0442 \u0442\u0430\u043a\u043e\u0439\n\u00ab\u043e\u0431\u0443\u0437\u044b\u00bb. \u0425\u043e\u0440\u043e\u0448\u043e, \u0435\u0441\u043b\u0438 \u0437\u0432\u0435\u0440\u044c\u043a\u0430 \u0432\u0435\u0440\u043d\u0443\u0442 \u043e\u0431\u0440\u0430\u0442\u043d\u043e \u0432 \u043f\u0440\u0438\u044e\u0442 \u0438\u043b\u0438 \u043e\u0442\u0434\u0430\u0434\u0443\u0442 \u0432 \u0434\u043e\u0431\u0440\u044b\u0435 \u0440\u0443\u043a\u0438,\n\u043d\u043e, \u043a\u0430\u043a \u043f\u043e\u043a\u0430\u0437\u044b\u0432\u0430\u0435\u0442 \u043f\u0440\u0430\u043a\u0442\u0438\u043a\u0430, \u043d\u0435\u043d\u0443\u0436\u043d\u044b\u0445 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432 \u043f\u043e\u043f\u0440\u043e\u0441\u0442\u0443 \u0432\u044b\u0441\u0442\u0430\u0432\u043b\u044f\u044e\u0442 \u0437\u0430 \u0434\u0432\u0435\u0440\u044c.\n\u0422\u043e \u0436\u0435 \u0441\u0430\u043c\u043e\u0435 \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442, \u0435\u0441\u043b\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u043d\u0435 \u043e\u043f\u0440\u0430\u0432\u0434\u0430\u043b\u043e \u0432\u043e\u0437\u043b\u0430\u0433\u0430\u0435\u043c\u044b\u0445 \u043d\u0430 \u043d\u0435\u0433\u043e \u043d\u0430\u0434\u0435\u0436\u0434:\n\u043a\u043e\u0442 \u043e\u0442\u043a\u0430\u0437\u0430\u043b\u0441\u044f \u043b\u043e\u0432\u0438\u0442\u044c \u043c\u044b\u0448\u0435\u0439, \u0430 \u0441\u043e\u0431\u0430\u043a\u0430 \u043d\u0435 \u043f\u043e\u043d\u044f\u043b\u0430, \u0447\u0442\u043e \u0435\u0435 \u0437\u0430\u0434\u0430\u0447\u0430 \u2014 \u043e\u0445\u0440\u0430\u043d\u0430 \u0434\u0432\u043e\u0440\u0430.\n\u0415\u0434\u0438\u043d\u0441\u0442\u0432\u0435\u043d\u043d\u0430\u044f \u0432\u044b\u0433\u043e\u0434\u0430, \u043a\u043e\u0442\u043e\u0440\u0443\u044e \u043f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0447\u0435\u043b\u043e\u0432\u0435\u043a, \u0437\u0430\u0432\u043e\u0434\u044f \u043f\u0438\u0442\u043e\u043c\u0446\u0430, \u2014 \u044d\u0442\u043e \u0440\u0430\u0434\u043e\u0441\u0442\u044c\n\u043e\u0431\u0449\u0435\u043d\u0438\u044f, \u043d\u043e \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0445\u043e\u0437\u044f\u0435\u0432\u0430 \u0441\u0447\u0438\u0442\u0430\u044e\u0442 \u0438\u043d\u0430\u0447\u0435 \u0438 \u043d\u0435 \u0445\u043e\u0442\u044f\u0442 \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0442\u044c \u00ab\u0434\u0430\u0440\u043c\u043e\u0435\u0434\u043e\u0432\u00bb.\n\u0422\u0430\u043a\u0438\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435 \u0441\u043d\u043e\u0432\u0430 \u043f\u043e\u043f\u043e\u043b\u043d\u044f\u044e\u0442 \u0440\u044f\u0434\u044b \u0431\u0435\u0437\u0434\u043e\u043c\u043d\u044b\u0445. \u0412\u0441\u0435 \u043f\u0440\u0438\u0447\u0438\u043d\u044b \u0434\u043b\u044f \u043e\u0442\u043a\u0430\u0437\u0430 \u0441\u0432\u043e\u0434\u044f\u0442\u0441\u044f\n\u043a \u0436\u0435\u043b\u0430\u043d\u0438\u044e \u0441\u0434\u0435\u043b\u0430\u0442\u044c \u0442\u0430\u043a, \u0447\u0442\u043e\u0431\u044b \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0443\u0436\u0435 \u0443\u0441\u043f\u0435\u043b\u043e \u0432\u043a\u0443\u0441\u0438\u0442\u044c \u043f\u0440\u0435\u043b\u0435\u0441\u0442\u0438\n\u0443\u043b\u0438\u0447\u043d\u043e\u0439 \u0436\u0438\u0437\u043d\u0438, \u043d\u0435 \u043e\u043a\u0430\u0437\u0430\u043b\u0430\u0441\u044c \u0432\u044b\u0431\u0440\u043e\u0448\u0435\u043d\u043d\u044b\u043c \u0441\u043d\u043e\u0432\u0430. \u041f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u0440\u044f\u0434 \u043b\u0438 \u0441\u0442\u043e\u0438\u0442 \u043e\u0431\u0438\u0436\u0430\u0442\u044c\u0441\u044f\n\u043d\u0430 \u0440\u0430\u0431\u043e\u0442\u043d\u0438\u043a\u043e\u0432 \u043f\u0440\u0438\u044e\u0442\u0430, \u0435\u0441\u043b\u0438 \u043e\u043d\u0438 \u043d\u0435 \u043f\u043e\u0437\u0432\u043e\u043b\u0438\u043b\u0438 \u0432\u0430\u043c \u0437\u0430\u0431\u0440\u0430\u0442\u044c \u0434\u043e\u043c\u043e\u0439 \u043f\u043e\u043d\u0440\u0430\u0432\u0438\u0432\u0448\u0435\u0433\u043e\u0441\u044f\n\u043f\u0438\u0442\u043e\u043c\u0446\u0430.\n\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.REASONS_FOR_REFUSAL_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#REASONS_FOR_REFUSAL_COMMAND_LABEL">REASONS_FOR_REFUSAL_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udec7  \u041f\u043e\u0447\u0435\u043c\u0443 \u0412\u0430\u043c \u043c\u043e\u0433\u0443\u0442 \u043e\u0442\u043a\u0430\u0437\u0430\u0442\u044c?"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_DOG">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_DOG">RECOMM_FOR_DOG</a></code></div>
<div class="col-last even-row-color"><code>"\u0421\u043e\u0431\u0430\u043a\u0430 \u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0441\u044f \u0447\u043b\u0435\u043d\u043e\u043c \u0441\u0435\u043c\u044c\u0438, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u0441\u0442\u043e\u0438\u0442 \u0441\u0435\u0440\u044c\u0435\u0437\u043d\u043e \u043f\u043e\u0437\u0430\u0431\u043e\u0442\u0438\u0442\u044c\u0441\u044f \u043e\n\u0435\u0435 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u0443\u0433\u043e\u043b\u043a\u0435. \u0412\u0430\u0448\u0435\u043c\u0443 \u0447\u0435\u0442\u0432\u0435\u0440\u043e\u043d\u043e\u0433\u043e\u043c\u0443 \u0434\u0440\u0443\u0433\u0443 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043d\u0443\u0436\u043d\u043e \u0441\u0432\u043e\u0435\n\u043c\u0435\u0441\u0442\u043e, \u0433\u0434\u0435 \u043e\u043d \u0441\u043c\u043e\u0436\u0435\u0442 \u043e\u0442\u0434\u043e\u0445\u043d\u0443\u0442\u044c, \u043f\u043e\u0434\u0440\u0435\u043c\u0430\u0442\u044c \u0438\u043b\u0438 \u043f\u0440\u043e\u0441\u0442\u043e \u043f\u043e\u0431\u044b\u0442\u044c \u0432 \u043e\u0434\u0438\u043d\u043e\u0447\u0435\u0441\u0442\u0432\u0435.\n\u0412\u044b\u0431\u0438\u0440\u0430\u044f \u0442\u0430\u043a\u043e\u0435 \u043c\u0435\u0441\u0442\u043e, \u043d\u0435\u043f\u043b\u043e\u0445\u043e \u0431\u044b \u0441\u043e\u0433\u043b\u0430\u0441\u043e\u0432\u0430\u0442\u044c \u0435\u0433\u043e \u0441 \u0441\u043e\u0431\u0430\u043a\u043e\u0439. \u041f\u043e\u0442\u043e\u043c\u0443 \u0447\u0442\u043e \u0438\u043d\u0430\u0447\u0435\n\u043f\u0435\u0441 \u043d\u0430\u0439\u0434\u0435\u0442 \u0441\u0435\u0431\u0435 \u043c\u0435\u0441\u0442\u0435\u0447\u043a\u043e \u043f\u043e \u0434\u0443\u0448\u0435, \u043d\u0435 \u0441\u043f\u0440\u043e\u0441\u0438\u0432 \u0432\u0430\u0448\u0435\u0433\u043e \u043c\u043d\u0435\u043d\u0438\u044f.\n\u041b\u044e\u0431\u0430\u044f \u0441\u043e\u0431\u0430\u043a\u0430 \u0434\u043e\u043b\u0436\u043d\u0430 \u0438\u043c\u0435\u0442\u044c \u0432 \u0434\u043e\u043c\u0435 \u0441\u0432\u043e\u0438 \u043c\u0435\u0441\u0442\u0430, \u0434\u0432\u0430 \u0438\u0437 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u044b:\n\u043c\u0435\u0441\u0442\u043e \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f \u0438 \u043c\u0435\u0441\u0442\u043e \u0434\u043b\u044f \u043e\u0442\u0434\u044b\u0445\u0430.\n\u0422\u0440\u0435\u0442\u044c\u0435 \u2014 \u0442\u0443\u0430\u043b\u0435\u0442, \u0441\u043e\u0437\u0434\u0430\u0435\u0442\u0441\u044f \u043b\u0438\u0431\u043e \u043f\u043e \u0436\u0435\u043b\u0430\u043d\u0438\u044e \u0445\u043e\u0437\u044f\u0435\u0432, \u043b\u0438\u0431\u043e \u0432 \u044d\u043a\u0441\u0442\u0440\u0435\u043d\u043d\u044b\u0445 \u0441\u043b\u0443\u0447\u0430\u044f\u0445\n(\u0431\u043e\u043b\u0435\u0437\u043d\u044c, \u043f\u043e\u044f\u0432\u043b\u0435\u043d\u0438\u0435 \u0449\u0435\u043d\u043a\u043e\u0432).\n\u00ab\u0421\u043f\u0430\u043b\u044c\u043d\u044f\u00bb \u0434\u043b\u044f \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430\".\n\u041d\u0435 \u0432\u0441\u0435 \u0441\u043e\u0431\u0430\u043a\u0438 \u043b\u044e\u0431\u044f\u0442 \u0441\u043f\u0430\u0442\u044c \u043f\u0440\u044f\u043c\u043e \u043d\u0430 \u043f\u043e\u043b\u0443, \u0430 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u043c \u043f\u043e\u0440\u043e\u0434\u0430\u043c\n(\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0448\u0430\u0440\u043f\u0435\u044f\u043c) \u044d\u0442\u043e \u0438 \u0432\u043e\u0432\u0441\u0435 \u043f\u0440\u043e\u0442\u0438\u0432\u043e\u043f\u043e\u043a\u0430\u0437\u0430\u043d\u043e. \u041f\u043e\u044d\u0442\u043e\u043c\u0443 \u043b\u0443\u0447\u0448\u0435 \u043e\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435\n\u0441\u0432\u043e\u0439 \u0432\u044b\u0431\u043e\u0440 \u043d\u0430 \u043c\u0430\u0442\u0440\u0430\u0441\u0438\u043a\u0435, \u043a\u043e\u0440\u0437\u0438\u043d\u043a\u0435 \u0441 \u043f\u043e\u0434\u0441\u0442\u0438\u043b\u043a\u043e\u0439 \u0438\u043b\u0438 \u0434\u043e\u043c\u0438\u043a\u0435. \u0415\u0441\u043b\u0438 \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\n\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430, \u0442\u043e \u0437\u0430\u043a\u0430\u0436\u0438\u0442\u0435 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u0443\u044e \u043c\u0435\u0431\u0435\u043b\u044c. \u0414\u0438\u0432\u0430\u043d\u044b \u0438 \u043b\u0435\u0436\u0430\u043a\u0438 \u0438\u0437 \u0437\u043e\u043e\u043c\u0430\u0433\u0430\u0437\u0438\u043d\u043e\u0432\n\u043f\u043e\u043b\u043d\u043e\u0441\u0442\u044c\u044e \u043f\u0440\u043e\u0434\u0443\u043c\u0430\u043d\u044b \u0438 \u0443\u0434\u043e\u0431\u043d\u044b \u043a\u0430\u043a \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a\u0438, \u0442\u0430\u043a \u0438 \u0434\u043b\u044f \u0445\u043e\u0437\u044f\u0438\u043d\u0430.\n\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043f\u0440\u0430\u0432\u0438\u043b \u043e \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0441\u0442\u043e\u0438\u0442 \u043f\u043e\u043c\u043d\u0438\u0442\u044c \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u0441\u043f\u0430\u043b\u044c\u043d\u043e\u0433\u043e\n\u043c\u0435\u0441\u0442\u0430. \u041f\u0440\u0438\u043f\u043e\u0434\u043d\u0438\u043c\u0438\u0442\u0435 \u043c\u0435\u0441\u0442\u043e \u043d\u0430\u0434 \u043f\u043e\u043b\u043e\u043c \u043d\u0430 5 \u2014 8 \u0441\u043c (\u0438\u043b\u0438 \u0447\u0443\u0442\u044c \u0431\u043e\u043b\u044c\u0448\u0435) \u0432\n\u0437\u0430\u0432\u0438\u0441\u0438\u043c\u043e\u0441\u0442\u0438 \u043e\u0442 \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u0441\u043e\u0431\u0430\u043a\u0438. \u042d\u0442\u043e \u0434\u0435\u043b\u0430\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u0443\u0431\u0435\u0440\u0435\u0447\u044c \u0432\u0430\u0448\u0435\u0433\u043e\n\u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u0441\u043a\u0432\u043e\u0437\u043d\u044f\u043a\u043e\u0432, \u0433\u0443\u043b\u044f\u044e\u0449\u0438\u0445 \u043f\u043e \u043f\u043e\u043b\u0443. \u041a\u043b\u0438\u043c\u0430\u0442 \u0441\u043e\u0431\u0430\u0447\u044c\u0435\u0433\u043e \u043c\u0435\u0441\u0442\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c\n\u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u043e \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u044b\u043c \u0438 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u043c. \u0421\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044c \u0441\u0434\u0435\u043b\u0430\u0442\u044c \u0442\u0430\u043a, \u0447\u0442\u043e\u0431\u044b\n\u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043c\u043e\u0433 \u0432\u0438\u0434\u0435\u0442\u044c \u0432\u0441\u0435 (\u043d\u0443 \u0438\u043b\u0438 \u043f\u043e\u0447\u0442\u0438 \u0432\u0441\u0435), \u0447\u0442\u043e \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u0432 \u0434\u043e\u043c\u0435. \u041e\u043d \u0436\u0435\n\u0447\u043b\u0435\u043d \u0441\u0435\u043c\u044c\u0438. \u0421\u043e\u0431\u0430\u043a\u0438 \u2014 \u0441\u0442\u0430\u0439\u043d\u044b\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435, \u0438\u043c \u0432\u0430\u0436\u043d\u043e \u0432\u0438\u0434\u0435\u0442\u044c \u0438 \u0441\u043b\u044b\u0448\u0430\u0442\u044c, \u0447\u0442\u043e\n\u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u0432 \u0438\u0445 \u0441\u0442\u0430\u0435, \u0442\u043e \u0435\u0441\u0442\u044c \u0432\u0430\u0448\u0435\u0439 \u0441\u0435\u043c\u044c\u0435.\n\u041e\u0447\u0435\u043d\u044c \u043f\u043b\u043e\u0445\u0430\u044f \u0438\u0434\u0435\u044f \u2014 \u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u043c\u0435\u0441\u0442\u043e \u0432 \u043a\u043e\u0440\u0438\u0434\u043e\u0440\u0435. \u041f\u0440\u043e\u0445\u043e\u0434\u044f\u0449\u0438\u0435 \u043f\u043e \u043a\u043e\u0440\u0438\u0434\u043e\u0440\u0443\n\u0431\u0443\u0434\u0443\u0442 \u0432\u0441\u0435 \u0432\u0440\u0435\u043c\u044f \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\u044c \u043f\u0441\u0430, \u043f\u043e\u0434\u0442\u0430\u043b\u043a\u0438\u0432\u0430\u0442\u044c \u0435\u0433\u043e, \u0437\u0430\u0434\u0435\u0432\u0430\u0442\u044c. \u0410 \u0437\u0432\u0443\u043a\u0438 \u0437\u0430\n\u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u0434\u0432\u0435\u0440\u044c\u044e \u2014 \u043e\u0442\u043a\u0440\u043e\u0432\u0435\u043d\u043d\u043e \u0440\u0430\u0437\u0434\u0440\u0430\u0436\u0430\u0442\u044c, \u0432\u0435\u0434\u044c \u0432 \u043b\u044e\u0431\u043e\u0439 \u0441\u043e\u0431\u0430\u043a\u0435 (\u0434\u0430\u0436\u0435 \u0432\n\u0442\u043e\u0439-\u0442\u0435\u0440\u044c\u0435\u0440\u0435) \u0435\u0441\u0442\u044c \u0438\u043d\u0441\u0442\u0438\u043d\u043a\u0442 \u043e\u0445\u0440\u0430\u043d\u043d\u0438\u043a\u0430. \u0418\u0437-\u0437\u0430 \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e\u0439 \u00ab\u0443\u0433\u0440\u043e\u0437\u044b \u043d\u0430\u043f\u0430\u0434\u0435\u043d\u0438\u044f\u00bb\n\u043d\u0430 \u0432\u0430\u0448 \u0434\u043e\u043c, \u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043d\u0435 \u0441\u043c\u043e\u0436\u0435\u0442 \u043f\u043e\u043b\u043d\u043e\u0446\u0435\u043d\u043d\u043e \u043e\u0442\u0434\u043e\u0445\u043d\u0443\u0442\u044c, \u0432\u044b\u0441\u043f\u0430\u0442\u044c\u0441\u044f, \u0447\u0442\u043e \u0432 \u0438\u0442\u043e\u0433\u0435\n\u043f\u043b\u043e\u0445\u043e \u0441\u043a\u0430\u0436\u0435\u0442\u0441\u044f \u043d\u0430 \u0435\u0433\u043e \u043d\u0435\u0440\u0432\u043d\u043e\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u0435. \u0421\u0430\u043c\u0430 \u043b\u0435\u0436\u0430\u043d\u043a\u0430 \u0434\u043e\u043b\u0436\u043d\u0430 \u043f\u043e\u0434\u0445\u043e\u0434\u0438\u0442\u044c \u043f\u043e\n\u0440\u0430\u0437\u043c\u0435\u0440\u0430\u043c \u0441\u043e\u0431\u0430\u043a\u0435, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u0430 \u043a\u0440\u0443\u043f\u043d\u043e\u0439 \u043f\u043e\u0440\u043e\u0434\u044b (\u0434\u043e\u0431\u0435\u0440\u043c\u0430\u043d, \u043e\u0432\u0447\u0430\u0440\u043a\u0430)\n\u043f\u043e\u043a\u0443\u043f\u0430\u0442\u044c \u0441\u0440\u0430\u0437\u0443 \u0431\u043e\u043b\u044c\u0448\u043e\u0439 \u043c\u0430\u0442\u0440\u0430\u0441 \u0438\u043b\u0438 \u043a\u043e\u0440\u0437\u0438\u043d\u043a\u0443, \u0435\u043c\u0443 \u0442\u0430\u043c \u0431\u0443\u0434\u0435\u0442 \u043d\u0435\u0443\u044e\u0442\u043d\u043e. \u041b\u0443\u0447\u0448\u0435 \u0432\u0437\u044f\u0442\u044c\n\u0440\u0430\u0437\u043c\u0435\u0440\u043e\u043c \u043f\u043e\u043c\u0435\u043d\u044c\u0448\u0435, \u0430 \u043f\u043e\u0442\u043e\u043c \u0437\u0430\u043c\u0435\u043d\u0438\u0442\u044c \u043d\u0430 \u0431\u043e\u043b\u044c\u0448\u0443\u044e.\n\u041c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0439 \u0441\u0435\u043a\u0440\u0435\u0442: \u0438\u0437\u043c\u0435\u0440\u044c\u0442\u0435 \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u043d\u043e\u0441\u0430 \u0434\u043e \u043a\u043e\u043d\u0447\u0438\u043a\u0430 \u0445\u0432\u043e\u0441\u0442\u0430 \u0438 \u0432 \u0445\u043e\u043b\u043a\u0435\n(\u043e\u0442 \u043b\u043e\u043f\u0430\u0442\u043e\u043a \u0438 \u0434\u043e \u0441\u0442\u043e\u043f\u044b) \u0438 \u043f\u0440\u0438\u0431\u0430\u0432\u044c\u0442\u0435 \u043a \u044d\u0442\u043e\u043c\u0443 \u0435\u0449\u0435 10 \u2014 15 \u0441\u043c. \u042d\u0442\u043e \u0438 \u0431\u0443\u0434\u0443\u0442 \u0440\u0430\u0437\u043c\u0435\u0440\u044b\n\u043b\u0435\u0436\u0430\u043d\u043a\u0438, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0435\u043c\u0443 \u0438\u0434\u0435\u0430\u043b\u044c\u043d\u043e \u043f\u043e\u0434\u043e\u0439\u0434\u0435\u0442.\n\u041a\u0441\u0442\u0430\u0442\u0438, \u043c\u0435\u0441\u0442\u043e, \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0441\u043f\u0438\u0442 \u0441\u043e\u0431\u0430\u043a\u0430, \u043d\u0443\u0436\u043d\u043e \u043a\u0430\u043a \u043c\u043e\u0436\u043d\u043e \u0447\u0430\u0449\u0435 \u0447\u0438\u0441\u0442\u0438\u0442\u044c \u043f\u044b\u043b\u0435\u0441\u043e\u0441\u043e\u043c\n\u0438\u043b\u0438 \u0449\u0435\u0442\u043a\u043e\u0439, \u0441\u0442\u0438\u0440\u0430\u0442\u044c \u0445\u043e\u0442\u044f \u0431\u044b \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0440\u0430\u0437 \u0432 \u0433\u043e\u0434 \u0438\u043b\u0438 \u043e\u0442\u0434\u0430\u0432\u0430\u0442\u044c \u0432 \u0445\u0438\u043c\u0447\u0438\u0441\u0442\u043a\u0443. \u042d\u0442\u0438\u043c\n\u0432\u044b \u0443\u0431\u0435\u0440\u0435\u0436\u0435\u0442\u0435 \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u0431\u043b\u043e\u0445 \u0438 \u043a\u043b\u0435\u0449\u0435\u0439, \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043c\u043e\u0436\u043d\u043e \u043f\u0440\u0438\u043d\u0435\u0441\u0442\u0438 \u0441 \u0443\u043b\u0438\u0446\u044b.\n\u0410 \u0437\u0430\u043e\u0434\u043d\u043e \u0438\u0437\u0431\u0430\u0432\u0438\u0442\u0435 \u0441\u0435\u0431\u044f \u0438 \u0432\u0435\u0441\u044c \u0434\u043e\u043c \u043e\u0442 \u0432\u0440\u0435\u0434\u043d\u043e\u0439 \u043c\u0438\u043a\u0440\u043e\u0444\u043b\u043e\u0440\u044b, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0440\u0430\u0437\u0432\u043e\u0434\u0438\u0442\u0441\u044f\n\u0432 \u0433\u0440\u044f\u0437\u043d\u044b\u0445 \u043b\u0435\u0436\u0430\u043d\u043a\u0430\u0445 \u043f\u0440\u043e\u0441\u0442\u043e \u043d\u0430 \u0440\u0430\u0437.\n\u041c\u0435\u0441\u0442\u043e \u0434\u043b\u044f \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f.\n\u041a\u043e\u043d\u0435\u0447\u043d\u043e \u0436\u0435, \u0443 \u0432\u0430\u0448\u0435\u0433\u043e \u043b\u044e\u0431\u0438\u043c\u0446\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043e\u0431\u0435\u0434\u0435\u043d\u043d\u043e\u0435 \u043c\u0435\u0441\u0442\u043e, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u043d\u0443\u0436\u043d\u043e\n\u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0435 \u043e\u0442 \u0441\u043e\u0431\u0430\u0447\u044c\u0435\u0439 \u0441\u043f\u0430\u043b\u044c\u043d\u0438. \u041f\u043e \u0442\u0440\u0430\u0434\u0438\u0446\u0438\u0438 \u0431\u043e\u043b\u044c\u0448\u0438\u043d\u0441\u0442\u0432\u043e \u043d\u0430\u0448\u0438\u0445\n\u043b\u044e\u0431\u0438\u0442\u0435\u043b\u0435\u0439 \u0441\u043e\u0431\u0430\u043a \u043a\u043e\u0440\u043c\u044f\u0442 \u0441\u0432\u043e\u0438\u0445 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432 \u043d\u0430 \u043a\u0443\u0445\u043d\u0435. \u042d\u0442\u043e \u0440\u0430\u0437\u0443\u043c\u043d\u043e, \u0432\u0435\u0434\u044c \u0432\u043e\u0434\u0430 \u0438\n\u043c\u0443\u0441\u043e\u0440\u043d\u043e\u0435 \u0432\u0435\u0434\u0440\u043e \u0432\u0441\u0435\u0433\u0434\u0430 \u043f\u043e\u0434 \u0440\u0443\u043a\u043e\u0439. \u041d\u0435 \u0441\u0442\u0430\u0432\u044c\u0442\u0435 \u043c\u0438\u0441\u043a\u0443 \u043e\u043a\u043e\u043b\u043e \u0431\u0430\u0442\u0430\u0440\u0435\u0438, \u043f\u043b\u0438\u0442\u044b \u0438\u043b\u0438\n\u043c\u0443\u0441\u043e\u0440\u043d\u043e\u0433\u043e \u0432\u0435\u0434\u0440\u0430. \u041d\u0430\u0439\u0434\u0438\u0442\u0435 \u0443\u0433\u043e\u043b\u043e\u0447\u0435\u043a, \u0433\u0434\u0435 \u043f\u0435\u0441 \u043d\u0435 \u0431\u0443\u0434\u0435\u0442 \u043c\u0435\u0448\u0430\u0442\u044c \u0432\u0430\u043c, \u0430 \u0432\u044b \u0435\u043c\u0443.\n\u041f\u043e\u0441\u043b\u0435\u0434\u043d\u0435\u0435 \u0443\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043d\u0438\u0435 \u043e\u0447\u0435\u043d\u044c \u0430\u043a\u0442\u0443\u0430\u043b\u044c\u043d\u043e, \u0432\u0435\u0434\u044c \u0441\u043e\u0431\u0430\u043a\u0443 \u043d\u0435\u043b\u044c\u0437\u044f \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\u044c \u0432\u043e\n\u0432\u0440\u0435\u043c\u044f \u0435\u0434\u044b \u2014 \u043c\u043e\u0436\u043d\u043e \u043b\u0435\u0433\u043a\u043e \u0441\u043f\u0440\u043e\u0432\u043e\u0446\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0430\u0433\u0440\u0435\u0441\u0441\u0438\u044e \u0441 \u0435\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b.\n\u041a\u0441\u0442\u0430\u0442\u0438, \u043b\u0443\u0447\u0448\u0435 \u0432\u0441\u0435\u0433\u043e \u043f\u0440\u0438\u043e\u0431\u0440\u0435\u0441\u0442\u0438 \u043c\u0438\u0441\u043a\u0443 \u043d\u0430 \u0448\u0442\u0430\u0442\u0438\u0432\u0435 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0442\u0430\u043a\u0443\u044e) \u0438\u043b\u0438 \u043a\u0443\u043f\u0438\u0442\u044c\n\u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u0443\u044e \u043f\u043e\u0434\u0441\u0442\u0430\u0432\u043e\u0447\u043a\u0443. \u041a\u043e\u0433\u0434\u0430 \u043f\u0435\u0441 \u0435\u0441\u0442 \u0432 \u043f\u043e\u0437\u0435 \u0436\u0438\u0440\u0430\u0444\u0430 (\u0448\u0438\u0440\u043e\u043a\u043e \u0440\u0430\u0441\u0441\u0442\u0430\u0432\u0438\u0432 \u043f\u0435\u0440\u0435\u0434\u043d\u0438\u0435\n\u043b\u0430\u043f\u044b \u0438 \u043e\u043f\u0443\u0441\u0442\u0438\u0432 \u0433\u043e\u043b\u043e\u0432\u0443 \u043a \u043c\u0438\u0441\u043a\u0435), \u043e\u043d \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u0435\u0442 \u0433\u043e\u0440\u0431\u0438\u0442\u044c\u0441\u044f \u0438 \u0445\u043e\u0434\u0438\u0442\u044c \u0441 \u043e\u043f\u0443\u0449\u0435\u043d\u043d\u043e\u0439 \u0433\u043e\u043b\u043e\u0432\u043e\u0439.\n\u041f\u0440\u0438\u0432\u044b\u0447\u043a\u0430 \u0445\u043e\u0434\u0438\u0442\u044c \u0432 \u0442\u0430\u043a\u043e\u043c \u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0438 \u0441\u043e\u0431\u0430\u043a \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043f\u043e\u0440\u043e\u0434 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0442\u0435\u0445 \u0436\u0435 \u0448\u0430\u0440\u043f\u0435\u0435\u0432)\n\u043c\u043e\u0436\u0435\u0442 \u043f\u0440\u0438\u0432\u0435\u0441\u0442\u0438 \u043a \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430\u043c \u0441 \u0434\u044b\u0445\u0430\u043d\u0438\u0435\u043c. \u041d\u043e \u0441\u0430\u043c\u043e\u0435 \u043e\u0441\u043d\u043e\u0432\u043d\u043e\u0435 \u2014 \u0442\u0430\u043a\u0430\u044f \u043f\u0440\u0438\u0432\u044b\u0447\u043a\u0430\n\u043f\u043e\u0440\u0442\u0438\u0442 \u044d\u043a\u0441\u0442\u0435\u0440\u044c\u0435\u0440, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043e\u0447\u0435\u043d\u044c \u0432\u0430\u0436\u0435\u043d \u0434\u043b\u044f \u0432\u044b\u0441\u0442\u0430\u0432\u043e\u0447\u043d\u044b\u0445 \u0441\u043e\u0431\u0430\u043a.\n\u0418 \u043f\u043e\u0441\u043b\u0435\u0434\u043d\u0435\u0435 \u043c\u0435\u0441\u0442\u043e \u2014 \u0442\u0443\u0430\u043b\u0435\u0442.\n\u0427\u0430\u0449\u0435 \u0432\u0441\u0435\u0433\u043e \u0442\u0443\u0430\u043b\u0435\u0442 \u0441\u043e\u0437\u0434\u0430\u044e\u0442 \u0434\u043b\u044f \u043c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0445 \u0441\u043e\u0431\u0430\u0447\u0435\u043a (\u0442\u043e\u0439-\u0442\u0435\u0440\u044c\u0435\u0440, \u0447\u0438\u0445\u0443\u0430\u0445\u0443\u0430, \u043b\u0435\u0432\u0440\u0435\u0442\u043a\u0430),\n\u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0440\u0435\u0434\u043a\u043e \u0445\u043e\u0434\u044f\u0442 \u043d\u0430 \u0443\u043b\u0438\u0446\u0443 \u043f\u043e \u043d\u0443\u0436\u0434\u0435, \u043b\u0438\u0431\u043e \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u043e\u0432, \u043f\u043e\u043a\u0430 \u043e\u043d\u0438 \u043d\u0435 \u043f\u0440\u0438\u0432\u044b\u043a\u043d\u0443\u0442\n\u0434\u0435\u043b\u0430\u0442\u044c \u0441\u0432\u043e\u0438 \u0434\u0435\u043b\u0430 \u0432\u043d\u0435 \u0434\u043e\u043c\u0430. \u0415\u0449\u0435 \u043e\u0434\u0438\u043d \u0441\u043b\u0443\u0447\u0430\u0439 \u043a\u043e\u0433\u0434\u0430 \u043d\u0443\u0436\u043d\u043e \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435 \u0442\u0443\u0430\u043b\u0435\u0442\u0430 \u0432\n\u0434\u043e\u043c\u0435 \u2014 \u0431\u043e\u043b\u044c\u043d\u0430\u044f \u0441\u043e\u0431\u0430\u043a\u0430, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0438\u0434\u0442\u0438 \u043d\u0430 \u0432\u044b\u0433\u0443\u043b. \u0418\u043b\u0438 \u043a\u043e\u0440\u043c\u044f\u0449\u0430\u044f \u043c\u0430\u0442\u044c,\n\u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0434\u0430\u0436\u0435 \u043f\u0440\u0438 \u0441\u0438\u043b\u044c\u043d\u043e\u0439 \u043d\u0443\u0436\u0434\u0435 \u043d\u0435 \u043f\u043e\u043a\u0438\u043d\u0435\u0442 \u0441\u0432\u043e\u0438\u0445 \u0449\u0435\u043d\u043a\u043e\u0432. \u041e\u0441\u0442\u0430\u043b\u044c\u043d\u044b\u0435 \u0441\u043b\u0443\u0447\u0430\u0438 \u2014\n\u043e\u043f\u0446\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u043e \u043d\u0430 \u0432\u0430\u0448 \u0432\u044b\u0431\u043e\u0440.\n\u041e\u0431\u0449\u0435\u043d\u0438\u0435 \u0441 \u0436\u0438\u0437\u043d\u0435\u0440\u0430\u0434\u043e\u0441\u0442\u043d\u044b\u043c, \u043e\u0431\u043e\u0436\u0430\u044e\u0449\u0438\u043c \u0445\u043e\u0437\u044f\u0438\u043d\u0430 \u0447\u0435\u0442\u0432\u0435\u0440\u043e\u043d\u043e\u0433\u0438\u043c \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c \u043f\u0440\u0438\u043d\u0435\u0441\u0435\u0442 \u043c\u043d\u043e\u0433\u043e\n\u0443\u0434\u043e\u0432\u043e\u043b\u044c\u0441\u0442\u0432\u0438\u044f. \u0427\u0442\u043e\u0431\u044b \u0435\u043c\u0443 \u0431\u044b\u043b\u043e \u0445\u043e\u0440\u043e\u0448\u043e \u0432 \u0432\u0430\u0448\u0435\u043c \u0434\u043e\u043c\u0435 \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u044c\u0442\u0435 \u043a\u043e\u043c\u0444\u043e\u0440\u0442\u043d\u044b\u0435 \u0443\u0441\u043b\u043e\u0432\u0438\u044f \u0434\u043b\u044f \u0435\u0434\u044b,\n\u043e\u0442\u0434\u044b\u0445\u0430, \u0441\u043d\u0430, \u043f\u043e\u0440\u0430\u0434\u0443\u0439\u0442\u0435 \u0438\u0433\u0440\u0443\u0448\u043a\u043e\u0439, \u043d\u0430\u0439\u0434\u0438\u0442\u0435 \u0432\u0440\u0435\u043c\u044f \u0434\u043b\u044f \u0441\u043e\u0432\u043c\u0435\u0441\u0442\u043d\u044b\u0445 \u0438\u0433\u0440 \u0438 \u043f\u0440\u043e\u0433\u0443\u043b\u043e\u043a, \u0438 \u0432\u0430\u0448\n\u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043e\u0442\u0432\u0435\u0442\u0438\u0442 \u0432\u0430\u043c \u0440\u0430\u0434\u043e\u0441\u0442\u043d\u044b\u043c \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d\u0438\u0435\u043c \u0438 \u0431\u0435\u0441\u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0439 \u043f\u0440\u0435\u0434\u0430\u043d\u043d\u043e\u0441\u0442\u044c\u044e.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_DOG_1">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_DOG_1">RECOMM_FOR_DOG_1</a></code></div>
<div class="col-last odd-row-color"><code>"\u0421\u043e\u0431\u0430\u043a\u0430 \u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0441\u044f \u0447\u043b\u0435\u043d\u043e\u043c \u0441\u0435\u043c\u044c\u0438, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u0430\u043c \u0441\u0442\u043e\u0438\u0442 \u0441\u0435\u0440\u044c\u0435\u0437\u043d\u043e \u043f\u043e\u0437\u0430\u0431\u043e\u0442\u0438\u0442\u044c\u0441\u044f \u043e\n\u0435\u0435 \u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u0443\u0433\u043e\u043b\u043a\u0435. \u0412\u0430\u0448\u0435\u043c\u0443 \u0447\u0435\u0442\u0432\u0435\u0440\u043e\u043d\u043e\u0433\u043e\u043c\u0443 \u0434\u0440\u0443\u0433\u0443 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043d\u0443\u0436\u043d\u043e \u0441\u0432\u043e\u0435\n\u043c\u0435\u0441\u0442\u043e, \u0433\u0434\u0435 \u043e\u043d \u0441\u043c\u043e\u0436\u0435\u0442 \u043e\u0442\u0434\u043e\u0445\u043d\u0443\u0442\u044c, \u043f\u043e\u0434\u0440\u0435\u043c\u0430\u0442\u044c \u0438\u043b\u0438 \u043f\u0440\u043e\u0441\u0442\u043e \u043f\u043e\u0431\u044b\u0442\u044c \u0432 \u043e\u0434\u0438\u043d\u043e\u0447\u0435\u0441\u0442\u0432\u0435.\n\u0412\u044b\u0431\u0438\u0440\u0430\u044f \u0442\u0430\u043a\u043e\u0435 \u043c\u0435\u0441\u0442\u043e, \u043d\u0435\u043f\u043b\u043e\u0445\u043e \u0431\u044b \u0441\u043e\u0433\u043b\u0430\u0441\u043e\u0432\u0430\u0442\u044c \u0435\u0433\u043e \u0441 \u0441\u043e\u0431\u0430\u043a\u043e\u0439. \u041f\u043e\u0442\u043e\u043c\u0443 \u0447\u0442\u043e \u0438\u043d\u0430\u0447\u0435\n\u043f\u0435\u0441 \u043d\u0430\u0439\u0434\u0435\u0442 \u0441\u0435\u0431\u0435 \u043c\u0435\u0441\u0442\u0435\u0447\u043a\u043e \u043f\u043e \u0434\u0443\u0448\u0435, \u043d\u0435 \u0441\u043f\u0440\u043e\u0441\u0438\u0432 \u0432\u0430\u0448\u0435\u0433\u043e \u043c\u043d\u0435\u043d\u0438\u044f.\n\u041b\u044e\u0431\u0430\u044f \u0441\u043e\u0431\u0430\u043a\u0430 \u0434\u043e\u043b\u0436\u043d\u0430 \u0438\u043c\u0435\u0442\u044c \u0432 \u0434\u043e\u043c\u0435 \u0441\u0432\u043e\u0438 \u043c\u0435\u0441\u0442\u0430, \u0434\u0432\u0430 \u0438\u0437 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u044b:\n\u043c\u0435\u0441\u0442\u043e \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f \u0438 \u043c\u0435\u0441\u0442\u043e \u0434\u043b\u044f \u043e\u0442\u0434\u044b\u0445\u0430.\n\u0422\u0440\u0435\u0442\u044c\u0435 \u2014 \u0442\u0443\u0430\u043b\u0435\u0442, \u0441\u043e\u0437\u0434\u0430\u0435\u0442\u0441\u044f \u043b\u0438\u0431\u043e \u043f\u043e \u0436\u0435\u043b\u0430\u043d\u0438\u044e \u0445\u043e\u0437\u044f\u0435\u0432, \u043b\u0438\u0431\u043e \u0432 \u044d\u043a\u0441\u0442\u0440\u0435\u043d\u043d\u044b\u0445 \u0441\u043b\u0443\u0447\u0430\u044f\u0445\n(\u0431\u043e\u043b\u0435\u0437\u043d\u044c, \u043f\u043e\u044f\u0432\u043b\u0435\u043d\u0438\u0435 \u0449\u0435\u043d\u043a\u043e\u0432).\n\u00ab\u0421\u043f\u0430\u043b\u044c\u043d\u044f\u00bb \u0434\u043b\u044f \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430\".\n\u041d\u0435 \u0432\u0441\u0435 \u0441\u043e\u0431\u0430\u043a\u0438 \u043b\u044e\u0431\u044f\u0442 \u0441\u043f\u0430\u0442\u044c \u043f\u0440\u044f\u043c\u043e \u043d\u0430 \u043f\u043e\u043b\u0443, \u0430 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u043c \u043f\u043e\u0440\u043e\u0434\u0430\u043c\n(\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0448\u0430\u0440\u043f\u0435\u044f\u043c) \u044d\u0442\u043e \u0438 \u0432\u043e\u0432\u0441\u0435 \u043f\u0440\u043e\u0442\u0438\u0432\u043e\u043f\u043e\u043a\u0430\u0437\u0430\u043d\u043e. \u041f\u043e\u044d\u0442\u043e\u043c\u0443 \u043b\u0443\u0447\u0448\u0435 \u043e\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435\n\u0441\u0432\u043e\u0439 \u0432\u044b\u0431\u043e\u0440 \u043d\u0430 \u043c\u0430\u0442\u0440\u0430\u0441\u0438\u043a\u0435, \u043a\u043e\u0440\u0437\u0438\u043d\u043a\u0435 \u0441 \u043f\u043e\u0434\u0441\u0442\u0438\u043b\u043a\u043e\u0439 \u0438\u043b\u0438 \u0434\u043e\u043c\u0438\u043a\u0435. \u0415\u0441\u043b\u0438 \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u044e\u0442\n\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0430, \u0442\u043e \u0437\u0430\u043a\u0430\u0436\u0438\u0442\u0435 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u0443\u044e \u043c\u0435\u0431\u0435\u043b\u044c. \u0414\u0438\u0432\u0430\u043d\u044b \u0438 \u043b\u0435\u0436\u0430\u043a\u0438 \u0438\u0437 \u0437\u043e\u043e\u043c\u0430\u0433\u0430\u0437\u0438\u043d\u043e\u0432\n\u043f\u043e\u043b\u043d\u043e\u0441\u0442\u044c\u044e \u043f\u0440\u043e\u0434\u0443\u043c\u0430\u043d\u044b \u0438 \u0443\u0434\u043e\u0431\u043d\u044b \u043a\u0430\u043a \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a\u0438, \u0442\u0430\u043a \u0438 \u0434\u043b\u044f \u0445\u043e\u0437\u044f\u0438\u043d\u0430.\n\u0421\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u043f\u0440\u0430\u0432\u0438\u043b \u043e \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0441\u0442\u043e\u0438\u0442 \u043f\u043e\u043c\u043d\u0438\u0442\u044c \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u0441\u043f\u0430\u043b\u044c\u043d\u043e\u0433\u043e\n\u043c\u0435\u0441\u0442\u0430. \u041f\u0440\u0438\u043f\u043e\u0434\u043d\u0438\u043c\u0438\u0442\u0435 \u043c\u0435\u0441\u0442\u043e \u043d\u0430\u0434 \u043f\u043e\u043b\u043e\u043c \u043d\u0430 5 \u2014 8 \u0441\u043c (\u0438\u043b\u0438 \u0447\u0443\u0442\u044c \u0431\u043e\u043b\u044c\u0448\u0435) \u0432\n\u0437\u0430\u0432\u0438\u0441\u0438\u043c\u043e\u0441\u0442\u0438 \u043e\u0442 \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u0441\u043e\u0431\u0430\u043a\u0438. \u042d\u0442\u043e \u0434\u0435\u043b\u0430\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u0443\u0431\u0435\u0440\u0435\u0447\u044c \u0432\u0430\u0448\u0435\u0433\u043e\n\u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u0441\u043a\u0432\u043e\u0437\u043d\u044f\u043a\u043e\u0432, \u0433\u0443\u043b\u044f\u044e\u0449\u0438\u0445 \u043f\u043e \u043f\u043e\u043b\u0443. \u041a\u043b\u0438\u043c\u0430\u0442 \u0441\u043e\u0431\u0430\u0447\u044c\u0435\u0433\u043e \u043c\u0435\u0441\u0442\u0430 \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c\n\u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u043e \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u044b\u043c \u0438 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u043c. \u0421\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044c \u0441\u0434\u0435\u043b\u0430\u0442\u044c \u0442\u0430\u043a, \u0447\u0442\u043e\u0431\u044b\n\u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043c\u043e\u0433 \u0432\u0438\u0434\u0435\u0442\u044c \u0432\u0441\u0435 (\u043d\u0443 \u0438\u043b\u0438 \u043f\u043e\u0447\u0442\u0438 \u0432\u0441\u0435), \u0447\u0442\u043e \u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u0432 \u0434\u043e\u043c\u0435. \u041e\u043d \u0436\u0435\n\u0447\u043b\u0435\u043d \u0441\u0435\u043c\u044c\u0438. \u0421\u043e\u0431\u0430\u043a\u0438 \u2014 \u0441\u0442\u0430\u0439\u043d\u044b\u0435 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0435, \u0438\u043c \u0432\u0430\u0436\u043d\u043e \u0432\u0438\u0434\u0435\u0442\u044c \u0438 \u0441\u043b\u044b\u0448\u0430\u0442\u044c, \u0447\u0442\u043e\n\u043f\u0440\u043e\u0438\u0441\u0445\u043e\u0434\u0438\u0442 \u0432 \u0438\u0445 \u0441\u0442\u0430\u0435, \u0442\u043e \u0435\u0441\u0442\u044c \u0432\u0430\u0448\u0435\u0439 \u0441\u0435\u043c\u044c\u0435.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_DOG_2">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_DOG_2">RECOMM_FOR_DOG_2</a></code></div>
<div class="col-last even-row-color"><code>"\u041e\u0447\u0435\u043d\u044c \u043f\u043b\u043e\u0445\u0430\u044f \u0438\u0434\u0435\u044f \u2014 \u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u043c\u0435\u0441\u0442\u043e \u0432 \u043a\u043e\u0440\u0438\u0434\u043e\u0440\u0435. \u041f\u0440\u043e\u0445\u043e\u0434\u044f\u0449\u0438\u0435 \u043f\u043e \u043a\u043e\u0440\u0438\u0434\u043e\u0440\u0443\n\u0431\u0443\u0434\u0443\u0442 \u0432\u0441\u0435 \u0432\u0440\u0435\u043c\u044f \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\u044c \u043f\u0441\u0430, \u043f\u043e\u0434\u0442\u0430\u043b\u043a\u0438\u0432\u0430\u0442\u044c \u0435\u0433\u043e, \u0437\u0430\u0434\u0435\u0432\u0430\u0442\u044c. \u0410 \u0437\u0432\u0443\u043a\u0438 \u0437\u0430\n\u0432\u0445\u043e\u0434\u043d\u043e\u0439 \u0434\u0432\u0435\u0440\u044c\u044e \u2014 \u043e\u0442\u043a\u0440\u043e\u0432\u0435\u043d\u043d\u043e \u0440\u0430\u0437\u0434\u0440\u0430\u0436\u0430\u0442\u044c, \u0432\u0435\u0434\u044c \u0432 \u043b\u044e\u0431\u043e\u0439 \u0441\u043e\u0431\u0430\u043a\u0435 (\u0434\u0430\u0436\u0435 \u0432\n\u0442\u043e\u0439-\u0442\u0435\u0440\u044c\u0435\u0440\u0435) \u0435\u0441\u0442\u044c \u0438\u043d\u0441\u0442\u0438\u043d\u043a\u0442 \u043e\u0445\u0440\u0430\u043d\u043d\u0438\u043a\u0430. \u0418\u0437-\u0437\u0430 \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u043e\u0439 \u00ab\u0443\u0433\u0440\u043e\u0437\u044b \u043d\u0430\u043f\u0430\u0434\u0435\u043d\u0438\u044f\u00bb\n\u043d\u0430 \u0432\u0430\u0448 \u0434\u043e\u043c, \u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043d\u0435 \u0441\u043c\u043e\u0436\u0435\u0442 \u043f\u043e\u043b\u043d\u043e\u0446\u0435\u043d\u043d\u043e \u043e\u0442\u0434\u043e\u0445\u043d\u0443\u0442\u044c, \u0432\u044b\u0441\u043f\u0430\u0442\u044c\u0441\u044f, \u0447\u0442\u043e \u0432 \u0438\u0442\u043e\u0433\u0435\n\u043f\u043b\u043e\u0445\u043e \u0441\u043a\u0430\u0436\u0435\u0442\u0441\u044f \u043d\u0430 \u0435\u0433\u043e \u043d\u0435\u0440\u0432\u043d\u043e\u0439 \u0441\u0438\u0441\u0442\u0435\u043c\u0435. \u0421\u0430\u043c\u0430 \u043b\u0435\u0436\u0430\u043d\u043a\u0430 \u0434\u043e\u043b\u0436\u043d\u0430 \u043f\u043e\u0434\u0445\u043e\u0434\u0438\u0442\u044c \u043f\u043e\n\u0440\u0430\u0437\u043c\u0435\u0440\u0430\u043c \u0441\u043e\u0431\u0430\u043a\u0435, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u043d\u0435 \u0441\u0442\u043e\u0438\u0442 \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u0430 \u043a\u0440\u0443\u043f\u043d\u043e\u0439 \u043f\u043e\u0440\u043e\u0434\u044b (\u0434\u043e\u0431\u0435\u0440\u043c\u0430\u043d, \u043e\u0432\u0447\u0430\u0440\u043a\u0430)\n\u043f\u043e\u043a\u0443\u043f\u0430\u0442\u044c \u0441\u0440\u0430\u0437\u0443 \u0431\u043e\u043b\u044c\u0448\u043e\u0439 \u043c\u0430\u0442\u0440\u0430\u0441 \u0438\u043b\u0438 \u043a\u043e\u0440\u0437\u0438\u043d\u043a\u0443, \u0435\u043c\u0443 \u0442\u0430\u043c \u0431\u0443\u0434\u0435\u0442 \u043d\u0435\u0443\u044e\u0442\u043d\u043e. \u041b\u0443\u0447\u0448\u0435 \u0432\u0437\u044f\u0442\u044c\n\u0440\u0430\u0437\u043c\u0435\u0440\u043e\u043c \u043f\u043e\u043c\u0435\u043d\u044c\u0448\u0435, \u0430 \u043f\u043e\u0442\u043e\u043c \u0437\u0430\u043c\u0435\u043d\u0438\u0442\u044c \u043d\u0430 \u0431\u043e\u043b\u044c\u0448\u0443\u044e.\n\u041c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0439 \u0441\u0435\u043a\u0440\u0435\u0442: \u0438\u0437\u043c\u0435\u0440\u044c\u0442\u0435 \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u043d\u043e\u0441\u0430 \u0434\u043e \u043a\u043e\u043d\u0447\u0438\u043a\u0430 \u0445\u0432\u043e\u0441\u0442\u0430 \u0438 \u0432 \u0445\u043e\u043b\u043a\u0435\n(\u043e\u0442 \u043b\u043e\u043f\u0430\u0442\u043e\u043a \u0438 \u0434\u043e \u0441\u0442\u043e\u043f\u044b) \u0438 \u043f\u0440\u0438\u0431\u0430\u0432\u044c\u0442\u0435 \u043a \u044d\u0442\u043e\u043c\u0443 \u0435\u0449\u0435 10 \u2014 15 \u0441\u043c. \u042d\u0442\u043e \u0438 \u0431\u0443\u0434\u0443\u0442 \u0440\u0430\u0437\u043c\u0435\u0440\u044b\n\u043b\u0435\u0436\u0430\u043d\u043a\u0438, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0435\u043c\u0443 \u0438\u0434\u0435\u0430\u043b\u044c\u043d\u043e \u043f\u043e\u0434\u043e\u0439\u0434\u0435\u0442.\n\u041a\u0441\u0442\u0430\u0442\u0438, \u043c\u0435\u0441\u0442\u043e, \u043d\u0430 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u0441\u043f\u0438\u0442 \u0441\u043e\u0431\u0430\u043a\u0430, \u043d\u0443\u0436\u043d\u043e \u043a\u0430\u043a \u043c\u043e\u0436\u043d\u043e \u0447\u0430\u0449\u0435 \u0447\u0438\u0441\u0442\u0438\u0442\u044c \u043f\u044b\u043b\u0435\u0441\u043e\u0441\u043e\u043c\n\u0438\u043b\u0438 \u0449\u0435\u0442\u043a\u043e\u0439, \u0441\u0442\u0438\u0440\u0430\u0442\u044c \u0445\u043e\u0442\u044f \u0431\u044b \u043d\u0435\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0440\u0430\u0437 \u0432 \u0433\u043e\u0434 \u0438\u043b\u0438 \u043e\u0442\u0434\u0430\u0432\u0430\u0442\u044c \u0432 \u0445\u0438\u043c\u0447\u0438\u0441\u0442\u043a\u0443. \u042d\u0442\u0438\u043c\n\u0432\u044b \u0443\u0431\u0435\u0440\u0435\u0436\u0435\u0442\u0435 \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u043e\u0442 \u0431\u043b\u043e\u0445 \u0438 \u043a\u043b\u0435\u0449\u0435\u0439, \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043c\u043e\u0436\u043d\u043e \u043f\u0440\u0438\u043d\u0435\u0441\u0442\u0438 \u0441 \u0443\u043b\u0438\u0446\u044b.\n\u0410 \u0437\u0430\u043e\u0434\u043d\u043e \u0438\u0437\u0431\u0430\u0432\u0438\u0442\u0435 \u0441\u0435\u0431\u044f \u0438 \u0432\u0435\u0441\u044c \u0434\u043e\u043c \u043e\u0442 \u0432\u0440\u0435\u0434\u043d\u043e\u0439 \u043c\u0438\u043a\u0440\u043e\u0444\u043b\u043e\u0440\u044b, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0440\u0430\u0437\u0432\u043e\u0434\u0438\u0442\u0441\u044f\n\u0432 \u0433\u0440\u044f\u0437\u043d\u044b\u0445 \u043b\u0435\u0436\u0430\u043d\u043a\u0430\u0445 \u043f\u0440\u043e\u0441\u0442\u043e \u043d\u0430 \u0440\u0430\u0437.\n\u041c\u0435\u0441\u0442\u043e \u0434\u043b\u044f \u043a\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u044f.\n\u041a\u043e\u043d\u0435\u0447\u043d\u043e \u0436\u0435, \u0443 \u0432\u0430\u0448\u0435\u0433\u043e \u043b\u044e\u0431\u0438\u043c\u0446\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043e\u0431\u0435\u0434\u0435\u043d\u043d\u043e\u0435 \u043c\u0435\u0441\u0442\u043e, \u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u043d\u0443\u0436\u043d\u043e\n\u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0435 \u043e\u0442 \u0441\u043e\u0431\u0430\u0447\u044c\u0435\u0439 \u0441\u043f\u0430\u043b\u044c\u043d\u0438. \u041f\u043e \u0442\u0440\u0430\u0434\u0438\u0446\u0438\u0438 \u0431\u043e\u043b\u044c\u0448\u0438\u043d\u0441\u0442\u0432\u043e \u043d\u0430\u0448\u0438\u0445\n\u043b\u044e\u0431\u0438\u0442\u0435\u043b\u0435\u0439 \u0441\u043e\u0431\u0430\u043a \u043a\u043e\u0440\u043c\u044f\u0442 \u0441\u0432\u043e\u0438\u0445 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u0432 \u043d\u0430 \u043a\u0443\u0445\u043d\u0435. \u042d\u0442\u043e \u0440\u0430\u0437\u0443\u043c\u043d\u043e, \u0432\u0435\u0434\u044c \u0432\u043e\u0434\u0430 \u0438\n\u043c\u0443\u0441\u043e\u0440\u043d\u043e\u0435 \u0432\u0435\u0434\u0440\u043e \u0432\u0441\u0435\u0433\u0434\u0430 \u043f\u043e\u0434 \u0440\u0443\u043a\u043e\u0439. \u041d\u0435 \u0441\u0442\u0430\u0432\u044c\u0442\u0435 \u043c\u0438\u0441\u043a\u0443 \u043e\u043a\u043e\u043b\u043e \u0431\u0430\u0442\u0430\u0440\u0435\u0438, \u043f\u043b\u0438\u0442\u044b \u0438\u043b\u0438\n\u043c\u0443\u0441\u043e\u0440\u043d\u043e\u0433\u043e \u0432\u0435\u0434\u0440\u0430. \u041d\u0430\u0439\u0434\u0438\u0442\u0435 \u0443\u0433\u043e\u043b\u043e\u0447\u0435\u043a, \u0433\u0434\u0435 \u043f\u0435\u0441 \u043d\u0435 \u0431\u0443\u0434\u0435\u0442 \u043c\u0435\u0448\u0430\u0442\u044c \u0432\u0430\u043c, \u0430 \u0432\u044b \u0435\u043c\u0443.\n\u041f\u043e\u0441\u043b\u0435\u0434\u043d\u0435\u0435 \u0443\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043d\u0438\u0435 \u043e\u0447\u0435\u043d\u044c \u0430\u043a\u0442\u0443\u0430\u043b\u044c\u043d\u043e, \u0432\u0435\u0434\u044c \u0441\u043e\u0431\u0430\u043a\u0443 \u043d\u0435\u043b\u044c\u0437\u044f \u0431\u0435\u0441\u043f\u043e\u043a\u043e\u0438\u0442\u044c \u0432\u043e\n\u0432\u0440\u0435\u043c\u044f \u0435\u0434\u044b \u2014 \u043c\u043e\u0436\u043d\u043e \u043b\u0435\u0433\u043a\u043e \u0441\u043f\u0440\u043e\u0432\u043e\u0446\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0430\u0433\u0440\u0435\u0441\u0441\u0438\u044e \u0441 \u0435\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b.\n\u041a\u0441\u0442\u0430\u0442\u0438, \u043b\u0443\u0447\u0448\u0435 \u0432\u0441\u0435\u0433\u043e \u043f\u0440\u0438\u043e\u0431\u0440\u0435\u0441\u0442\u0438 \u043c\u0438\u0441\u043a\u0443 \u043d\u0430 \u0448\u0442\u0430\u0442\u0438\u0432\u0435 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0442\u0430\u043a\u0443\u044e) \u0438\u043b\u0438 \u043a\u0443\u043f\u0438\u0442\u044c\n\u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u0443\u044e \u043f\u043e\u0434\u0441\u0442\u0430\u0432\u043e\u0447\u043a\u0443. \u041a\u043e\u0433\u0434\u0430 \u043f\u0435\u0441 \u0435\u0441\u0442 \u0432 \u043f\u043e\u0437\u0435 \u0436\u0438\u0440\u0430\u0444\u0430 (\u0448\u0438\u0440\u043e\u043a\u043e \u0440\u0430\u0441\u0441\u0442\u0430\u0432\u0438\u0432 \u043f\u0435\u0440\u0435\u0434\u043d\u0438\u0435\n\u043b\u0430\u043f\u044b \u0438 \u043e\u043f\u0443\u0441\u0442\u0438\u0432 \u0433\u043e\u043b\u043e\u0432\u0443 \u043a \u043c\u0438\u0441\u043a\u0435), \u043e\u043d \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u0435\u0442 \u0433\u043e\u0440\u0431\u0438\u0442\u044c\u0441\u044f \u0438 \u0445\u043e\u0434\u0438\u0442\u044c \u0441 \u043e\u043f\u0443\u0449\u0435\u043d\u043d\u043e\u0439 \u0433\u043e\u043b\u043e\u0432\u043e\u0439.\n\u041f\u0440\u0438\u0432\u044b\u0447\u043a\u0430 \u0445\u043e\u0434\u0438\u0442\u044c \u0432 \u0442\u0430\u043a\u043e\u043c \u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0438 \u0441\u043e\u0431\u0430\u043a \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u043f\u043e\u0440\u043e\u0434 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0442\u0435\u0445 \u0436\u0435 \u0448\u0430\u0440\u043f\u0435\u0435\u0432)\n\u043c\u043e\u0436\u0435\u0442 \u043f\u0440\u0438\u0432\u0435\u0441\u0442\u0438 \u043a \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u0430\u043c \u0441 \u0434\u044b\u0445\u0430\u043d\u0438\u0435\u043c. \u041d\u043e \u0441\u0430\u043c\u043e\u0435 \u043e\u0441\u043d\u043e\u0432\u043d\u043e\u0435 \u2014 \u0442\u0430\u043a\u0430\u044f \u043f\u0440\u0438\u0432\u044b\u0447\u043a\u0430\n\u043f\u043e\u0440\u0442\u0438\u0442 \u044d\u043a\u0441\u0442\u0435\u0440\u044c\u0435\u0440, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043e\u0447\u0435\u043d\u044c \u0432\u0430\u0436\u0435\u043d \u0434\u043b\u044f \u0432\u044b\u0441\u0442\u0430\u0432\u043e\u0447\u043d\u044b\u0445 \u0441\u043e\u0431\u0430\u043a.\n\u0418 \u043f\u043e\u0441\u043b\u0435\u0434\u043d\u0435\u0435 \u043c\u0435\u0441\u0442\u043e \u2014 \u0442\u0443\u0430\u043b\u0435\u0442.\n\u0427\u0430\u0449\u0435 \u0432\u0441\u0435\u0433\u043e \u0442\u0443\u0430\u043b\u0435\u0442 \u0441\u043e\u0437\u0434\u0430\u044e\u0442 \u0434\u043b\u044f \u043c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0445 \u0441\u043e\u0431\u0430\u0447\u0435\u043a (\u0442\u043e\u0439-\u0442\u0435\u0440\u044c\u0435\u0440, \u0447\u0438\u0445\u0443\u0430\u0445\u0443\u0430, \u043b\u0435\u0432\u0440\u0435\u0442\u043a\u0430),\n\u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0440\u0435\u0434\u043a\u043e \u0445\u043e\u0434\u044f\u0442 \u043d\u0430 \u0443\u043b\u0438\u0446\u0443 \u043f\u043e \u043d\u0443\u0436\u0434\u0435, \u043b\u0438\u0431\u043e \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u043e\u0432, \u043f\u043e\u043a\u0430 \u043e\u043d\u0438 \u043d\u0435 \u043f\u0440\u0438\u0432\u044b\u043a\u043d\u0443\u0442\n\u0434\u0435\u043b\u0430\u0442\u044c \u0441\u0432\u043e\u0438 \u0434\u0435\u043b\u0430 \u0432\u043d\u0435 \u0434\u043e\u043c\u0430. \u0415\u0449\u0435 \u043e\u0434\u0438\u043d \u0441\u043b\u0443\u0447\u0430\u0439 \u043a\u043e\u0433\u0434\u0430 \u043d\u0443\u0436\u043d\u043e \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435 \u0442\u0443\u0430\u043b\u0435\u0442\u0430 \u0432\n\u0434\u043e\u043c\u0435 \u2014 \u0431\u043e\u043b\u044c\u043d\u0430\u044f \u0441\u043e\u0431\u0430\u043a\u0430, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0438\u0434\u0442\u0438 \u043d\u0430 \u0432\u044b\u0433\u0443\u043b. \u0418\u043b\u0438 \u043a\u043e\u0440\u043c\u044f\u0449\u0430\u044f \u043c\u0430\u0442\u044c,\n\u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0434\u0430\u0436\u0435 \u043f\u0440\u0438 \u0441\u0438\u043b\u044c\u043d\u043e\u0439 \u043d\u0443\u0436\u0434\u0435 \u043d\u0435 \u043f\u043e\u043a\u0438\u043d\u0435\u0442 \u0441\u0432\u043e\u0438\u0445 \u0449\u0435\u043d\u043a\u043e\u0432. \u041e\u0441\u0442\u0430\u043b\u044c\u043d\u044b\u0435 \u0441\u043b\u0443\u0447\u0430\u0438 \u2014\n\u043e\u043f\u0446\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u043e \u043d\u0430 \u0432\u0430\u0448 \u0432\u044b\u0431\u043e\u0440.\n\u041e\u0431\u0449\u0435\u043d\u0438\u0435 \u0441 \u0436\u0438\u0437\u043d\u0435\u0440\u0430\u0434\u043e\u0441\u0442\u043d\u044b\u043c, \u043e\u0431\u043e\u0436\u0430\u044e\u0449\u0438\u043c \u0445\u043e\u0437\u044f\u0438\u043d\u0430 \u0447\u0435\u0442\u0432\u0435\u0440\u043e\u043d\u043e\u0433\u0438\u043c \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c \u043f\u0440\u0438\u043d\u0435\u0441\u0435\u0442 \u043c\u043d\u043e\u0433\u043e\n\u0443\u0434\u043e\u0432\u043e\u043b\u044c\u0441\u0442\u0432\u0438\u044f. \u0427\u0442\u043e\u0431\u044b \u0435\u043c\u0443 \u0431\u044b\u043b\u043e \u0445\u043e\u0440\u043e\u0448\u043e \u0432 \u0432\u0430\u0448\u0435\u043c \u0434\u043e\u043c\u0435 \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u044c\u0442\u0435 \u043a\u043e\u043c\u0444\u043e\u0440\u0442\u043d\u044b\u0435 \u0443\u0441\u043b\u043e\u0432\u0438\u044f \u0434\u043b\u044f \u0435\u0434\u044b,\n\u043e\u0442\u0434\u044b\u0445\u0430, \u0441\u043d\u0430, \u043f\u043e\u0440\u0430\u0434\u0443\u0439\u0442\u0435 \u0438\u0433\u0440\u0443\u0448\u043a\u043e\u0439, \u043d\u0430\u0439\u0434\u0438\u0442\u0435 \u0432\u0440\u0435\u043c\u044f \u0434\u043b\u044f \u0441\u043e\u0432\u043c\u0435\u0441\u0442\u043d\u044b\u0445 \u0438\u0433\u0440 \u0438 \u043f\u0440\u043e\u0433\u0443\u043b\u043e\u043a, \u0438 \u0432\u0430\u0448\n\u043f\u0438\u0442\u043e\u043c\u0435\u0446 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043e\u0442\u0432\u0435\u0442\u0438\u0442 \u0432\u0430\u043c \u0440\u0430\u0434\u043e\u0441\u0442\u043d\u044b\u043c \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d\u0438\u0435\u043c \u0438 \u0431\u0435\u0441\u043a\u043e\u043d\u0435\u0447\u043d\u043e\u0439 \u043f\u0440\u0435\u0434\u0430\u043d\u043d\u043e\u0441\u0442\u044c\u044e.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_DOG_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_DOG_COMMAND_LABEL">RECOMM_FOR_DOG_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83c\udfe1  \u0414\u043e\u043c \u0434\u043b\u044f \u0432\u0437\u0440\u043e\u0441\u043b\u043e\u0439 \u0441\u043e\u0431\u0430\u043a\u0438"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_DOG_INVALID">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_DOG_INVALID">RECOMM_FOR_DOG_INVALID</a></code></div>
<div class="col-last even-row-color"><code>"\u041a \u0431\u043e\u043b\u044c\u0448\u043e\u043c\u0443 \u0441\u043e\u0436\u0430\u043b\u0435\u043d\u0438\u044e \u043c\u044b \u043d\u0435 \u0437\u043d\u0430\u0435\u043c, \u043a\u0430\u043a \u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0438\u0442\u044c \u0434\u043e\u043c \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a \u0441 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u043d\u044b\u043c\u0438\n\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u044f\u043c\u0438. \u041d\u0430\u0434\u0435\u0435\u043c\u0441\u044f, \u0447\u0442\u043e \u044d\u0442\u043e\u0442 \u0431\u043b\u043e\u043a \u043a\u043e\u0433\u0434\u0430-\u0442\u043e \u0434\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0441\u044f \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0430\u0446\u0438\u044f\u043c\u0438\n\u043e\u043f\u044b\u0442\u043d\u044b\u0445 \u043a\u0438\u043d\u043e\u043b\u043e\u0433\u043e\u0432 \u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u043f\u0440\u0438\u0447\u0430\u0441\u0442\u043d\u044b\u0445 \u043a \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u043d\u0438\u044e \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043b\u0438\u0446.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_PET_INVALID_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_PET_INVALID_COMMAND_LABEL">RECOMM_FOR_PET_INVALID_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83c\udfe1  \u0414\u043e\u043c \u0434\u043b\u044f \u043f\u0438\u0442\u043e\u043c\u0446\u0430-\u0438\u043d\u0432\u0430\u043b\u0438\u0434\u0430"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_PUPPY">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_PUPPY">RECOMM_FOR_PUPPY</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u043e\u0441\u043b\u0435 \u0442\u043e\u0433\u043e \u043a\u0430\u043a \u0432\u0441\u0435 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u044b\u0435 \u0432\u043e\u043f\u0440\u043e\u0441\u044b \u0440\u0435\u0448\u0435\u043d\u044b, \u0441\u0430\u043c\u043e\u0435 \u0432\u0440\u0435\u043c\u044f\n\u0441\u043e\u0441\u0442\u0430\u0432\u0438\u0442\u044c \u0441\u043f\u0438\u0441\u043e\u043a \u0432\u0435\u0449\u0435\u0439, \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0445 \u0434\u043b\u044f \u0432\u0430\u0448\u0435\u0433\u043e \u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0440\u0443\u0433\u0430, \u0438\n\u043e\u0442\u043f\u0440\u0430\u0432\u0438\u0442\u044c\u0441\u044f \u0437\u0430 \u043f\u043e\u043a\u0443\u043f\u043a\u0430\u043c\u0438.\n\u0412 \u043f\u0435\u0440\u0432\u0443\u044e \u043e\u0447\u0435\u0440\u0435\u0434\u044c \u0432\u0430\u043c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043a\u0443\u043f\u0438\u0442\u044c \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u0432\u0435\u0449\u0438:\n\n- \u0414\u0432\u0435 \u043c\u0438\u0441\u043a\u0438: \u043e\u0434\u043d\u0443 \u0434\u043b\u044f \u0435\u0434\u044b, \u0432\u0442\u043e\u0440\u0443\u044e \u0434\u043b\u044f \u0432\u043e\u0434\u044b. \u041b\u0443\u0447\u0448\u0435 \u0432\u0441\u0435\u0433\u043e \u043a\u0443\u043f\u0438\u0442\u044c\n\u043a\u0435\u0440\u0430\u043c\u0438\u0447\u0435\u0441\u043a\u0443\u044e \u0438\u043b\u0438 \u0438\u0437 \u043d\u0435\u0440\u0436\u0430\u0432\u0435\u044e\u0449\u0435\u0439 \u0441\u0442\u0430\u043b\u0438 \u2014 \u0438\u0445 \u043f\u0440\u043e\u0449\u0435 \u043e\u0447\u0438\u0449\u0430\u0442\u044c.\n\n- \u041d\u0435\u0439\u043b\u043e\u043d\u043e\u0432\u044b\u0439 \u0438\u043b\u0438 \u043a\u043e\u0436\u0430\u043d\u044b\u0439 \u043f\u043e\u0432\u043e\u0434\u043e\u043a \u0438 \u043e\u0448\u0435\u0439\u043d\u0438\u043a. \u0414\u043b\u044f \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u043d\u0430\u0443\u0447\u0438\u0442\u044c\n\u0432\u0430\u0448\u0443 \u0441\u043e\u0431\u0430\u043a\u0443 \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u043e \u0433\u0443\u043b\u044f\u0442\u044c \u043d\u0430 \u043f\u043e\u0432\u043e\u0434\u043a\u0435 \u0438 \u043d\u0435 \u0442\u044f\u043d\u0443\u0442\u044c \u0435\u0433\u043e \u0438\u0437\u043e \u0432\u0441\u0435\u0439\n\u0441\u0438\u043b\u044b, \u0432\u043f\u043e\u043b\u043d\u0435 \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u043f\u043e\u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f \u043f\u0440\u0438\u043e\u0431\u0440\u0435\u0441\u0442\u0438 \u043c\u044f\u0433\u043a\u0438\u0439 \u043d\u0430\u043c\u043e\u0440\u0434\u043d\u0438\u043a.\n\u042d\u0442\u043e \u043e\u0431\u043b\u0435\u0433\u0447\u0438\u0442 \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u0434\u0440\u0435\u0441\u0441\u0438\u0440\u043e\u0432\u043a\u0438 \u0438 \u043f\u0440\u0438\u0443\u0447\u0435\u043d\u0438\u044f \u043a \u043f\u043e\u0432\u043e\u0434\u043a\u0443 \u0438 \u043d\u0435\n\u043f\u043e\u0437\u0432\u043e\u043b\u0438\u0442 \u0441\u043e\u0431\u0430\u043a\u0435 \u0441\u0431\u0438\u0442\u044c \u0432\u0430\u0441 \u0441 \u043d\u043e\u0433.\n\n- \u041f\u0440\u0438\u043d\u0430\u0434\u043b\u0435\u0436\u043d\u043e\u0441\u0442\u0438 \u0434\u043b\u044f \u0443\u0445\u043e\u0434\u0430 \u0437\u0430 \u0448\u0435\u0440\u0441\u0442\u044c\u044e (\u0433\u0440\u0443\u043c\u0438\u043d\u0433\u0430).\n\n- \u0417\u0430\u0431\u0430\u0432\u043d\u044b\u0435 \u0438 \u0430\u0431\u0441\u043e\u043b\u044e\u0442\u043d\u043e \u0431\u0435\u0437\u043e\u043f\u0430\u0441\u043d\u044b\u0435 \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a\u0438 \u0438\u0433\u0440\u0443\u0448\u043a\u0438, \u0432 \u0442\u043e\u043c \u0447\u0438\u0441\u043b\u0435\n\u0441\u0442\u0438\u043c\u0443\u043b\u0438\u0440\u0443\u044e\u0449\u0438\u0435 \u043d\u0430 \u0434\u0432\u0438\u0433\u0430\u0442\u0435\u043b\u044c\u043d\u0443\u044e \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0441\u0442\u044c.\n\n- \u041b\u0435\u0436\u0430\u043d\u043a\u0443. \u0412 \u043c\u0430\u0433\u0430\u0437\u0438\u043d\u0430\u0445 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d \u043e\u0433\u0440\u043e\u043c\u043d\u044b\u0439 \u0432\u044b\u0431\u043e\u0440 \u043a\u0440\u043e\u0432\u0430\u0442\u043e\u043a \u0434\u043b\u044f\n\u0441\u043e\u0431\u0430\u043a, \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0443 \u0432\u0430\u0441 \u0435\u0441\u0442\u044c \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u044c \u043f\u043e\u0434\u043e\u0431\u0440\u0430\u0442\u044c \u0442\u0443, \u043a\u043e\u0442\u043e\u0440\u0430\u044f \u0438\u0434\u0435\u0430\u043b\u044c\u043d\u043e\n\u043f\u043e\u0434\u0445\u043e\u0434\u0438\u0442 \u043f\u043e \u0440\u0430\u0437\u043c\u0435\u0440\u0443 \u0432\u0430\u0448\u0435\u043c\u0443 \u043b\u044e\u0431\u0438\u043c\u0446\u0443, \u0430 \u0442\u0430\u043a\u0436\u0435 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0435\u0433\u043e\n\u0442\u0435\u043c\u043f\u0435\u0440\u0430\u043c\u0435\u043d\u0442\u0443 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043b\u0435\u0436\u0430\u043d\u043a\u0438 \u043b\u0435\u0433\u0447\u0435 \u043f\u043e\u0440\u0432\u0430\u0442\u044c, \u0447\u0435\u043c \u0434\u0440\u0443\u0433\u0438\u0435).\n\u041a\u0430\u043a\u043e\u0439 \u0431\u044b \u0442\u0438\u043f \u043a\u0440\u043e\u0432\u0430\u0442\u043a\u0438 \u0432\u044b \u043d\u0438 \u0432\u044b\u0431\u0440\u0430\u043b\u0438, \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u0435 \u0435\u0435 \u0432 \u0442\u0438\u0445\u043e\u043c \u0438 \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u043e\u043c\n\u043c\u0435\u0441\u0442\u0435 \u0432\u0430\u0448\u0435\u0433\u043e \u0434\u043e\u043c\u0430, \u043f\u043e\u0434\u0430\u043b\u044c\u0448\u0435 \u043e\u0442 \u0448\u0443\u043c\u0430 \u0438 \u0441\u043a\u0432\u043e\u0437\u043d\u044f\u043a\u043e\u0432.\n\n- \u0414\u043e\u043c\u0430\u0448\u043d\u0438\u0439 \u0432\u043e\u043b\u044c\u0435\u0440 \u0438\u0437 \u0441\u0435\u0442\u043a\u0438 \u0438\u043b\u0438 \u043a\u043e\u0440\u043e\u0431\u043a\u0443. \u041f\u043e\u043c\u043d\u0438\u0442\u0435: \u0449\u0435\u043d\u043a\u0430\u043c \u043e\u0447\u0435\u043d\u044c \u043d\u0440\u0430\u0432\u044f\u0442\u0441\u044f\n\u0432\u0441\u0435\u0432\u043e\u0437\u043c\u043e\u0436\u043d\u044b\u0435 \u043a\u043e\u0440\u0437\u0438\u043d\u044b \u0438 \u044f\u0449\u0438\u043a\u0438, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043e\u043d\u0438 \u043c\u043e\u0433\u0443\u0442 \u043f\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u0442\u044c \u0432 \u0441\u0432\u043e\u0439\n\u0441\u043e\u0431\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043d\u0435\u043f\u0440\u0438\u0441\u0442\u0443\u043f\u043d\u044b\u0439 \u0437\u0430\u043c\u043e\u043a. \u0415\u0441\u043b\u0438 \u0432\u044b \u043d\u0430\u043a\u0440\u043e\u0435\u0442\u0435 \u043a\u043e\u0440\u043e\u0431\u043a\u0443 \u043e\u0434\u0435\u044f\u043b\u043e\u043c \u0438\n\u043f\u043e\u043b\u043e\u0436\u0438\u0442\u0435 \u0432 \u043d\u0435\u0435 \u043b\u0435\u0436\u0430\u043d\u043a\u0443, \u0442\u043e \u044d\u0442\u043e \u0441\u043e\u043e\u0440\u0443\u0436\u0435\u043d\u0438\u0435 \u0441\u0442\u0430\u043d\u0435\u0442 \u0441\u0430\u043c\u044b\u043c \u043d\u0430\u0441\u0442\u043e\u044f\u0449\u0438\u043c\n\u043b\u043e\u0433\u043e\u0432\u043e\u043c \u0434\u043b\u044f \u0432\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430, \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u043c \u043e\u043d \u0441\u043c\u043e\u0436\u0435\u0442 \u0441\u043f\u0440\u044f\u0442\u0430\u0442\u044c\u0441\u044f \u0438 \u043e\u0442\u0434\u043e\u0445\u043d\u0443\u0442\u044c,\n\u0435\u0441\u043b\u0438 \u0435\u043c\u0443 \u0437\u0430\u0445\u043e\u0447\u0435\u0442\u0441\u044f \u0442\u0438\u0448\u0438\u043d\u044b \u0438 \u043f\u043e\u043a\u043e\u044f. \u041a\u0440\u043e\u043c\u0435 \u0442\u043e\u0433\u043e, \u043e\u0431\u0443\u0441\u0442\u0440\u043e\u0439\u0441\u0442\u0432\u043e \u043f\u043e\u0434\u043e\u0431\u043d\u044b\u0445\n\u044f\u0449\u0438\u043a\u043e\u0432 \u0438 \u043a\u043e\u0440\u043e\u0431\u043e\u043a \u043d\u0435\u043f\u0440\u0435\u043c\u0435\u043d\u043d\u043e \u043f\u043e\u043c\u043e\u0436\u0435\u0442 \u0432\u0430\u043c \u0443\u0441\u043a\u043e\u0440\u0438\u0442\u044c \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u043e\u0431\u0443\u0447\u0435\u043d\u0438\u044f \u0432\u0430\u0448\u0435\u0433\u043e\n\u0447\u0435\u0442\u0432\u0435\u0440\u043e\u043d\u043e\u0433\u043e\u0433\u043e \u0434\u0440\u0443\u0433\u0430, \u0442\u0430\u043a \u043a\u0430\u043a \u0449\u0435\u043d\u043a\u0438 \u043d\u0435 \u043b\u044e\u0431\u044f\u0442, \u0447\u0442\u043e\u0431\u044b \u0438\u0445 \u043f\u043e\u0442\u0430\u0435\u043d\u043d\u043e\u0435 \u043b\u043e\u0433\u043e\u0432\u043e\n\u0431\u044b\u043b\u043e \u0433\u0440\u044f\u0437\u043d\u044b\u043c, \u0430 \u0437\u043d\u0430\u0447\u0438\u0442, \u043e\u043d\u0438 \u0431\u044b\u0441\u0442\u0440\u0435\u0435 \u043d\u0430\u0443\u0447\u0430\u0442\u0441\u044f \u0441\u043e\u0431\u043b\u044e\u0434\u0430\u0442\u044c \u0447\u0438\u0441\u0442\u043e\u0442\u0443 \u043d\u0435 \u0442\u043e\u043b\u044c\u043a\u043e\n\u0432 \u0441\u0432\u043e\u0435\u043c \u0443\u043a\u0440\u044b\u0442\u0438\u0438, \u043d\u043e \u0438 \u0432\u043e \u0432\u0441\u0435\u043c \u0434\u043e\u043c\u0435.\n\n- \u041a\u043e\u0440\u043c. \u0423\u0437\u043d\u0430\u0439\u0442\u0435 \u0443 \u0437\u0430\u0432\u043e\u0434\u0447\u0438\u043a\u0430 \u0438\u043b\u0438 \u0432 \u0441\u043e\u0431\u0430\u0447\u044c\u0435\u043c \u043f\u0440\u0438\u044e\u0442\u0435, \u0447\u0435\u043c \u0432\u0430\u0448 \u0449\u0435\u043d\u043e\u043a \u043f\u0438\u0442\u0430\u043b\u0441\u044f\n\u0440\u0430\u043d\u0435\u0435, \u0438 \u043f\u043e\u0441\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044c \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0442\u044c \u0434\u0430\u043d\u043d\u044b\u0439 \u0440\u0430\u0446\u0438\u043e\u043d \u043a\u0430\u043a \u043c\u0438\u043d\u0438\u043c\u0443\u043c \u043d\u0430 \u043f\u0440\u043e\u0442\u044f\u0436\u0435\u043d\u0438\u0438\n\u043d\u0435\u0434\u0435\u043b\u0438. \u0421\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0435\u043c \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u0435\u0440\u0435\u0432\u0435\u0441\u0442\u0438 \u0435\u0433\u043e \u043d\u0430 \u043d\u043e\u0432\u044b\u0439 \u0440\u0430\u0446\u0438\u043e\u043d, \u0435\u0441\u043b\u0438 \u043d\u0430 \u0442\u043e\n\u0435\u0441\u0442\u044c \u0432\u0435\u0441\u043a\u0438\u0435 \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u0438\u044f.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMM_FOR_PUPPY_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMM_FOR_PUPPY_COMMAND_LABEL">RECOMM_FOR_PUPPY_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83c\udfe1  \u0414\u043e\u043c \u0434\u043b\u044f \u0449\u0435\u043d\u043a\u0430"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMMENDED_CYNOLOGIST">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMMENDED_CYNOLOGIST">RECOMMENDED_CYNOLOGIST</a></code></div>
<div class="col-last even-row-color"><code>"\u0415\u0441\u043b\u0438 \u0412\u0430\u043c \u043f\u043e\u043d\u0430\u0434\u043e\u0431\u0438\u0442\u0441\u044f \u043e\u043f\u044b\u0442\u043d\u044b\u0439 \u043a\u0438\u043d\u043e\u043b\u043e\u0433, \u043c\u044b \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u0435\u043c \u043e\u0431\u0440\u0430\u0442\u0438\u0442\u044c\u0441\u044f \u043a \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c\n\u0441\u043f\u0435\u0446\u0438\u0430\u043b\u0438\u0441\u0442\u0430\u043c:\n\n- \u0421\u0432\u0435\u0442\u043b\u0430\u043d\u0430 \u0427\u0435\u0440\u043d\u043e\u0431\u0430\u0435\u0432\u0430\n\n\u041e \u0441\u0435\u0431\u0435\n\u042f \u0440\u0430\u0431\u043e\u0442\u0430\u044e \u043a\u0438\u043d\u043e\u043b\u043e\u0433\u043e\u043c 6 \u043b\u0435\u0442, \u043e\u0447\u0435\u043d\u044c \u043b\u044e\u0431\u043b\u044e \u0441\u043e\u0431\u0430\u043a. \u041e\u0441\u043e\u0431\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043c\u043e\u0435\u0439 \u0440\u0430\u0431\u043e\u0442\u044b \u0432 \u0442\u043e\u043c \u0447\u0442\u043e,\n\u044f \u043f\u043e\u0434\u0445\u043e\u0436\u0443 \u043a \u043a\u0430\u0436\u0434\u043e\u043c\u0443 \u043a\u043b\u0438\u0435\u043d\u0442\u0443 \u0438\u043d\u0434\u0438\u0432\u0438\u0434\u0443\u0430\u043b\u044c\u043d\u043e. \u042f \u0432\u0441\u0435\u0433\u0434\u0430 \u0441\u0442\u0440\u0435\u043c\u043b\u044e\u0441\u044c \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442\n\u043e\u0442 \u0441\u0432\u043e\u0435\u0439 \u0440\u0430\u0431\u043e\u0442\u044b, \u0432\u0441\u0435\u0433\u0434\u0430 \u0433\u043e\u0442\u043e\u0432\u0430 \u043a \u043b\u044e\u0431\u044b\u043c \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f\u043c \u0438 \u043d\u0438\u043a\u043e\u0433\u0434\u0430 \u043d\u0435 \u043e\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u044e\u0441\u044c \u043d\u0430\n\u0434\u043e\u0441\u0442\u0438\u0433\u043d\u0443\u0442\u043e\u043c.\n\n\u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435\n\u0426\u0435\u043d\u0442\u0440 \u0441\u043b\u0443\u0436\u0435\u0431\u043d\u043e\u0433\u043e \u0441\u043e\u0431\u0430\u043a\u043e\u0432\u043e\u0434\u0441\u0442\u0432\u0430 \u00ab\u0414\u041e\u0421\u0410\u0410\u0424\u00bb, \u0438\u043d\u0441\u0442\u0440\u0443\u043a\u0442\u043e\u0440-\u0434\u0440\u0435\u0441\u0441\u0438\u0440\u043e\u0432\u0449\u0438\u043a \u0441\u043b\u0443\u0436\u0435\u0431\u043d\u044b\u0445 \u0441\u043e\u0431\u0430\u043a\n\n\u041e\u043f\u044b\u0442\n\u0426\u0435\u043d\u0442\u0440 \u0441\u043b\u0443\u0436\u0435\u0431\u043d\u043e\u0433\u043e \u0441\u043e\u0431\u0430\u043a\u043e\u0432\u043e\u0434\u0441\u0442\u0432\u0430 \u00ab\u0414\u041e\u0421\u0410\u0410\u0424\u00bb, \u0438\u043d\u0441\u0442\u0440\u0443\u043a\u0442\u043e\u0440-\u0434\u0440\u0435\u0441\u0441\u0438\u0440\u043e\u0432\u0449\u0438\u043a\n\n\u0421\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 \u043f\u043e\u0440\u0442\u0444\u043e\u043b\u0438\u043e: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&amp;tabName=PROFILES&amp;profileId=ChernobayevaSS&amp;profileTabName=reviews\n\n___________\n\n- \u042d\u043b\u044c\u0432\u0438\u0440\u0430 \u0410\u043b\u044c\u043c\u0443\u0445\u0430\u043c\u0435\u0434\u043e\u0432\u0430\n\n\u041e \u0441\u0435\u0431\u0435\n\u041f\u0440\u043e\u0444\u0435\u0441\u0441\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u0430 \u0414\u0440\u0435\u0441\u0441\u0438\u0440\u043e\u0432\u043a\u0430 \u0441\u043e\u0431\u0430\u043a\n\u041e\u0431\u043e\u0440\u0443\u0434\u043e\u0432\u0430\u043d\u043d\u044b\u0439 \u043a\u0438\u043d\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0446\u0435\u043d\u0442\u0440 \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a \u043b\u044e\u0431\u043e\u0439 \u043f\u043e\u0440\u043e\u0434\u044b \u0438 \u0432\u043e\u0437\u0440\u0430\u0441\u0442\u0430\n\u0421\u0434\u0430\u0447\u0430 \u044d\u043a\u0437\u0430\u043c\u0435\u043d\u043e\u0432, \u043f\u043e\u043a\u0430\u0437 \u043d\u0430 \u0432\u044b\u0441\u0442\u0430\u0432\u043a\u0430\u0445\n\n\u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435\n\u0421\u043e\u044e\u0437 \u041a\u0438\u043d\u043e\u043b\u043e\u0433\u043e\u0432 \u041a\u0430\u0437\u0430\u0445\u0441\u0442\u0430\u043d\u0430\n\n\u041e\u043f\u044b\u0442\n\u041a\u0438\u043d\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0446\u0435\u043d\u0442\u0440 \u00ab\u0410\u043b\u0442\u044b\u043d \u0438\u0442\u00bb\n\n\u0421\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 \u043f\u043e\u0440\u0442\u0444\u043e\u043b\u0438\u043e: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&amp;tabName=PROFILES&amp;profileId=AlmukhamedovaEA&amp;profileTabName=reviews\n\n___________\n\n- \u041a\u043e\u0440\u043e\u0432\u043d\u0438\u043a\u043e\u0432\u0430 \u0410\u043d\u0430\u0441\u0442\u0430\u0441\u0438\u044f\n\n\u041e \u0441\u0435\u0431\u0435\n\u0418\u043c\u0435\u044e \u043e\u0433\u0440\u043e\u043c\u043d\u044b\u0439 \u043e\u043f\u044b\u0442 \u0441 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c\u0438, \u0432 \u043e\u0441\u043e\u0431\u0435\u043d\u043d\u043e\u0441\u0442\u0438 \u0441 \u0441\u043e\u0431\u0430\u043a\u0430\u043c\u0438. \u0412\u0441\u0435\u0433\u0434\u0430 \u0443\u0447\u0438\u0442\u044b\u0432\u0430\u044e\n\u043f\u043e\u0436\u0435\u043b\u0430\u043d\u0438\u044f \u043a\u043b\u0438\u0435\u043d\u0442\u0430 \u0438 \u0432\u044b\u043f\u043e\u043b\u043d\u044f\u044e \u043f\u043e\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u043d\u0443\u044e \u0437\u0430\u0434\u0430\u0447\u0443 \u043f\u043e \u043c\u0430\u043a\u0441\u0438\u043c\u0443\u043c\u0443. \u0422\u0430\u043a\u0436\u0435\n\u0437\u0430\u043d\u0438\u043c\u0430\u044e\u0441\u044c \u043f\u0435\u0440\u0435\u0434\u0435\u0440\u0436\u043a\u043e\u0439 \u0441\u043e\u0431\u0430\u043a\n\n\u041e\u043f\u044b\u0442\n\u041a\u0438\u043d\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0446\u0435\u043d\u0442\u0440 \u00ab\u0410\u043b\u0442\u044b\u043d \u0438\u0442\u00bb\n\n\u0421\u0441\u044b\u043b\u043a\u0430 \u043d\u0430 \u043f\u043e\u0440\u0442\u0444\u043e\u043b\u0438\u043e: https://profi.kz/veterinar/kinologia/srochno/?seamless=1&amp;tabName=PROFILES&amp;profileId=AnastasiyaKY3&amp;profileTabName=reviews\n\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.RECOMMENDED_CYNOLOGIST_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#RECOMMENDED_CYNOLOGIST_COMMAND_LABEL">RECOMMENDED_CYNOLOGIST_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83c\udfc5  \u041b\u0443\u0447\u0448\u0438\u0435 \u043a\u0438\u043d\u043e\u043b\u043e\u0433\u0438"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.DogConstants.SHIPPING_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/DogConstants.html#SHIPPING_COMMAND_LABEL">SHIPPING_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udefb  \u0422\u0440\u0430\u043d\u0441\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u043a\u0430 \u043f\u0438\u0442\u043e\u043c\u0446\u0430"</code></div>
</div>
</li>
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.constants.<a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html" title="class in pro.sky.JD2AnimalShelterBot.constants">MainMenuConstants</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.CALL_VOLUNTEER_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#CALL_VOLUNTEER_COMMAND_LABEL">CALL_VOLUNTEER_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83e\uddd1\u200d\ud83c\udf3e\ufe0f \u041f\u043e\u0437\u0432\u0430\u0442\u044c \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0430"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.CAR_PASS_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#CAR_PASS_COMMAND_LABEL">CAR_PASS_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udd16 \u041f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u043f\u0440\u043e\u043f\u0443\u0441\u043a \u0434\u043b\u044f \u0430\u0432\u0442\u043e"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.CHOOSE_SHELTER">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#CHOOSE_SHELTER">CHOOSE_SHELTER</a></code></div>
<div class="col-last even-row-color"><code>"/choose_a_shelter"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.CONTACT_DATA_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#CONTACT_DATA_COMMAND_LABEL">CONTACT_DATA_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udcde \u041e\u0441\u0442\u0430\u0432\u0438\u0442\u044c \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u043d\u044b\u0435 \u0434\u0430\u043d\u043d\u044b\u0435"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.INFORMATION_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#INFORMATION_COMMAND_LABEL">INFORMATION_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\u2753 \u0423\u0437\u043d\u0430\u0442\u044c \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044e \u043e \u043f\u0440\u0438\u044e\u0442\u0435"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.MAIN_MENU">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#MAIN_MENU">MAIN_MENU</a></code></div>
<div class="col-last odd-row-color"><code>"\u0412\u0435\u0440\u043d\u0443\u0442\u044c\u0441\u044f \u0432 \u043e\u0441\u043d\u043e\u0432\u043d\u043e\u0435 \u043c\u0435\u043d\u044e"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.MAIN_MENU_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#MAIN_MENU_LABEL">MAIN_MENU_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udd1d \u041e\u0441\u043d\u043e\u0432\u043d\u043e\u0435 \u043c\u0435\u043d\u044e"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.MENU_COMMAND_SELECTION">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#MENU_COMMAND_SELECTION">MENU_COMMAND_SELECTION</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u0440\u0438\u0432\u0435\u0442, \u0432\u044b\u0431\u0435\u0440\u0438 \u043a\u043e\u043c\u0430\u043d\u0434\u0443 \u0438\u0437 \u043c\u0435\u043d\u044e \u2b07"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.SAFETY_PRECAUTIONS_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#SAFETY_PRECAUTIONS_LABEL">SAFETY_PRECAUTIONS_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udcdb \u0422\u0435\u0445\u043d\u0438\u043a\u0430 \u0431\u0435\u0437\u043e\u043f\u0430\u0441\u043d\u043e\u0441\u0442\u0438"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.SEND_REPORT_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#SEND_REPORT_COMMAND_LABEL">SEND_REPORT_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\uddd3 \u041f\u0440\u0438\u0441\u043b\u0430\u0442\u044c \u043e\u0442\u0447\u0435\u0442 \u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0435"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.START_COMAND">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#START_COMAND">START_COMAND</a></code></div>
<div class="col-last even-row-color"><code>"/start"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.START_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#START_COMMAND_LABEL">START_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\u0414\u043e\u043c\u043e\u0439 \ud83c\udfe1"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.MainMenuConstants.TAKE_PET_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/MainMenuConstants.html#TAKE_PET_COMMAND_LABEL">TAKE_PET_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udc36 \ud83d\udc31\ufe0f \u041a\u0430\u043a \u0432\u0437\u044f\u0442\u044c \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430"</code></div>
</div>
</li>
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.constants.<a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html" title="class in pro.sky.JD2AnimalShelterBot.constants">ShelterConstants</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.CAT_SAFETY_RULES">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#CAT_SAFETY_RULES">CAT_SAFETY_RULES</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u0420\u0410\u0412\u0418\u041b\u0410 \u041f\u041e\u0412\u0415\u0414\u0415\u041d\u0418\u042f \u041d\u0410 \u0422\u0415\u0420\u0420\u0418\u0422\u041e\u0420\u0418\u0418 \u041f\u0420\u0418\u042e\u0422\u0410:\n\u041d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u041f\u0440\u0438\u044e\u0442\u0430 \u0434\u043b\u044f \u0432\u0441\u0435\u0445 \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u0435\u043b\u0435\u0439 \u0434\u0435\u0439\u0441\u0442\u0432\u0443\u044e\u0442 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0438 \u0440\u0430\u0441\u043f\u043e\u0440\u044f\u0434\u043e\u043a, \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043d\u044b\u0435 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0435\u0439 \u041f\u0440\u0438\u044e\u0442\u0430.\n\u041f\u0440\u0438 \u043f\u043e\u0441\u0435\u0449\u0435\u043d\u0438\u0438 \u041f\u0440\u0438\u044e\u0442\u0430 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0438\u043c\u0435\u0442\u044c \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u0443\u0434\u043e\u0441\u0442\u043e\u0432\u0435\u0440\u044f\u044e\u0449\u0438\u0439 \u043b\u0438\u0447\u043d\u043e\u0441\u0442\u044c \u0438\u043b\u0438 \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u044b\u0439 \u043f\u0440\u043e\u043f\u0443\u0441\u043a, \u0434\u043b\u044f \u0434\u0435\u0442\u0435\u0439\n- \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442 \u043f\u043e\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u044e\u0449\u0438\u0439 \u0432\u043e\u0437\u0440\u0430\u0441\u0442. \u0414\u0435\u0442\u0438 \u0434\u043e 16 \u043b\u0435\u0442 \u0431\u0435\u0437 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0436\u0434\u0435\u043d\u0438\u044f \u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445 (\u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0435\u0439, \u043e\u043f\u0435\u043a\u0443\u043d\u043e\u0432,\n\u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u0435\u0439 \u0441 \u043f\u0440\u0435\u0434\u044a\u044f\u0432\u043b\u0435\u043d\u043d\u043e\u0439 \u0440\u0443\u043a\u043e\u043f\u0438\u0441\u043d\u043e\u0439 \u0434\u043e\u0432\u0435\u0440\u0435\u043d\u043d\u043e\u0441\u0442\u044c\u044e) \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u044e \u043f\u0440\u0438\u044e\u0442\u0430 \u043d\u0435 \u0434\u043e\u043f\u0443\u0441\u043a\u0430\u044e\u0442\u0441\u044f.\n\u0412\u0441\u044f \u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u0437\u0430 \u043d\u0435\u0441\u043e\u0432\u0435\u0440\u0448\u0435\u043d\u043d\u043e\u043b\u0435\u0442\u043d\u0438\u0445 \u0434\u0435\u0442\u0435\u0439, \u043d\u0430\u0445\u043e\u0434\u044f\u0449\u0438\u0445\u0441\u044f \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u043f\u0440\u0438\u044e\u0442\u0430, \u0432\u043e\u0437\u043b\u0430\u0433\u0430\u0435\u0442\u0441\u044f \u043d\u0430\n\u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0435\u0439 (\u043e\u043f\u0435\u043a\u0443\u043d\u043e\u0432, \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u0435\u0439 \u0441 \u043f\u0440\u0435\u0434\u044a\u044f\u0432\u043b\u0435\u043d\u043d\u043e\u0439 \u0440\u0443\u043a\u043e\u043f\u0438\u0441\u043d\u043e\u0439 \u0434\u043e\u0432\u0435\u0440\u0435\u043d\u043d\u043e\u0441\u0442\u044c\u044e).\n\u0412 \u043f\u0440\u0438\u044e\u0442 \u043d\u0435 \u0434\u043e\u043f\u0443\u0441\u043a\u0430\u044e\u0442\u0441\u044f:\n\u0434\u0435\u0442\u0438 \u0434\u043e 16 \u043b\u0435\u0442 \u0431\u0435\u0437 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0436\u0434\u0435\u043d\u0438\u044f \u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445 (\u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0435\u0439, \u043e\u043f\u0435\u043a\u0443\u043d\u043e\u0432, \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u0435\u0439 \u0441 \u043f\u0440\u0435\u0434\u044a\u044f\u0432\u043b\u0435\u043d\u043d\u043e\u0439\n\u0440\u0443\u043a\u043e\u043f\u0438\u0441\u043d\u043e\u0439 \u0434\u043e\u0432\u0435\u0440\u0435\u043d\u043d\u043e\u0441\u0442\u044c\u044e);\n\u043b\u0438\u0446\u0430 \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0430\u043b\u043a\u043e\u0433\u043e\u043b\u044c\u043d\u043e\u0433\u043e \u0438\u043b\u0438 \u043d\u0430\u0440\u043a\u043e\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0433\u043e \u043e\u043f\u044c\u044f\u043d\u0435\u043d\u0438\u044f;\n\u043b\u0438\u0446\u0430 \u0432 \u0430\u0433\u0440\u0435\u0441\u0441\u0438\u0432\u043d\u043e\u043c \u0438\u043b\u0438 \u043d\u0435\u0430\u0434\u0435\u043a\u0432\u0430\u0442\u043d\u043e\u043c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438.\n\u041f\u0435\u0440\u0435\u0434\u0430\u0447\u0430 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u043e\u043c \u041f\u0440\u0438\u044e\u0442\u0430 \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u0435\u043b\u044e \u0434\u043b\u044f \u0432\u044b\u0433\u0443\u043b\u0430 \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043d\u0430 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e \u043e\u0442\u0432\u0435\u0434\u0435\u043d\u043d\u043e\u0439 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438.\n\u0432\u044b\u0434\u0430\u0447\u0430 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u0430\u043c\u0438 \u041f\u0440\u0438\u044e\u0442\u0430 \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u0435\u043b\u044f\u043c \u043e\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0432 \u043f\u043e\u0440\u044f\u0434\u043a\u0435 \u0436\u0438\u0432\u043e\u0439 \u043e\u0447\u0435\u0440\u0435\u0434\u0438;\n\u0432\u0440\u0435\u043c\u044f \u0432\u044b\u0434\u0430\u0447\u0438 \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u0430\u043c\u0438 \u041f\u0440\u0438\u044e\u0442\u0430 \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u0435\u043b\u044f\u043c \u0434\u043b\u044f \u0432\u044b\u0433\u0443\u043b\u0430 \u043d\u0435 \u0434\u043e\u043b\u0436\u043d\u043e \u043f\u0440\u0435\u0432\u044b\u0448\u0430\u0442\u044c 25 \u043c\u0438\u043d\u0443\u0442.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.CAT_SCHEDULE_ADDRESS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#CAT_SCHEDULE_ADDRESS">CAT_SCHEDULE_ADDRESS</a></code></div>
<div class="col-last odd-row-color"><code>"\u041d\u0430\u0448 \u0430\u0434\u0440\u0435\u0441:\n\u043f\u0440\u043e\u0441\u043f. \u0410\u0431\u0430\u044f, 40,\n\u041d\u0443\u0440-\u0421\u0443\u043b\u0442\u0430\u043d (\u0410\u0441\u0442\u0430\u043d\u0430)\n\u0415\u0436\u0435\u0434\u043d\u0435\u0432\u043d\u043e \u0441 10:00 \u0434\u043e 17:00\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.CAT_SHELTER_INFO">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#CAT_SHELTER_INFO">CAT_SHELTER_INFO</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u0440\u0438\u044e\u0442 \u0434\u043b\u044f \u043a\u043e\u0448\u0435\u043a \u00ab\u041d\u043e\u0432\u044b\u0439 \u0434\u043e\u043c\u00bb \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u0410\u0441\u0442\u0430\u043d\u0435 \u0443\u0436\u0435 \u0431\u043e\u043b\u0435\u0435 6 \u043b\u0435\u0442. \u0412 \u0441\u0442\u0435\u043d\u0430\u0445 \u043f\u0440\u0438\u044e\u0442\u0430 \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0442\u0441\u044f \u0431\u0440\u043e\u0448\u0435\u043d\u043d\u044b\u0435,\n\u043e\u043a\u0430\u0437\u0430\u0432\u0448\u0438\u0435\u0441\u044f \u043d\u0430 \u0443\u043b\u0438\u0446\u0435 \u0438 \u043f\u0440\u043e\u0441\u0442\u043e \u043d\u0438\u043a\u043e\u043c\u0443 \u043d\u0435 \u043d\u0443\u0436\u043d\u044b\u0435 \u043a\u043e\u0448\u043a\u0438, \u043a\u043e\u0442\u044b \u0438 \u043a\u043e\u0442\u044f\u0442\u0430.\n\u0412 \u043f\u0440\u0438\u044e\u0442\u0435 \u043f\u0440\u043e\u0436\u0438\u0432\u0430\u044e\u0442 \u0431\u043e\u043b\u0435\u0435 100 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445, \u0441 \u0440\u0430\u0437\u043d\u043e\u0439 \u0441\u0443\u0434\u044c\u0431\u043e\u0439 \u0438 \u0440\u0430\u0437\u043d\u043e\u0433\u043e \u0432\u043e\u0437\u0440\u0430\u0441\u0442\u0430. \u0411\u043e\u043b\u044c\u0448\u0438\u043d\u0441\u0442\u0432\u043e \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u043e\u0442\u0434\u0430\u043d\u044b\n\u0434\u043e\u0431\u0440\u044b\u043c\u0438 \u043b\u044e\u0434\u044c\u043c\u0438 \u0438\u043b\u0438 \u0431\u044b\u0432\u0448\u0438\u043c\u0438 \u0445\u043e\u0437\u044f\u0435\u0432\u0430\u043c\u0438. \u0423 \u043a\u0430\u0436\u0434\u043e\u0439 \u043a\u043e\u0448\u043a\u0438 \u0441\u0432\u043e\u0439 \u0445\u0430\u0440\u0430\u043a\u0442\u0435\u0440 \u2014 \u043a\u0442\u043e-\u0442\u043e \u043b\u0430\u0441\u043a\u043e\u0432\u044b\u0439, \u043a\u0442\u043e-\u0442\u043e \u043f\u0443\u0433\u043b\u0438\u0432\u044b\u0439,\n\u0438\u0433\u0440\u0438\u0432\u044b\u0439 \u0438\u043b\u0438 \u0441\u0442\u0435\u0441\u043d\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439, \u0433\u0440\u0443\u0441\u0442\u043d\u044b\u0439, \u0441\u0432\u043e\u0435\u043d\u0440\u0430\u0432\u043d\u044b\u0439 \u0438\u043b\u0438 \u0432\u0435\u0441\u0435\u043b\u044b\u0439. \u0412 \u043f\u0440\u0438\u044e\u0442 \u043f\u043e\u043f\u0430\u0434\u0430\u044e\u0442 \u0438 \u043e\u0431\u044b\u0447\u043d\u044b\u0435 \u043f\u043e\u043b\u043e\u0441\u0430\u0442\u0438\u043a\u0438\n\u0438 \u043f\u043e\u0440\u043e\u0434\u0438\u0441\u0442\u044b\u0435 \u0448\u043e\u0442\u043b\u0430\u043d\u0434\u0446\u044b, \u043a\u0430\u0436\u0434\u0430\u044f \u043a\u043e\u0448\u043a\u0430 \u043a\u0440\u0430\u0441\u0438\u0432\u0430 \u043f\u043e-\u0441\u0432\u043e\u0435\u043c\u0443.\n\u041d\u0430\u0448\u0430 \u043a\u043e\u043c\u0430\u043d\u0434\u0430 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u043e\u0432 \u0441\u0442\u0430\u0440\u0430\u0435\u0442\u0441\u044f \u0441\u0434\u0435\u043b\u0430\u0442\u044c \u0432\u0441\u0451 \u043e\u0442 \u043d\u0438\u0445 \u0437\u0430\u0432\u0438\u0441\u044f\u0449\u0435\u0435, \u0447\u0442\u043e\u0431\u044b \u0432\u0441\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u044b \u0447\u0443\u0432\u0441\u0442\u0432\u043e\u0432\u0430\u043b\u0438 \u0432 \u0441\u0442\u0435\u043d\u0430\u0445\n\u043f\u0440\u0438\u044e\u0442\u0430 \u0443\u044e\u0442 \u0438 \u0445\u043e\u0442\u044c \u043c\u0430\u043b\u0443\u044e \u0447\u0430\u0441\u0442\u0438\u0447\u043a\u0443 \u0434\u043e\u043c\u0430. \u041e\u0434\u043d\u0430\u043a\u043e \u043c\u044b \u043d\u0435 \u043c\u043e\u0436\u0435\u043c \u0437\u0430\u043c\u0435\u043d\u0438\u0442\u044c \u0438\u043c \u0434\u043e\u043c \u0438 \u0437\u0430\u0431\u043e\u0442\u043b\u0438\u0432\u044b\u0445 \u0445\u043e\u0437\u044f\u0435\u0432 \u0432 \u043f\u043e\u043b\u043d\u043e\u0439\n\u043c\u0435\u0440\u0435. \u041a \u0441\u043e\u0436\u0430\u043b\u0435\u043d\u0438\u044e, \u043c\u043d\u043e\u0433\u0438\u0435 \u043b\u044e\u0434\u0438 \u0431\u043e\u044f\u0442\u0441\u044f \u0431\u0440\u0430\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430, \u0434\u0443\u043c\u0430\u044f, \u0447\u0442\u043e \u0442\u0443\u0442 \u0432\u0441\u0435 \u0431\u043e\u043b\u044c\u043d\u044b\u0435 \u0438\u043b\u0438 \u0447\u0435\u043c-\u0442\u043e\n\u0445\u0443\u0436\u0435 \u0434\u0440\u0443\u0433\u0438\u0445, \u043d\u043e \u043d\u0430 \u0441\u0430\u043c\u043e\u043c \u0434\u0435\u043b\u0435 \u0432\u0441\u0435 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u044b \u043d\u0435 \u0432 \u043a\u043e\u0448\u043a\u0430\u0445, \u0430 \u0432 \u043b\u044e\u0434\u044f\u0445, \u0447\u0442\u043e \u043f\u043b\u043e\u0445\u043e \u043a \u043d\u0438\u043c \u043e\u0442\u043d\u043e\u0441\u0438\u043b\u0438\u0441\u044c \u0434\u043e \u043f\u0440\u0438\u044e\u0442\u0430.\n\u0412\u044b \u0436\u0435 \u043c\u043e\u0436\u0435\u0442\u0435 \u0441\u043f\u0430\u0441\u0442\u0438 \u0445\u043e\u0442\u044f \u0431\u044b \u043e\u0434\u043d\u0443 \u043a\u043e\u0448\u0430\u0447\u044c\u044e \u0436\u0438\u0437\u043d\u044c, \u043f\u043e\u0434\u0430\u0440\u0438\u0442\u044c \u0436\u0438\u0432\u043e\u043c\u0443 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443 \u0442\u0451\u043f\u043b\u044b\u0439 \u0434\u043e\u043c, \u043b\u044e\u0431\u043e\u0432\u044c \u0438 \u043b\u0430\u0441\u043a\u0443!\n\u041f\u043e\u043a\u0430 \u043e\u043d\u0438 \u0436\u0438\u0432\u0443\u0442 \u0432 \u043f\u0440\u0438\u044e\u0442\u0435, \u043c\u044b \u0438\u0445 \u0435\u0434\u0438\u043d\u0441\u0442\u0432\u0435\u043d\u043d\u0430\u044f \u043d\u0430\u0434\u0435\u0436\u0434\u0430! \u0412\u0441\u0435 \u043a\u043e\u0448\u043a\u0438, \u0447\u0442\u043e \u0436\u0438\u0432\u0443\u0442 \u0432 \u043f\u0440\u0438\u044e\u0442\u0435, \u043e\u043a\u0430\u0437\u0430\u043b\u0438\u0441\u044c \u043d\u0430 \u0443\u043b\u0438\u0446\u0435\n\u043d\u0435 \u043f\u043e \u0441\u0432\u043e\u0435\u0439 \u0432\u043e\u043b\u0435. \u041a\u0440\u043e\u043c\u0435 \u043d\u0430\u0441 \u0441 \u0432\u0430\u043c\u0438 \u0438\u043c \u043d\u0438\u043a\u0442\u043e \u043d\u0435 \u043f\u043e\u043c\u043e\u0436\u0435\u0442. \u0415\u0441\u043b\u0438 \u0431\u044b \u043e\u043d\u0438 \u0443\u043c\u0435\u043b\u0438 \u0433\u043e\u0432\u043e\u0440\u0438\u0442\u044c, \u0442\u043e \u043d\u0430\u0432\u0435\u0440\u043d\u044f\u043a\u0430 \u0431\u044b\n\u0441\u043a\u0430\u0437\u0430\u043b\u0438, \u0447\u0442\u043e \u0438\u043c \u0442\u043e\u0436\u0435 \u0445\u043e\u0447\u0435\u0442\u0441\u044f \u0436\u0438\u0442\u044c \u0432 \u0442\u0435\u043f\u043b\u0435 \u0438 \u0437\u0430\u0431\u043e\u0442\u0435.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.CONTACT_DATA">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#CONTACT_DATA">CONTACT_DATA</a></code></div>
<div class="col-last odd-row-color"><code>"\u041e\u0441\u0442\u0430\u0432\u044c\u0442\u0435 \u0412\u0430\u0448 \u0442\u0435\u043b\u0435\u0444\u043e\u043d \u0438 \u0441 \u0412\u0430\u043c\u0438 \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u0441\u0432\u044f\u0436\u0435\u0442\u0441\u044f \u043d\u0430\u0448 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.DOG_SAFETY_RULES">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#DOG_SAFETY_RULES">DOG_SAFETY_RULES</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u0420\u0410\u0412\u0418\u041b\u0410 \u041f\u041e\u0412\u0415\u0414\u0415\u041d\u0418\u042f \u041d\u0410 \u0422\u0415\u0420\u0420\u0418\u0422\u041e\u0420\u0418\u0418 \u041f\u0420\u0418\u042e\u0422\u0410:\n1. \u041f\u043e\u0441\u043b\u0435 \u0432\u0445\u043e\u0434\u0430 \u0438 \u0432\u044b\u0445\u043e\u0434\u0430 \u0438\u0437 \u0432\u043e\u043b\u044c\u0435\u0440\u043e\u0432 \u0442\u0449\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u0441\u043b\u0435\u0434\u0438\u0442\u044c \u0437\u0430 \u0442\u0435\u043c, \u0447\u0442\u043e\u0431\u044b \u0434\u0432\u0435\u0440\u0438 \u0431\u044b\u043b\u0438 \u0445\u043e\u0440\u043e\u0448\u043e \u0437\u0430\u043a\u0440\u044b\u0442\u044b \u043d\u0430 \u0449\u0435\u043a\u043e\u043b\u0434\u0443.\n2. \u041f\u0435\u0440\u0435\u0434 \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u043e\u0439 \u0441 \u0441\u043e\u0431\u0430\u043a\u043e\u0439 \u0437\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0435\u0439 \u043f\u0440\u0438\u044e\u0442\u0430 \u0442\u0449\u0430\u0442\u0435\u043b\u044c\u043d\u043e \u043f\u0440\u043e\u0432\u0435\u0440\u0438\u0442\u044c \u043d\u0430 \u0446\u0435\u043b\u043e\u0441\u0442\u043d\u043e\u0441\u0442\u044c \u043f\u043e\u0432\u043e\u0434\u043a\u0430,\n\u043d\u0430\u0434\u0435\u0436\u043d\u043e\u0441\u0442\u044c \u043a\u0430\u0440\u0430\u0431\u0438\u043d\u0430, \u043d\u0430\u0441\u043a\u043e\u043b\u044c\u043a\u043e \u0442\u0443\u0433\u043e \u0437\u0430\u0442\u044f\u043d\u0443\u0442 \u043e\u0448\u0435\u0439\u043d\u0438\u043a, \u0434\u0430\u0431\u044b \u0438\u0437\u0431\u0435\u0436\u0430\u0442\u044c \u0441\u0440\u044b\u0432\u0430 \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0441 \u043f\u043e\u0432\u043e\u0434\u043a\u0430 \u0432\u043e \u0432\u0440\u0435\u043c\u044f \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u0438.\n3. \u0414\u043b\u044f \u0443\u0433\u043e\u0449\u0435\u043d\u0438\u044f \u0441\u043e\u0431\u0430\u043a \u043c\u043e\u0436\u043d\u043e \u043f\u0440\u0438\u043d\u043e\u0441\u0438\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0435 \u0441\u043e\u0431\u0430\u0447\u044c\u0438 \u043b\u0430\u043a\u043e\u043c\u0441\u0442\u0432\u0430. \u041d\u0438\u0447\u0435\u0433\u043e \u0441\u043e\u043b\u0435\u043d\u043e\u0433\u043e, \u0441\u043b\u0430\u0434\u043a\u043e\u0433\u043e,\n\u0436\u0438\u0440\u043d\u043e\u0433\u043e, \u043d\u0438\u043a\u0430\u043a\u0438\u0445 \u043a\u0443\u0440\u0438\u043d\u044b\u0445 \u043a\u043e\u0441\u0442\u0435\u0439!\n4. \u0423\u0433\u043e\u0449\u0430\u0442\u044c \u0441\u043e\u0431\u0430\u043a\u0443 \u0447\u0435\u0440\u0435\u0437 \u0441\u0435\u0442\u043a\u0443 \u0432\u043e\u043b\u044c\u0435\u0440\u0430 \u043a\u0430\u0442\u0435\u0433\u043e\u0440\u0438\u0447\u0435\u0441\u043a\u0438 \u0437\u0430\u043f\u0440\u0435\u0449\u0430\u0435\u0442\u0441\u044f! \u041c\u043e\u0436\u043d\u043e \u043b\u0438\u0431\u043e \u0432\u043e\u0439\u0442\u0438 \u0432 \u0432\u043e\u043b\u044c\u0435\u0440 \u0441\u043e \u0437\u043d\u0430\u043a\u043e\u043c\u044b\u043c\u0438\n\u0441\u043e\u0431\u0430\u043a\u0430\u043c\u0438, \u043b\u0438\u0431\u043e \u0443\u0433\u043e\u0441\u0442\u0438\u0442\u044c \u0441\u043e\u0431\u0430\u043a\u0443 \u043d\u0430 \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u0435.\n5. \u041f\u0435\u0440\u0435\u0434 \u0442\u0435\u043c, \u043a\u0430\u043a \u0432\u0437\u044f\u0442\u044c \u043d\u0430 \u043f\u0440\u043e\u0433\u0443\u043b\u043a\u0443 \u043d\u043e\u0432\u0443\u044e (\u043d\u0435\u0437\u043d\u0430\u043a\u043e\u043c\u0443\u044e) \u0441\u043e\u0431\u0430\u043a\u0443, \u0441\u043f\u0440\u043e\u0441\u0438\u0442\u0435 \u0443 \u0441\u0442\u0430\u0440\u0448\u0438\u0445 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u043e\u0432 \u0438\u043b\u0438\n\u0440\u0430\u0431\u043e\u0442\u043d\u0438\u043a\u043e\u0432 - \u043c\u043e\u0436\u043d\u043e \u043b\u0438 \u0441 \u043d\u0435\u0439 \u0433\u0443\u043b\u044f\u0442\u044c.\n6. \u041d\u0435 \u0437\u0430\u0445\u043e\u0434\u0438\u0442\u0435 \u0431\u0435\u0437 \u043e\u043f\u044b\u0442\u043d\u044b\u0445 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0436\u0434\u0430\u044e\u0449\u0438\u0445 \u0432 \u0432\u043e\u043b\u044c\u0435\u0440\u044b \u0441 \u043d\u0435\u0437\u043d\u0430\u043a\u043e\u043c\u044b\u043c\u0438 \u0441\u043e\u0431\u0430\u043a\u0430\u043c\u0438!\n\u041d\u0435 \u0432\u0441\u0435 \u0441\u043e\u0431\u0430\u043a\u0438 \u043c\u0438\u043b\u044b\u0435 \u0438 \u0434\u0440\u0443\u0436\u0435\u043b\u044e\u0431\u043d\u044b\u0435, \u043c\u043d\u043e\u0433\u0438\u0435 \u0432\u044b\u0440\u043e\u0441\u043b\u0438 \u043d\u0430 \u0443\u043b\u0438\u0446\u0435 \u0438 \u043b\u044e\u0434\u044f\u043c \u043d\u0435 \u043e\u0441\u043e\u0431\u043e \u0434\u043e\u0432\u0435\u0440\u044f\u044e\u0442.\n\u0418\u043b\u0438 \u0436\u0435 \u043e\u043d\u0438 \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0441\u0442\u043e\u043b\u044c\u043a\u043e \u0440\u0430\u0434\u044b \u0432\u0430\u043c, \u0447\u0442\u043e \u0432\u044b \u043d\u0435 \u0441\u0443\u043c\u0435\u0435\u0442\u0435 \u0441\u043e\u0432\u043b\u0430\u0434\u0430\u0442\u044c \u0441 \u044d\u0442\u043e\u0439 \u0440\u0430\u0434\u043e\u0441\u0442\u044c\u044e.\n7. \u0415\u0441\u043b\u0438 \u0432\u044b \u0441\u043e\u0431\u0438\u0440\u0430\u0435\u0442\u0435\u0441\u044c \u043f\u043e\u0441\u0435\u0442\u0438\u0442\u044c \u043d\u0430\u0441 \u0432\u043f\u0435\u0440\u0432\u044b\u0435 - \u0441\u0432\u044f\u0436\u0438\u0442\u0435\u0441\u044c \u0441 \u043e\u043f\u044b\u0442\u043d\u044b\u043c\u0438 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0430\u043c\u0438,\n\u0432\u0430\u0441 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0434\u044f\u0442 \u0438 \u043f\u043e\u043c\u043e\u0433\u0443\u0442 \u0441 \u0430\u0434\u0430\u043f\u0442\u0430\u0446\u0438\u0435\u0439.\n8. \u041f\u043e \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u043f\u0440\u0438\u044e\u0442\u0430 \u043f\u0435\u0440\u0435\u0434\u0432\u0438\u0433\u0430\u0439\u0442\u0435\u0441\u044c \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u043e, \u043d\u0435 \u0431\u0435\u0433\u0430\u0439\u0442\u0435, \u043d\u0435 \u043c\u0430\u0448\u0438\u0442\u0435 \u0440\u0443\u043a\u0430\u043c\u0438, \u0433\u043e\u0432\u043e\u0440\u0438\u0442\u0435 \u0441\u043f\u043e\u043a\u043e\u0439\u043d\u043e.\n\u041a\u043e\u043d\u0435\u0447\u043d\u043e \u0431\u044b\u0432\u0430\u044e\u0442 \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f, \u043a\u043e\u0433\u0434\u0430 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043a\u0440\u0438\u043a\u043d\u0443\u0442\u044c \u0438\u043b\u0438 \u0440\u0430\u0437\u043d\u044f\u0442\u044c \u0434\u0435\u0440\u0443\u0449\u0438\u0445\u0441\u044f - \u043d\u043e \u044d\u0442\u043e \u043e\u0441\u043e\u0431\u044b\u0439 \u043f\u0443\u043d\u043a\u0442.\n9. \u0415\u0441\u043b\u0438 \u043f\u0440\u0438 \u0432\u0430\u0441 \u0441\u043e\u0431\u0430\u043a\u0438 \u043d\u0430\u0447\u0430\u043b\u0438 \u0434\u0440\u0430\u043a\u0443 - \u043d\u0435 \u043b\u0435\u0437\u044c\u0442\u0435 \u0433\u043e\u043b\u044b\u043c\u0438 \u0440\u0443\u043a\u0430\u043c\u0438 \u0438\u0445 \u0440\u0430\u0437\u043d\u0438\u043c\u0430\u0442\u044c!!!! \u0421\u0440\u0430\u0437\u0443 \u0437\u043e\u0432\u0438\u0442\u0435 \u043d\u0430 \u043f\u043e\u043c\u043e\u0449\u044c!!!\n\u0412\u0430\u043c \u043f\u043e\u043c\u043e\u0433\u0443\u0442 \u043b\u0438\u0431\u043e \u043e\u043f\u044b\u0442\u043d\u044b\u0435 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u044b, \u043b\u0438\u0431\u043e \u0440\u0430\u0431\u043e\u0442\u043d\u0438\u043a\u0438. \u0412 \u043a\u0440\u0430\u0439\u043d\u0435\u043c \u0441\u043b\u0443\u0447\u0430\u0435, \u0432\u043e\u0437\u044c\u043c\u0438\u0442\u0435 \u043a\u0430\u043a\u043e\u0439-\u043b\u0438\u0431\u043e \u0438\u043d\u0441\u0442\u0440\u0443\u043c\u0435\u043d\u0442\n(\u043b\u043e\u043f\u0430\u0442\u0430, \u043c\u0435\u0442\u043b\u0430) \u0438 \u043f\u043e\u043f\u0440\u043e\u0431\u0443\u0439\u0442\u0435 \u0438\u043c \u0440\u0430\u0437\u043d\u044f\u0442\u044c \u0434\u0435\u0440\u0443\u0449\u0438\u0445\u0441\u044f!\n10. \u041f\u0440\u0438 \u043f\u0435\u0440\u0432\u043e\u043c \u043f\u043e\u0441\u0435\u0449\u0435\u043d\u0438\u0438 \u043d\u0435 \u0442\u0440\u043e\u0433\u0430\u0439\u0442\u0435 \u0441\u043e\u0431\u0430\u043a, \u043d\u0435 \u0441\u043c\u043e\u0442\u0440\u0438\u0442\u0435 \u0432 \u0433\u043b\u0430\u0437\u0430. \u0421\u043f\u043e\u043a\u043e\u0439\u043d\u043e \u043f\u0440\u043e\u0445\u043e\u0434\u0438\u0442\u0435 \u0438 \u0437\u0430\u043d\u0438\u043c\u0430\u0439\u0442\u0435\u0441\u044c \u0434\u0435\u043b\u0430\u043c\u0438.\n\u041a\u043e\u0433\u0434\u0430 \u0441\u043e\u0431\u0430\u043a\u0438 \u0441 \u0432\u0430\u043c\u0438 \u043f\u043e\u0437\u043d\u0430\u043a\u043e\u043c\u044f\u0442\u0441\u044f (\u043e\u0431\u043d\u044e\u0445\u0430\u044e\u0442), \u0442\u043e\u0433\u0434\u0430 \u043c\u043e\u0436\u043d\u043e \u0438 \u043f\u043e\u0433\u043b\u0430\u0434\u0438\u0442\u044c.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.DOG_SCHEDULE_ADDRESS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#DOG_SCHEDULE_ADDRESS">DOG_SCHEDULE_ADDRESS</a></code></div>
<div class="col-last odd-row-color"><code>"\u041d\u0430\u0448 \u0430\u0434\u0440\u0435\u0441:\n\u0443\u043b. \u0411\u0440\u0443\u0441\u0438\u043b\u043e\u0432\u0430, 32\u0411\n\n\u0415\u0436\u0435\u0434\u043d\u0435\u0432\u043d\u043e \u0441 11:00 \u0434\u043e 18:00\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.DOG_SHELTER_INFO">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#DOG_SHELTER_INFO">DOG_SHELTER_INFO</a></code></div>
<div class="col-last even-row-color"><code>"\u0414\u043e\u0431\u0440\u043e \u043f\u043e\u0436\u0430\u043b\u043e\u0432\u0430\u0442\u044c \u0432 \u043d\u0430\u0448 \u043f\u0440\u0438\u044e\u0442, \u0441\u043e\u0437\u0434\u0430\u043d\u043d\u044b\u0439 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0430\u043c\u0438 \u043f\u0440\u0438\u044e\u0442\u0430 \"\u0412\u043e\u043b\u043d\u0430\" \u0434\u043b\u044f \u043f\u043e\u0438\u0441\u043a\u0430 \u043d\u0430\u0445\u043e\u0434\u044f\u0449\u0438\u043c\u0441\u044f \u0437\u0434\u0435\u0441\u044c \u0441\u043e\u0431\u0430\u043a\u0430\u043c\n\u0442\u0435\u043f\u043b\u043e\u0433\u043e, \u043b\u044e\u0431\u044f\u0449\u0435\u0433\u043e \u0438 \u043d\u0430\u0434\u0435\u0436\u043d\u043e\u0433\u043e \u0434\u043e\u043c\u0430.\n\u041a \u0441\u043e\u0436\u0430\u043b\u0435\u043d\u0438\u044e, \u0431\u0435\u0437\u0434\u043e\u043c\u043d\u044b\u0435 \u0441\u043e\u0431\u0430\u043a\u0438 \u043d\u0435 \u0438\u0441\u0447\u0435\u0437\u043d\u0443\u0442 \u0441 \u0443\u043b\u0438\u0446 \u0433\u043e\u0440\u043e\u0434\u0430;\n\u0441\u0435\u0439\u0447\u0430\u0441 \u0438\u0445 \u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u0440\u0435\u0433\u0443\u043b\u0438\u0440\u0443\u044e\u0442 \u043f\u0443\u0442\u0435\u043c \u043e\u0442\u043b\u043e\u0432\u0430 \u0438 \u0440\u0430\u0437\u043c\u0435\u0449\u0435\u043d\u0438\u044f \u0432 \u043f\u0440\u0438\u044e\u0442\u044b.\n\u0411\u0435\u0437 \u043d\u0430\u0448\u0435\u0439 \u043f\u043e\u043c\u043e\u0449\u0438 \u043e\u043d\u0438 \u043d\u0438\u043a\u043e\u0433\u0434\u0430 \u043d\u0435 \u043f\u043e\u043b\u0443\u0447\u0430\u0442 \u0448\u0430\u043d\u0441\u0430 \u043d\u0430 \u043d\u043e\u0432\u0443\u044e, \u0431\u043e\u043b\u0435\u0435 \u0441\u0432\u0435\u0442\u043b\u0443\u044e \u0438 \u0434\u043e\u0441\u0442\u043e\u0439\u043d\u0443\u044e \u0436\u0438\u0437\u043d\u044c,\n\u043f\u043e\u043b\u043d\u0443\u044e \u043b\u044e\u0431\u0432\u0438 \u0438 \u0437\u0430\u0431\u043e\u0442\u044b \u0445\u043e\u0437\u044f\u0438\u043d\u0430, \u043d\u0438\u043a\u043e\u0433\u0434\u0430 \u043d\u0435 \u043f\u043e\u0434\u0435\u043b\u044f\u0442\u0441\u044f \u0441 \u0447\u0435\u043b\u043e\u0432\u0435\u043a\u043e\u043c \u0441\u0432\u043e\u0435\u0439 \u0431\u0435\u0437\u0433\u0440\u0430\u043d\u0438\u0447\u043d\u043e\u0439 \u043d\u0435\u0436\u043d\u043e\u0441\u0442\u044c\u044e.\n\u0415\u0441\u043b\u0438 \u0432\u044b \u0445\u043e\u0442\u0438\u0442\u0435, \u0447\u0442\u043e\u0431\u044b \u0432 \u0432\u0430\u0448\u0435\u043c \u0434\u043e\u043c\u0435 \u043f\u043e\u0441\u0435\u043b\u0438\u043b\u0430\u0441\u044c \u043c\u0430\u043b\u0435\u043d\u044c\u043a\u0430\u044f \u043f\u0443\u0448\u0438\u0441\u0442\u0430\u044f \u0440\u0430\u0434\u043e\u0441\u0442\u044c \u2013 \u043f\u043e\u0438\u0449\u0438\u0442\u0435 \u0435\u0433\u043e \u0432 \u043f\u0440\u0438\u044e\u0442\u0435!\n\u0421\u043f\u0430\u0441\u0438\u0431\u043e \u0432\u0430\u043c \u0437\u0430 \u0434\u043e\u0431\u0440\u043e\u0442\u0443!\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.EXIT_THE_REPORT_FORM">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#EXIT_THE_REPORT_FORM">EXIT_THE_REPORT_FORM</a></code></div>
<div class="col-last odd-row-color"><code>"\u041e\u0442\u043c\u0435\u043d\u0438\u0442\u044c \u043e\u0442\u043f\u0440\u0430\u0432\u043a\u0443 \u043e\u0442\u0447\u0435\u0442\u0430"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.FORM_FOR_REPORT">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#FORM_FOR_REPORT">FORM_FOR_REPORT</a></code></div>
<div class="col-last even-row-color"><code>"&lt;u&gt;\u0424\u043e\u0440\u043c\u0430 \u0435\u0436\u0435\u0434\u043d\u0435\u0432\u043d\u043e\u0433\u043e \u043e\u0442\u0447\u0435\u0442\u0430:&lt;/u&gt;      &lt;b&gt;1. \u0420\u0430\u0446\u0438\u043e\u043d \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e:&lt;/b&gt; &lt;i&gt;\u0443\u043a\u0430\u0436\u0438\u0442\u0435, \u0447\u0435\u043c \u043a\u043e\u0440\u043c\u0438\u043b\u0438 \u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0437\u0430 \u043f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0435 \u0441\u0443\u0442\u043a\u0438&lt;/i&gt;      &lt;b&gt;2. \u041e\u0431\u0449\u0435\u0435 \u0441\u0430\u043c\u043e\u0447\u0443\u0432\u0441\u0442\u0432\u0438\u0435 \u0438 \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u043d\u0438\u0435 \u043a \u043d\u043e\u0432\u043e\u043c\u0443 \u043c\u0435\u0441\u0442\u0443:&lt;/b&gt;  &lt;i&gt;\u043e\u043f\u0438\u0448\u0438\u0442\u0435 \u0444\u0438\u0437\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0438 \u043c\u043e\u0440\u0430\u043b\u044c\u043d\u043e\u0435(\u0435\u0441\u043b\u0438 \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e) \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435 \u043f\u0438\u0442\u043e\u043c\u0446\u0430. \u041a\u0430\u043a \u043e\u043d \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u0435\u0442 \u043a \u0434\u043e\u043c\u0443, \u043a \u0441\u0435\u043c\u044c\u0435, \u043a \u043c\u0435\u0441\u0442\u0443, \u0433\u0434\u0435 \u043e\u043d \u0441\u043f\u0438\u0442 \u0438 \u0445\u043e\u0434\u0438\u0442 \u0432 \u0442\u0443\u0430\u043b\u0435\u0442 (\u0435\u0441\u043b\u0438 \u044d\u0442\u043e \u043f\u0440\u0435\u0434\u0443\u0441\u043c\u043e\u0442\u0440\u0435\u043d\u043e)&lt;/i&gt;      &lt;b&gt;3. \u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0435 \u0432 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u0438:&lt;/b&gt;  &lt;i&gt;\u043d\u0430\u043f\u0438\u0448\u0438\u0442\u0435, \u0437\u0430\u043c\u0435\u0442\u0438\u043b\u0438 \u043b\u0438 \u0447\u0442\u043e-\u0442\u043e \u043d\u043e\u0432\u043e\u0435 \u0438\u043b\u0438 \u043d\u0435\u043e\u0431\u044b\u0447\u043d\u043e\u0435 \u0432 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u0438\u043f\u0438\u0442\u043e\u043c\u0446\u0430 \u0437\u0430 \u043f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0435 \u0441\u0443\u0442\u043a\u0438. \u041f\u043e\u044f\u0432\u0438\u043b\u0438\u0441\u044c \u043b\u0438 \u043a\u0430\u043a\u0438\u0435-\u0442\u043e \u043d\u043e\u0432\u044b\u0435 \u043f\u0440\u0438\u0432\u044b\u0447\u043a\u0438 \u0438\u043b\u0438 \u043f\u0440\u0438\u0441\u0442\u0440\u0430\u0441\u0442\u0438\u044f&lt;/i&gt; "</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.GREETING_INFO">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#GREETING_INFO">GREETING_INFO</a></code></div>
<div class="col-last odd-row-color"><code>"\u0417\u0434\u0440\u0430\u0432\u0441\u0442\u0432\u0443\u0439\u0442\u0435, \u0437\u0434\u0435\u0441\u044c \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044e \u043e \u043f\u0440\u0438\u044e\u0442\u0435: \u0433\u0434\u0435 \u043e\u043d \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f, \u043a\u0430\u043a \u0438 \u043a\u043e\u0433\u0434\u0430 \u0440\u0430\u0431\u043e\u0442\u0430\u0435\u0442,\n\u043a\u0430\u043a\u0438\u0435 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u0440\u043e\u043f\u0443\u0441\u043a\u0430 \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u044e \u043f\u0440\u0438\u044e\u0442\u0430, \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u043d\u0430\u0445\u043e\u0436\u0434\u0435\u043d\u0438\u044f \u0432\u043d\u0443\u0442\u0440\u0438 \u0438 \u043e\u0431\u0449\u0435\u043d\u0438\u044f \u0441 \u043f\u0438\u0442\u043e\u043c\u0446\u0435\u043c.\n\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043a\u043e\u043c\u0430\u043d\u0434\u0443 \u0432 \u043c\u0435\u043d\u044e \u2b07\n\u0415\u0441\u043b\u0438 \u043d\u0443\u0436\u043d\u043e\u0433\u043e \u0432\u043e\u043f\u0440\u043e\u0441\u0430 \u043d\u0435\u0442 \u0432 \u043c\u0435\u043d\u044e, \u043f\u043e\u0437\u043e\u0432\u0438\u0442\u0435 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0430, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043f\u043e\u043c\u043e\u0436\u0435\u0442 \u0412\u0430\u043c.\n\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.NO_PHOTO_IN_THE_REPORT">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#NO_PHOTO_IN_THE_REPORT">NO_PHOTO_IN_THE_REPORT</a></code></div>
<div class="col-last even-row-color"><code>"\u0412\u044b \u0437\u0430\u0431\u044b\u043b\u0438 \u043f\u0440\u0438\u043a\u0440\u0435\u043f\u0438\u0442\u044c \u0444\u043e\u0442\u043e \u043a \u043e\u0442\u0447\u0435\u0442\u0443.\n\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043e\u0442\u043f\u0440\u0430\u0432\u044c\u0442\u0435 \u043e\u0442\u0447\u0435\u0442 \u0435\u0449\u0435 \u0440\u0430\u0437, \u043f\u0440\u0438\u043a\u0440\u0435\u043f\u0438\u0432 \u043a \u043d\u0435\u043c\u0443 \u0444\u043e\u0442\u043e \u0412\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.NO_TEXT_IN_THE_REPORT">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#NO_TEXT_IN_THE_REPORT">NO_TEXT_IN_THE_REPORT</a></code></div>
<div class="col-last odd-row-color"><code>"\u0412\u044b \u0437\u0430\u0431\u044b\u043b\u0438 \u043d\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u0443\u044e \u0447\u0430\u0441\u0442\u044c \u043e\u0442\u0447\u0435\u0442\u0430.\n\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043e\u0442\u043f\u0440\u0430\u0432\u044c\u0442\u0435 \u043e\u0442\u0447\u0435\u0442 \u0435\u0449\u0435 \u0440\u0430\u0437, \u043d\u0430\u043f\u0438\u0441\u0430\u0432 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u0443\u044e \u0447\u0430\u0441\u0442\u044c \u0438  \u043f\u0440\u0438\u043a\u0440\u0435\u043f\u0438\u0432 \u043a \u043d\u0435\u043c\u0443 \u0444\u043e\u0442\u043e \u0412\u0430\u0448\u0435\u0433\u043e \u043f\u0438\u0442\u043e\u043c\u0446\u0430.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.PROBATION_PERIOD_FAILED">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#PROBATION_PERIOD_FAILED">PROBATION_PERIOD_FAILED</a></code></div>
<div class="col-last even-row-color"><code>"\u0412\u044b \u043d\u0435 \u0441\u043f\u0440\u0430\u0432\u0438\u043b\u0438\u0441\u044c \u0441 \u0438\u0441\u043f\u044b\u0442\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u043c \u0441\u0440\u043e\u043a\u043e\u043c.\n\u0412\u0430\u043c \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u0432 \u0442\u0435\u0447\u0435\u043d\u0438\u0438 \u0442\u0440\u0435\u0445 \u0434\u043d\u0435\u0439 \u0432\u0435\u0440\u043d\u0443\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0432 \u043f\u0440\u0438\u044e\u0442.\n\u041f\u043e \u0432\u0441\u0435\u043c \u0432\u043e\u043f\u0440\u043e\u0441\u0430\u043c \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u0440\u043e\u043a\u043e\u043d\u0441\u0443\u043b\u044c\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0441 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u043e\u043c \u043f\u0440\u0438\u044e\u0442\u0430.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.REPORT_ACCEPTED">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#REPORT_ACCEPTED">REPORT_ACCEPTED</a></code></div>
<div class="col-last odd-row-color"><code>"\u0412\u0430\u0448 \u043e\u0442\u0447\u0435\u0442 \u043f\u0440\u0438\u043d\u044f\u0442. \u0415\u0441\u043b\u0438 \u0441\u0447\u0438\u0442\u0430\u0435\u0442\u0435, \u0447\u0442\u043e \u0447\u0442\u043e-\u0442\u043e \u0443\u043f\u0443\u0441\u0442\u0438\u043b\u0438,\n\u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u0440\u0438\u0441\u043b\u0430\u0442\u044c \u043e\u0442\u0447\u0435\u0442 \u043f\u043e\u0432\u0442\u043e\u0440\u043d\u043e.\n\u0421\u043f\u0430\u0441\u0438\u0431\u043e.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SAFETY_PRECAUTIONS">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SAFETY_PRECAUTIONS">SAFETY_PRECAUTIONS</a></code></div>
<div class="col-last even-row-color"><code>"\u041d\u0430\u0445\u043e\u0434\u044f\u0441\u044c \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u043f\u0440\u0438\u044e\u0442\u0430, \u043f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u0441\u043e\u0431\u043b\u044e\u0434\u0430\u0439\u0442\u0435 \u043d\u0430\u0448\u0438 \u043f\u0440\u0430\u0432\u0438\u043b\u0430 \u0438 \u0442\u0435\u0445\u043d\u0438\u043a\u0443 \u0431\u0435\u0437\u043e\u043f\u0430\u0441\u043d\u043e\u0441\u0442\u0438!\n\u0417\u0430\u043f\u0440\u0435\u0449\u0430\u0435\u0442\u0441\u044f:\n- \u0421\u0430\u043c\u043e\u0441\u0442\u043e\u044f\u0442\u0435\u043b\u044c\u043d\u043e \u043e\u0442\u043a\u0440\u044b\u0432\u0430\u0442\u044c \u0432\u044b\u0433\u0443\u043b\u044b \u0438 \u0432\u043e\u043b\u044c\u0435\u0440\u044b \u0431\u0435\u0437 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u0438\u044f \u0440\u0430\u0431\u043e\u0442\u043d\u0438\u043a\u0430 \u043f\u0440\u0438\u044e\u0442\u0430.\n- \u041a\u043e\u0440\u043c\u0438\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445. \u042d\u0442\u0438\u043c \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0441\u043f\u0440\u043e\u0432\u043e\u0446\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0434\u0440\u0430\u043a\u0443. \u0423\u0433\u043e\u0449\u0435\u043d\u0438\u044f \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u044b \u0442\u043e\u043b\u044c\u043a\u043e \u043f\u043e\u0441\u0442\u043e\u044f\u043d\u043d\u044b\u043c\n\u043e\u043f\u0435\u043a\u0443\u043d\u0430\u043c \u0438 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0430\u043c, \u0432\u043e \u0432\u0440\u0435\u043c\u044f \u043f\u0440\u043e\u0433\u0443\u043b\u043e\u043a \u0441 \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c\u0438 \u043d\u0430 \u043f\u043e\u0432\u043e\u0434\u043a\u0435.\n- \u041e\u0441\u0442\u0430\u0432\u043b\u044f\u0442\u044c \u043f\u043e\u0441\u043b\u0435 \u0441\u0435\u0431\u044f \u043c\u0443\u0441\u043e\u0440 \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u043f\u0440\u0438\u044e\u0442\u0430 \u0438 \u043f\u0440\u0438\u043b\u0435\u0433\u0430\u044e\u0449\u0435\u0439 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438.\n- \u041f\u043e\u0434\u0445\u043e\u0434\u0438\u0442\u044c \u0431\u043b\u0438\u0437\u043a\u043e \u043a \u0432\u043e\u043b\u044c\u0435\u0440\u0430\u043c \u0438 \u0433\u043b\u0430\u0434\u0438\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445 \u0447\u0435\u0440\u0435\u0437 \u0441\u0435\u0442\u043a\u0443 \u043d\u0430 \u0432\u044b\u0433\u0443\u043b\u0430\u0445. \u0416\u0438\u0432\u043e\u0442\u043d\u044b\u0435 \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u0430\u0433\u0440\u0435\u0441\u0441\u0438\u0432\u043d\u044b!\n- \u041a\u0440\u0438\u0447\u0430\u0442\u044c, \u0440\u0430\u0437\u043c\u0430\u0445\u0438\u0432\u0430\u0442\u044c \u0440\u0443\u043a\u0430\u043c\u0438, \u0431\u0435\u0433\u0430\u0442\u044c \u043c\u0435\u0436\u0434\u0443 \u0431\u0443\u0434\u043a\u0430\u043c\u0438 \u0438\u043b\u0438 \u0432\u043e\u043b\u044c\u0435\u0440\u0430\u043c\u0438, \u043f\u0443\u0433\u0430\u0442\u044c \u0438 \u0434\u0440\u0430\u0437\u043d\u0438\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u0445.\n- \u041f\u043e\u0441\u0435\u0449\u0435\u043d\u0438\u0435 \u043f\u0440\u0438\u044e\u0442\u0430 \u0434\u043b\u044f \u0434\u0435\u0442\u0435\u0439 \u0434\u043e\u0448\u043a\u043e\u043b\u044c\u043d\u043e\u0433\u043e \u0438 \u043c\u043b\u0430\u0434\u0448\u0435\u0433\u043e \u0448\u043a\u043e\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u043e\u0437\u0440\u0430\u0441\u0442\u0430 \u0431\u0435\u0437 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0436\u0434\u0435\u043d\u0438\u044f \u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445.\n- \u041d\u0430\u0445\u043e\u0436\u0434\u0435\u043d\u0438\u0435 \u043d\u0430 \u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0438 \u043f\u0440\u0438\u044e\u0442\u0430 \u0434\u0435\u0442\u0435\u0439 \u0441\u0440\u0435\u0434\u043d\u0435\u0433\u043e \u0438 \u0441\u0442\u0430\u0440\u0448\u0435\u0433\u043e \u0448\u043a\u043e\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u043e\u0437\u0440\u0430\u0441\u0442\u0430 \u0431\u0435\u0437 \u0441\u043e\u043f\u0440\u043e\u0432\u043e\u0436\u0434\u0435\u043d\u0438\u044f\n\u0432\u0437\u0440\u043e\u0441\u043b\u044b\u0445 \u0438\u043b\u0438 \u043f\u0438\u0441\u044c\u043c\u0435\u043d\u043d\u043e\u0439 \u0441\u043f\u0440\u0430\u0432\u043a\u0438-\u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u0438\u044f \u043e\u0442 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0435\u0439 \u0438\u043b\u0438 \u0437\u0430\u043a\u043e\u043d\u043d\u044b\u0445 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u0435\u0439.\n- \u0421\u0430\u043c\u043e\u0441\u0442\u043e\u044f\u0442\u0435\u043b\u044c\u043d\u043e \u0437\u0430\u0445\u043e\u0434\u0438\u0442\u044c \u0432 \u043f\u043e\u043c\u0435\u0449\u0435\u043d\u0438\u0435 \u043a \u0436\u0438\u0432\u043e\u0442\u043d\u044b\u043c \u0431\u0435\u0437 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043d\u0438\u044f \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u043e\u0432 \u043f\u0440\u0438\u044e\u0442\u0430.\n- \u041f\u043e\u0441\u0435\u0449\u0435\u043d\u0438\u0435 \u043f\u0440\u0438\u044e\u0442\u0430 \u0432 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438 \u0430\u043b\u043a\u043e\u0433\u043e\u043b\u044c\u043d\u043e\u0433\u043e, \u043d\u0430\u0440\u043a\u043e\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0433\u043e \u043e\u043f\u044c\u044f\u043d\u0435\u043d\u0438\u044f.\n"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SAFETY_RULES_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SAFETY_RULES_COMMAND_LABEL">SAFETY_RULES_COMMAND_LABEL</a></code></div>
<div class="col-last odd-row-color"><code>"\ud83d\udcc3 \u041f\u0440\u0430\u0432\u0438\u043b\u0430 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u044f \u0432 \u043f\u0440\u0438\u044e\u0442\u0435"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SCHEDULE_ADDRESS_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SCHEDULE_ADDRESS_COMMAND_LABEL">SCHEDULE_ADDRESS_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\ud83e\udded \u0410\u0434\u0440\u0435\u0441 \u0438 \u0440\u0430\u0441\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u043f\u0440\u0438\u044e\u0442\u0430"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SEND_FORM">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SEND_FORM">SEND_FORM</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0444\u043e\u0440\u043c\u0443 \u0435\u0436\u0435\u0434\u043d\u0435\u0432\u043d\u043e\u0433\u043e \u043e\u0442\u0447\u0435\u0442\u0430"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SHELTER_INFO_COMMAND_LABEL">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SHELTER_INFO_COMMAND_LABEL">SHELTER_INFO_COMMAND_LABEL</a></code></div>
<div class="col-last even-row-color"><code>"\u2753 \u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e \u043f\u0440\u0438\u044e\u0442\u0435"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.SUCCESSFUL_COMPLETION_OF_THE_PROBATION_PERIOD">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#SUCCESSFUL_COMPLETION_OF_THE_PROBATION_PERIOD">SUCCESSFUL_COMPLETION_OF_THE_PROBATION_PERIOD</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u043e\u0437\u0434\u0440\u0430\u0432\u043b\u044f\u0435\u043c! \u0412\u044b \u0443\u0441\u043f\u0435\u0448\u043d\u043e \u043f\u0440\u043e\u0448\u043b\u0438 \u0438\u0441\u043f\u044b\u0442\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u0441\u0440\u043e\u043a!\n\u0416\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0437\u0430\u043a\u0440\u0435\u043f\u043b\u0435\u043d\u043e \u0437\u0430 \u0412\u0430\u043c\u0438.\n\u041e\u0442\u0447\u0435\u0442\u044b \u043c\u043e\u0436\u043d\u043e \u0431\u043e\u043b\u044c\u0448\u0435 \u043d\u0435 \u043f\u0440\u0438\u0441\u044b\u043b\u0430\u0442\u044c.\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.constants.ShelterConstants.TRUSTEES_REPORT_INFO">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/constants/ShelterConstants.html#TRUSTEES_REPORT_INFO">TRUSTEES_REPORT_INFO</a></code></div>
<div class="col-last even-row-color"><code>"\u041d\u0430\u043f\u043e\u043c\u0438\u043d\u0430\u0435\u043c, \u0435\u0436\u0435\u0434\u043d\u0435\u0432\u043d\u044b\u0439 \u043e\u0442\u0447\u0435\u0442 \u0434\u043e\u043b\u0436\u0435\u043d \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u0442\u044c \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0443\u044e \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044e:\n\u0412 \u043e\u0434\u043d\u043e\u043c \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0438 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e \u043f\u0440\u0438\u0441\u043b\u0430\u0442\u044c:\n- \u041e\u0434\u043d\u043e (!\u0412\u0430\u0436\u043d\u043e) \u0444\u043e\u0442\u043e \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e\n- \u0420\u0430\u0446\u0438\u043e\u043d \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e, \u043e\u0431\u0449\u0435\u0435 \u0441\u0430\u043c\u043e\u0447\u0443\u0432\u0441\u0442\u0432\u0438\u0435 \u0438 \u043f\u0440\u0438\u0432\u044b\u043a\u0430\u043d\u0438\u0435 \u043a \u043d\u043e\u0432\u043e\u043c\u0443 \u043c\u0435\u0441\u0442\u0443,\n\u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0435 \u0432 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u0438: \u043e\u0442\u043a\u0430\u0437 \u043e\u0442 \u0441\u0442\u0430\u0440\u044b\u0445 \u043f\u0440\u0438\u0432\u044b\u0447\u0435\u043a, \u043f\u0440\u0438\u043e\u0431\u0440\u0435\u0442\u0435\u043d\u0438\u0435 \u043d\u043e\u0432\u044b\u0445.\n\u041d\u0430\u043f\u0438\u0448\u0438\u0442\u0435 \u0412\u0430\u0448 \u043e\u0442\u0447\u0435\u0442 \u0432 \u0442\u0435\u043a\u0441\u0442\u043e\u0432\u043e\u0439 \u0441\u0442\u0440\u043e\u043a\u0435 \u043d\u0438\u0436\u0435 \u0438 \u043f\u0440\u0438\u043a\u0440\u0435\u043f\u0438\u0442\u0435 \u043a \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u044e \u0444\u043e\u0442\u043e.\n"</code></div>
</div>
</li>
</ul>
<ul class="block-list">
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.service.<a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html" title="class in pro.sky.JD2AnimalShelterBot.service">StartCommand</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.StartCommand.CAT_BUTTON">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html#CAT_BUTTON">CAT_BUTTON</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u0440\u0438\u044e\u0442 \u0434\u043b\u044f \u043a\u043e\u0448\u0435\u043a"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.StartCommand.DOG_BUTTON">public&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html#DOG_BUTTON">DOG_BUTTON</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u0440\u0438\u044e\u0442 \u0434\u043b\u044f \u0441\u043e\u0431\u0430\u043a"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.StartCommand.GREETING">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html#GREETING">GREETING</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\ude00 \u041f\u0440\u0438\u0432\u0435\u0442 "</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.StartCommand.SHOOSING_PET_MESSAGE">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html#SHOOSING_PET_MESSAGE">SHOOSING_PET_MESSAGE</a></code></div>
<div class="col-last odd-row-color"><code>"\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u0432\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043f\u0440\u0438\u044e\u0442:\n\n"</code></div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.StartCommand.WELCOME_MESSAGE">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/StartCommand.html#WELCOME_MESSAGE">WELCOME_MESSAGE</a></code></div>
<div class="col-last even-row-color"><code>"\n\u042f \u043c\u043e\u0433\u0443 \u043e\u0442\u0432\u0435\u0442\u0438\u0442\u044c \u043d\u0430 \u0442\u0432\u043e\u0438 \u0432\u043e\u043f\u0440\u043e\u0441\u044b \u043e \u0442\u043e\u043c, \u0447\u0442\u043e \u043d\u0443\u0436\u043d\u043e \u0437\u043d\u0430\u0442\u044c \u0438 \u0443\u043c\u0435\u0442\u044c, \u0447\u0442\u043e\u0431\u044b \u0437\u0430\u0431\u0440\u0430\u0442\u044c \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0435 \u0438\u0437 \u043f\u0440\u0438\u044e\u0442\u0430\n\u041f\u043e\u043c\u043e\u0433\u0443 \u0440\u0430\u0437\u043e\u0431\u0440\u0430\u0442\u044c\u0441\u044f \u043a\u0430\u043a \u0441 \u0431\u044e\u0440\u043e\u043a\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438\u043c\u0438, \u0442\u0430\u043a \u0438 \u0441 \u0431\u044b\u0442\u043e\u0432\u044b\u043c\u0438 \u0432\u043e\u043f\u0440\u043e\u0441\u0430\u043c\u0438.\n\u0412\u044b\u0431\u0435\u0440\u0438 \u043f\u0443\u043d\u043a\u0442 \u043c\u0435\u043d\u044e \u043d\u0438\u0436\u0435\n"</code></div>
</div>
</li>
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.service.<a href="pro/sky/JD2AnimalShelterBot/service/TrusteesReportsService.html" title="class in pro.sky.JD2AnimalShelterBot.service">TrusteesReportsService</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.TrusteesReportsService.WARNING_TEXT">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/TrusteesReportsService.html#WARNING_TEXT">WARNING_TEXT</a></code></div>
<div class="col-last even-row-color"><code>"\u041f\u0440\u0435\u0434\u0443\u043f\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u0435:\n\u0414\u043e\u0440\u043e\u0433\u043e\u0439 \u0443\u0441\u044b\u043d\u043e\u0432\u0438\u0442\u0435\u043b\u044c, \u043c\u044b \u0437\u0430\u043c\u0435\u0442\u0438\u043b\u0438, \u0447\u0442\u043e \u0442\u044b \u0437\u0430\u043f\u043e\u043b\u043d\u044f\u0435\u0448\u044c \u043e\u0442\u0447\u0435\u0442 \u043d\u0435 \u0442\u0430\u043a \u043f\u043e\u0434\u0440\u043e\u0431\u043d\u043e, \u043a\u0430\u043a \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u043e.\n\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043f\u043e\u0434\u043e\u0439\u0434\u0438 \u043e\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043d\u043d\u0435\u0435 \u043a \u044d\u0442\u043e\u043c\u0443 \u0437\u0430\u043d\u044f\u0442\u0438\u044e.\n\u0412 \u043f\u0440\u043e\u0442\u0438\u0432\u043d\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u044b \u043f\u0440\u0438\u044e\u0442\u0430 \u0431\u0443\u0434\u0443\u0442 \u043e\u0431\u044f\u0437\u0430\u043d\u044b \u0441\u0430\u043c\u043e\u043b\u0438\u0447\u043d\u043e \u043f\u0440\u043e\u0432\u0435\u0440\u044f\u0442\u044c \u0443\u0441\u043b\u043e\u0432\u0438\u044f \u0441\u043e\u0434\u0435\u0440\u0436\u0430\u043d\u0438\u044f \u0436\u0438\u0432\u043e\u0442\u043d\u043e\u0433\u043e.\n"</code></div>
</div>
</li>
</ul>
<ul class="block-list">
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.service.user.<a href="pro/sky/JD2AnimalShelterBot/service/user/UserService.html" title="class in pro.sky.JD2AnimalShelterBot.service.user">UserService</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.user.UserService.SHARE_PHONE_NUMBER">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/user/UserService.html#SHARE_PHONE_NUMBER">SHARE_PHONE_NUMBER</a></code></div>
<div class="col-last even-row-color"><code>"\ud83d\udc49 \u041f\u043e\u0434\u0435\u043b\u0438\u0442\u044c\u0441\u044f \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u0430\u043c\u0438 \ud83d\udc48"</code></div>
<div class="col-first odd-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.user.UserService.WELCOME_MESSAGE">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second odd-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/user/UserService.html#WELCOME_MESSAGE">WELCOME_MESSAGE</a></code></div>
<div class="col-last odd-row-color"><code>"\u0427\u0442\u043e\u0431\u044b \u0441\u0432\u044f\u0437\u0430\u0442\u044c\u0441\u044f \u0441 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u043e\u043c, \u043f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043e\u0442\u043f\u0440\u0430\u0432\u044c\u0442\u0435 \u043d\u0430\u043c \u0441\u0432\u043e\u0438 \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u044b.\n\n\u0414\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043d\u0430\u0436\u043c\u0438\u0442\u0435 \u043a\u043d\u043e\u043f\u043a\u0443 \u0432\u043d\u0438\u0437\u0443 \u0438 \u043f\u043e\u0434\u0442\u0432\u0435\u0440\u0434\u0438\u0442\u0435 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0443 \u043a\u043e\u043d\u0442\u0430\u043a\u0442\u043e\u0432."</code></div>
</div>
</li>
</ul>
<ul class="block-list">
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.service.volunteer.<a href="pro/sky/JD2AnimalShelterBot/service/volunteer/CommunicationWithVolunteer.html" title="class in pro.sky.JD2AnimalShelterBot.service.volunteer">CommunicationWithVolunteer</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.volunteer.CommunicationWithVolunteer.CALL_VOLUNTEER_MESSAGE">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/volunteer/CommunicationWithVolunteer.html#CALL_VOLUNTEER_MESSAGE">CALL_VOLUNTEER_MESSAGE</a></code></div>
<div class="col-last even-row-color"><code>"\n\u041d\u0430\u043f\u0438\u0448\u0438\u0442\u0435, \u043f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043d\u0438\u0436\u0435 \u0412\u0430\u0448 \u0432\u043e\u043f\u0440\u043e\u0441 \u0438\u043b\u0438 \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435 \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0443.\n\u0412\u043e\u043b\u043e\u043d\u0442\u0435\u0440 \u0441\u0432\u044f\u0436\u0435\u0442\u0441\u044f \u0441 \u0412\u0430\u043c\u0438 \u0432 \u0431\u043b\u0438\u0436\u0430\u0439\u0448\u0435\u0435 \u0432\u0440\u0435\u043c\u044f. \ud83d\udc47\u270d\ufe0f\n"</code></div>
</div>
</li>
<li>
<div class="caption"><span>pro.sky.JD2AnimalShelterBot.service.volunteer.<a href="pro/sky/JD2AnimalShelterBot/service/volunteer/CorrespondenceService.html" title="class in pro.sky.JD2AnimalShelterBot.service.volunteer">CorrespondenceService</a></span></div>
<div class="summary-table three-column-summary">
<div class="table-header col-first">Modifier and Type</div>
<div class="table-header col-second">Constant Field</div>
<div class="table-header col-last">Value</div>
<div class="col-first even-row-color"><code id="pro.sky.JD2AnimalShelterBot.service.volunteer.CorrespondenceService.TEXT_TO_SEND">private&nbsp;static&nbsp;final&nbsp;<a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/String.html" title="class or interface in java.lang" class="external-link">String</a></code></div>
<div class="col-second even-row-color"><code><a href="pro/sky/JD2AnimalShelterBot/service/volunteer/CorrespondenceService.html#TEXT_TO_SEND">TEXT_TO_SEND</a></code></div>
<div class="col-last even-row-color"><code>"\n\u0412\u0430\u0448\u0435 \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435 \u043e\u0442\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043e \u0432\u043e\u043b\u043e\u043d\u0442\u0435\u0440\u0443 \u043f\u0440\u0438\u044e\u0442\u0430.\n\u041e\u043d \u043e\u0442\u0432\u0435\u0442\u0438\u0442 \u043d\u0430 \u0412\u0430\u0448\u0435 \u0441\u043e\u043e\u0431\u0449\u0435\u043d\u0438\u0435 \u0438\u043b\u0438 \u0441\u0432\u044f\u0436\u0435\u0442\u0441\u044f \u0441 \u0412\u0430\u043c\u0438 \u0432 \u0431\u043b\u0438\u0436\u0430\u0439\u0448\u0435\u0435 \u0432\u0440\u0435\u043c\u044f.\n"</code></div>
</div>
</li>
</ul>
</section>
</main>
</div>
</div>
</body>
</html>
